[
    {
        "ticker": "AOS",
        "name": "A. O. Smith",
        "url": "https://en.wikipedia.org/wiki/A._O._Smith",
        "desc": "A. O. Smith Corporation is an American manufacturer of both residential and commercial water heaters and boilers, and the largest manufacturer and marketer of water heaters in North America. It also supplies water treatment and water purification products in the Asian market.[6] The company has 27 locations worldwide, including five manufacturing facilities in North America, as well as plants in Bengaluru in India, Nanjing in China and Veldhoven in The Netherlands.[7]"
    },
    {
        "ticker": "ABT",
        "name": "Abbott",
        "url": "https://en.wikipedia.org/wiki/Abbott_Laboratories",
        "desc": "Abbott Laboratories is an American multinational medical devices and health care company with headquarters in Abbott Park, Illinois, United States. The company was founded by Chicago physician Wallace Calvin Abbott in 1888 to formulate known drugs; today, it sells medical devices, diagnostics, branded generic medicines and nutritional products. It split off its research-based pharmaceuticals business into AbbVie in 2013.[3][4]"
    },
    {
        "ticker": "ABBV",
        "name": "AbbVie",
        "url": "https://en.wikipedia.org/wiki/AbbVie",
        "desc": "AbbVie Inc. is an American pharmaceutical company headquartered in North Chicago, Illinois. It is ranked 6th on the list of largest biomedical companies by revenue. The company's primary product is Humira (adalimumab) ($21 billion in 2022 revenues, 37% of total), administered via injection. It is approved to treat autoimmune diseases including rheumatoid arthritis, Crohn's disease, plaque psoriasis, and ulcerative colitis."
    },
    {
        "ticker": "ACN",
        "name": "Accenture",
        "url": "https://en.wikipedia.org/wiki/Accenture",
        "desc": "Accenture plc is an Irish-American[5][6] professional services company based in Dublin, specializing in information technology (IT) services and consulting. A Fortune Global 500 company,[7] it reported revenues of $61.6 billion in 2022.[2] Accenture's current clients include 91 of the Fortune Global 100 and more than three-quarters of the Fortune Global 500.[8] As of 2022, Accenture is considered the largest consulting firm in the world by number of employees.[8][9]"
    },
    {
        "ticker": "ATVI",
        "name": "Activision Blizzard",
        "url": "https://en.wikipedia.org/wiki/Activision_Blizzard",
        "desc": "Activision Blizzard, Inc.[a] is an American video game holding company based in Santa Monica, California.[3] It was founded in July 2008 through the merger of Activision, Inc. (the publicly traded parent company of Activision Publishing) and Vivendi Games. It is traded on the Nasdaq stock exchange under the ticker symbol ATVI,[4] and since 2015 has been a member of the S&P 500 Index.[5] Activision Blizzard currently includes five business units:[6] Activision Publishing, Blizzard Entertainment, King,[7] Major League Gaming,[8] and Activision Blizzard Studios.[9][10]"
    },
    {
        "ticker": "ADM",
        "name": "ADM",
        "url": "https://en.wikipedia.org/wiki/ADM_(company)",
        "desc": "The Archer-Daniels-Midland Company, commonly known as ADM, is an American multinational food processing and commodities trading corporation founded in 1902 and headquartered in Chicago, Illinois. The company operates more than 270 plants and 420 crop procurement facilities worldwide, where cereal grains and oilseeds are processed into products used in food, beverage, nutraceutical, industrial, and animal feed markets worldwide."
    },
    {
        "ticker": "ADBE",
        "name": "Adobe Inc.",
        "url": "https://en.wikipedia.org/wiki/Adobe_Inc.",
        "desc": "Adobe Inc. (/əˈdoʊbi/ ə-DOH-bee), originally called Adobe Systems Incorporated, is an American multinational computer software company incorporated in Delaware[3] and headquartered in San Jose, California. It has historically specialized in software for the creation and publication of a wide range of content, including graphics, photography, illustration, animation, multimedia/video, motion pictures, and print. Its flagship products include Adobe Photoshop image editing software; Adobe Illustrator vector-based illustration software; Adobe Acrobat Reader and the Portable Document Format (PDF); and a host of tools primarily for audio-visual content creation, editing and publishing. Adobe offered a bundled solution of its products named Adobe Creative Suite, which evolved into a subscription software as a service (SaaS) offering named Adobe Creative Cloud.[4] The company also expanded into digital marketing software and in 2021 was considered one of the top global leaders in Customer Experience Management (CXM).[5]"
    },
    {
        "ticker": "ADP",
        "name": "ADP",
        "url": "https://en.wikipedia.org/wiki/ADP_(company)",
        "desc": "Automatic Data Processing, Inc. (ADP) is an American provider of human resources management software and services, headquartered in Roseland, New Jersey."
    },
    {
        "ticker": "AES",
        "name": "AES Corporation",
        "url": "https://en.wikipedia.org/wiki/AES_Corporation",
        "desc": "The AES Corporation is an American utility and power generation company. It owns and operates power plants, which it uses to generate and sell electricity to end users and intermediaries like utilities and industrial facilities. AES is headquartered in Arlington, Virginia, and is one of the world's leading power companies, generating and distributing electric power in 15 countries[2] and employing 10,500 people worldwide. AES Corporation is a global Fortune 500 power company.[3] AES Ranks in the Top Ten of Fast Company's 2022 Best Workplaces for Innovators.[4]"
    },
    {
        "ticker": "AFL",
        "name": "Aflac",
        "url": "https://en.wikipedia.org/wiki/Aflac",
        "desc": "Aflac Inc. /ˈæflæk/ (American Family Life Assurance Company) is an American insurance company and is the largest provider of supplemental insurance in the United States.[3] The company was founded in 1955 and is based in Columbus, Georgia. In the U.S., Aflac underwrites a wide range of insurance policies, but is perhaps more known for its payroll deduction insurance coverage, which pays cash benefits when a policyholder has a covered accident or illness. The company states it \"provides financial protection to more than 50 million people worldwide\".[4]"
    },
    {
        "ticker": "A",
        "name": "Agilent Technologies",
        "url": "https://en.wikipedia.org/wiki/Agilent_Technologies",
        "desc": "Agilent Technologies, Inc. is a global company headquartered in Santa Clara, California, that provides instruments, software, services, and consumables for laboratories. Agilent was established in 1999 as a spin-off from Hewlett-Packard. The resulting IPO of Agilent stock was the largest in the history of Silicon Valley at the time.[2][3] From 1999 to 2014, the company produced optics (LED, laser), semiconductors, EDA software and test and measurement equipment for electronics; that division was spun off to form Keysight.[4] Since then, the company has continued to expand into pharmaceutical, diagnostics & clinical, and academia & government (research) markets.[5]"
    },
    {
        "ticker": "ABNB",
        "name": "Airbnb",
        "url": "https://en.wikipedia.org/wiki/Airbnb",
        "desc": "Airbnb, Inc. (/ˌɛərˌbiːɛnˈbiː/ AIR-BEE-en-BEE) is an American San Francisco-based company operating an online marketplace for short- and long-term homestays and experiences. The company acts as a broker and charges a commission from each booking. The company was founded in 2008 by Brian Chesky, Nathan Blecharczyk, and Joe Gebbia. Airbnb is a shortened version of its original name, AirBedandBreakfast.com. Airbnb is the most well-known company for short-term housing rentals.[5][6]"
    },
    {
        "ticker": "APD",
        "name": "Air Products and Chemicals",
        "url": "https://en.wikipedia.org/wiki/Air_Products_and_Chemicals",
        "desc": "Air Products and Chemicals, Inc. is an American international corporation whose principal business is selling gases and chemicals for industrial uses. Air Products' headquarters is in Allentown, Pennsylvania, in the Lehigh Valley region of Pennsylvania."
    },
    {
        "ticker": "AKAM",
        "name": "Akamai",
        "url": "https://en.wikipedia.org/wiki/Akamai",
        "desc": "Akamai Technologies, Inc. is an American content delivery network[3] (CDN), cybersecurity, and cloud service company, providing web and Internet security services.[4][5] The company operates a network of servers worldwide and rents the capacity of the servers to customers wanting to increase the efficiency of their websites by using Akamai owned servers located near the user. When a user navigates to the URL of an Akamai customer, their browser is directed by Akamai's domain name system[6] to a proximal edge server that can serve the requested content. Akamai's mapping system[7] assigns each user to a proximal edge server using sophisticated algorithms[8] such as stable matching and consistent hashing, enabling more reliable and faster web downloads. Further, Akamai implements DDoS mitigation and other security services[9] in its edge server platform."
    },
    {
        "ticker": "ALK",
        "name": "Alaska Air Group",
        "url": "https://en.wikipedia.org/wiki/Alaska_Air_Group",
        "desc": "Alaska Air Group is an American airline holding company based in SeaTac, Washington, United States."
    },
    {
        "ticker": "ALB",
        "name": "Albemarle Corporation",
        "url": "https://en.wikipedia.org/wiki/Albemarle_Corporation",
        "desc": "Albemarle Corporation is an American specialty chemicals manufacturing company based in Charlotte, North Carolina. It operates 3 divisions: lithium (68.4% of 2022 revenues), bromine specialties (19.3% of 2022 revenues) and catalysts (12.3% of 2022 revenues).[1]"
    },
    {
        "ticker": "ARE",
        "name": "Alexandria Real Estate Equities",
        "url": "https://en.wikipedia.org/wiki/Alexandria_Real_Estate_Equities",
        "desc": "Alexandria Real Estate Equities, Inc. is a real estate investment trust based in Pasadena, California that invests in office buildings and laboratories leased to tenants in the life science and technology industries.[1]"
    },
    {
        "ticker": "ALGN",
        "name": "Align Technology",
        "url": "https://en.wikipedia.org/wiki/Align_Technology",
        "desc": "Align Technology is an American manufacturer of 3D digital scanners and Invisalign clear aligners used in orthodontics. It was founded in 1997 and is headquartered in Tempe, Arizona. The company manufactures the aligners in Juarez, Mexico and its scanners in Israel and China. The company is best known for its Invisalign system, which is a clear aligner treatment used to straighten teeth."
    },
    {
        "ticker": "ALLE",
        "name": "Allegion",
        "url": "https://en.wikipedia.org/wiki/Allegion",
        "desc": "Allegion plc is an American Irish-domiciled provider of security products for homes and businesses."
    },
    {
        "ticker": "LNT",
        "name": "Alliant Energy",
        "url": "https://en.wikipedia.org/wiki/Alliant_Energy",
        "desc": "Alliant Energy is a public utility holding company headquartered in Madison, Wisconsin, providing power in Iowa and Wisconsin."
    },
    {
        "ticker": "ALL",
        "name": "Allstate",
        "url": "https://en.wikipedia.org/wiki/Allstate",
        "desc": "The Allstate Corporation is an American insurance company, headquartered in Glenview, Illinois (with a Northbrook, Illinois address) since 2022.[4] Founded in 1931 as part of Sears, Roebuck and Co., it was spun off in 1993, but was still partially owned by Sears until it became an independent company completely in June 1995.[3] The company also has personal lines insurance operations in Canada."
    },
    {
        "ticker": "GOOGL",
        "name": "Alphabet Inc.",
        "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
        "desc": "Alphabet Inc. is an American multinational technology conglomerate holding company headquartered in Mountain View, California. It was created through a restructuring of Google on October 2, 2015,[2] and became the parent company of Google and several former Google subsidiaries.[3][4][5] Alphabet is the world's third-largest technology company by revenue and one of the world's most valuable companies.[6][7] It is considered one of the Big Five American information technology companies, alongside Amazon, Apple, Meta, and Microsoft."
    },
    {
        "ticker": "GOOG",
        "name": "Alphabet Inc.",
        "url": "https://en.wikipedia.org/wiki/Alphabet_Inc.",
        "desc": "Alphabet Inc. is an American multinational technology conglomerate holding company headquartered in Mountain View, California. It was created through a restructuring of Google on October 2, 2015,[2] and became the parent company of Google and several former Google subsidiaries.[3][4][5] Alphabet is the world's third-largest technology company by revenue and one of the world's most valuable companies.[6][7] It is considered one of the Big Five American information technology companies, alongside Amazon, Apple, Meta, and Microsoft."
    },
    {
        "ticker": "MO",
        "name": "Altria",
        "url": "https://en.wikipedia.org/wiki/Altria",
        "desc": "Altria Group, Inc. (previously known as Philip Morris Companies, Inc.) is an American corporation and one of the world's largest producers and marketers of tobacco, cigarettes, and related products. It operates worldwide and is headquartered in Henrico County, Virginia, just outside the city of Richmond."
    },
    {
        "ticker": "AMZN",
        "name": "Amazon",
        "url": "https://en.wikipedia.org/wiki/Amazon_(company)",
        "desc": "Amazon.com, Inc.[1] (/ˈæməzɒn/ AM-ə-zon, UK also /ˈæməzən/ AM-ə-zən) is an American multinational technology company focusing on e-commerce, cloud computing, online advertising, digital streaming, and artificial intelligence. It has been often referred to as \"one of the most influential economic and cultural forces in the world\",[5] and is often regarded as one of the world's most valuable brands.[6] It is considered to be one of the Big Five American technology companies, alongside Alphabet (parent company of Google), Apple, Meta and Microsoft."
    },
    {
        "ticker": "AMCR",
        "name": "Amcor",
        "url": "https://en.wikipedia.org/wiki/Amcor",
        "desc": "And"
    },
    {
        "ticker": "AMD",
        "name": "AMD",
        "url": "https://en.wikipedia.org/wiki/AMD",
        "desc": "Advanced Micro Devices, Inc., commonly abbreviated as AMD, is an American multinational semiconductor company based in Santa Clara, California, that develops computer processors and related technologies for business and consumer markets."
    },
    {
        "ticker": "AEE",
        "name": "Ameren",
        "url": "https://en.wikipedia.org/wiki/Ameren",
        "desc": "Martin J. Lyons, Jr. (Ameren Services Chairman & President)"
    },
    {
        "ticker": "AAL",
        "name": "American Airlines Group",
        "url": "https://en.wikipedia.org/wiki/American_Airlines_Group",
        "desc": "American Airlines Group Inc. is an American publicly traded airline holding company headquartered in Fort Worth, Texas. It was formed on December 9, 2013, by the merger of AMR Corporation, the parent company of American Airlines and Air Choice One, and US Airways Group, the parent company of US Airways.[6] Integration was completed when the Federal Aviation Administration granted a single operating certificate for both carriers on April 8, 2015,[7] and all flights now operate under the American Airlines brand."
    },
    {
        "ticker": "AEP",
        "name": "American Electric Power",
        "url": "https://en.wikipedia.org/wiki/American_Electric_Power",
        "desc": "American Electric Power Company, Inc. (AEP), (railcar reporting mark: AEPX) is a major investor-owned electric utility in the United States, delivering electricity to more than five million customers in 11 states.[2]"
    },
    {
        "ticker": "AXP",
        "name": "American Express",
        "url": "https://en.wikipedia.org/wiki/American_Express",
        "desc": "American Express Company (Amex) is an American multinational financial services corporation that specializes in payment cards. Headquartered in New York City, it is one of the most valuable companies in the world and one of the 30 components of the Dow Jones Industrial Average.[5][6] The company's logo, adopted in 1958, is a gladiator or centurion, whose image appears on the company's well-known traveler's cheques, charge cards, and credit cards.[7] It is based in the American Express Tower, located in the Battery Park City neighborhood of Lower Manhattan, where it maintains its corporate offices. The company is the largest provider of traveler's cheques worldwide.[8]"
    },
    {
        "ticker": "AIG",
        "name": "American International Group",
        "url": "https://en.wikipedia.org/wiki/American_International_Group",
        "desc": "American International Group, Inc. (AIG) is an American multinational finance and insurance corporation with operations in more than 80 countries and jurisdictions.[7] As of January 1, 2019, AIG companies employed 49,600 people.[8] The company operates through three core businesses: general insurance, life & retirement, and a standalone technology-enabled subsidiary.[9][10][11] General Insurance includes Commercial, Personal Insurance, U.S. and International field operations. Life & Retirement includes Group Retirement, Individual Retirement, Life, and Institutional Markets.[9][10][11] AIG is the title sponsor of the AIG Women's Open golf tournament. In 2023, for the sixth consecutive year, DiversityInc named AIG among the Top 50 Companies for Diversity list.[12]"
    },
    {
        "ticker": "AMT",
        "name": "American Tower",
        "url": "https://en.wikipedia.org/wiki/American_Tower",
        "desc": "American Tower Corporation (also referred to as American Tower or ATC) is an American real estate investment trust which owns and operates of wireless and broadcast communications infrastructure in several countries worldwide and is headquartered in Boston, Massachusetts."
    },
    {
        "ticker": "AWK",
        "name": "American Water Works",
        "url": "https://en.wikipedia.org/wiki/American_Water_Works",
        "desc": "American Water is an American public utility company that, through its subsidiaries, provides water and wastewater services in the United States. It offers water and wastewater services to approximately 1,700 communities in 14 states serving a population of approximately 14 million through 3.4 million customer connections. The company's customers include residential, commercial, fire service and private fire, industrial, government facilities, and other water and wastewater utilities."
    },
    {
        "ticker": "AMP",
        "name": "Ameriprise Financial",
        "url": "https://en.wikipedia.org/wiki/Ameriprise_Financial",
        "desc": "Ameriprise Financial, Inc. is a diversified financial services company and bank holding company incorporated in Delaware and headquartered in Minneapolis, Minnesota.[1] It provides financial planning products and services, including wealth management, asset management, insurance, annuities, and estate planning.[1]"
    },
    {
        "ticker": "AME",
        "name": "Ametek",
        "url": "https://en.wikipedia.org/wiki/Ametek",
        "desc": "AMETEK, Inc. is an American multinational conglomerate and global designer and manufacturer of electronic instruments and electromechanical devices with headquarters in the United States and over 220 sites worldwide.[3]"
    },
    {
        "ticker": "AMGN",
        "name": "Amgen",
        "url": "https://en.wikipedia.org/wiki/Amgen",
        "desc": "Amgen Inc. (formerly Applied Molecular Genetics Inc.) is an American multinational biopharmaceutical company headquartered in Thousand Oaks, California.[3][4] One of the world's largest independent biotechnology companies, Amgen's Thousand Oaks staff in 2022 numbered approximately 5,000[5] (8.5% of total city employment)[6] and included hundreds of scientists, making Amgen the largest employer in Ventura County.[7][8] As of 2022, Amgen has approximately 24,000 staff in total.[9]"
    },
    {
        "ticker": "APH",
        "name": "Amphenol",
        "url": "https://en.wikipedia.org/wiki/Amphenol",
        "desc": "Amphenol Corporation is a major producer of electronic and fiber optic connectors, cable and interconnect systems such as coaxial cables.[4] Amphenol is a portmanteau from the corporation's original name, American Phenolic Corp.[5]"
    },
    {
        "ticker": "ADI",
        "name": "Analog Devices",
        "url": "https://en.wikipedia.org/wiki/Analog_Devices",
        "desc": "Analog Devices, Inc. (ADI), also known simply as Analog, is an American multinational semiconductor company specializing in data conversion, signal processing, and power management technology, headquartered in Wilmington, Massachusetts.[2][3]"
    },
    {
        "ticker": "ANSS",
        "name": "Ansys",
        "url": "https://en.wikipedia.org/wiki/Ansys",
        "desc": "Ansys, Inc. is an American multinational company with its headquarters based in Canonsburg, Pennsylvania. It develops and markets CAE/multiphysics engineering simulation software for product design, testing and operation and offers its products and services to customers worldwide."
    },
    {
        "ticker": "AON",
        "name": "Aon",
        "url": "https://en.wikipedia.org/wiki/Aon_(company)",
        "desc": "Aon PLC (English: /ˈeɪɒn/) is a British-American[3] professional services and management consulting firm that offers a range of risk-mitigation products, including commercial risk, investment, wealth, health, human capital, and reinsurance solutions.[4] The firm also provides data and analytics services, strategy consulting through Aon Inpoint and investment banking advisory through Aon Securities. Aon has approximately 50,000 employees across 120 countries.[5]"
    },
    {
        "ticker": "APA",
        "name": "APA Corporation",
        "url": "https://en.wikipedia.org/wiki/APA_Corporation",
        "desc": "APA Corporation is the holding company for Apache Corporation, an American company engaged in hydrocarbon exploration.[2] It is organized in Delaware and headquartered in Houston. The company is ranked 431st on the Fortune 500.[3]"
    },
    {
        "ticker": "AAPL",
        "name": "Apple Inc.",
        "url": "https://en.wikipedia.org/wiki/Apple_Inc.",
        "desc": "Apple Inc. is an American multinational technology company headquartered in Cupertino, California. Apple is the world's largest technology company by revenue, with US$394.3 billion in 2022 revenue.[6] As of March 2023, Apple is the world's biggest company by market capitalization.[7] As of June 2022, Apple is the fourth-largest personal computer vendor by unit sales; the largest manufacturing company by revenue; and the second-largest mobile phone manufacturer in the world. It is considered one of the Big Five American information technology companies, alongside Alphabet (parent company of Google), Amazon, Meta Platforms, and Microsoft."
    },
    {
        "ticker": "AMAT",
        "name": "Applied Materials",
        "url": "https://en.wikipedia.org/wiki/Applied_Materials",
        "desc": "Applied Materials, Inc. is an American corporation that supplies equipment, services and software for the manufacture of semiconductor (integrated circuit) chips for electronics, flat panel displays for computers, smartphones, televisions, and solar products. Integral to the growth of Silicon Valley, the company also supplies equipment to produce coatings for flexible electronics, packaging and other applications. The company is headquartered in Santa Clara, California,[3] and the largest supplier of semiconductor equipment in the world based on revenue. [4]"
    },
    {
        "ticker": "APTV",
        "name": "Aptiv",
        "url": "https://en.wikipedia.org/wiki/Aptiv",
        "desc": "Aptiv PLC is an Irish-American[3][4] automotive technology supplier with headquarters in Dublin.[5] Aptiv grew out of the now-defunct American company, Delphi Automotive Systems, which itself was formerly a component of General Motors.[6]"
    },
    {
        "ticker": "ACGL",
        "name": "Arch Capital Group",
        "url": "https://en.wikipedia.org/wiki/Arch_Capital_Group",
        "desc": "Arch Capital Group Ltd. (Arch Capital or ACGL) is an American Bermuda-based public limited liability company which writes insurance, reinsurance and mortgage insurance on a worldwide basis, with a focus on specialty lines, the segment of the insurance industry where the more difficult and unusual risks are written. It has operations in Bermuda, the United States, Canada, Europe, Australia[3] and, in the case of mortgage insurance, Hong Kong.[4]"
    },
    {
        "ticker": "ANET",
        "name": "Arista Networks",
        "url": "https://en.wikipedia.org/wiki/Arista_Networks",
        "desc": "Arista Networks (formerly Arastra)[3] is an American computer networking company headquartered in Santa Clara, California. The company designs and sells multilayer network switches to deliver software-defined networking (SDN) for large datacenter, cloud computing, high-performance computing, and high-frequency trading environments. These products include 10/25/40/50/100 Gigabit Ethernet/200/400/800 low-latency cut-through switches, including the 7124SX,[4] which remained the fastest switch[5] using SFP+ optics through September 2012[6] with its sub-500 nanosecond (ns) latency, and the 7500 series, Arista's modular 10G/40G/100Gbit/s switch. Arista's Linux-based network operating system, Extensible Operating System (EOS), runs on all Arista products."
    },
    {
        "ticker": "AJG",
        "name": "Arthur J. Gallagher & Co.",
        "url": "https://en.wikipedia.org/wiki/Arthur_J._Gallagher_%26_Co.",
        "desc": "Arthur J. Gallagher & Co. (AJG) is an American global insurance brokerage and risk management services firm headquartered in Rolling Meadows, Illinois (a suburb of Chicago). The firm was established in 1927 and is one of the largest insurance brokers in the world."
    },
    {
        "ticker": "AIZ",
        "name": "Assurant",
        "url": "https://en.wikipedia.org/wiki/Assurant",
        "desc": "Assurant, Inc. is a global provider of risk management products and services[3] with headquarters in Atlanta.[2] Its businesses provide a diverse set of specialty, niche-market insurance products in the property, casualty, extended device protection, and preneed insurance sectors. The company’s main operating segments are Global Housing and Global Lifestyle.[2]"
    },
    {
        "ticker": "T",
        "name": "AT&T",
        "url": "https://en.wikipedia.org/wiki/AT%26T",
        "desc": "AT&T Inc. (with \"AT&T\" being an abbreviation for its former name, the American Telephone and Telegraph Company) is an American multinational telecommunications holding company headquartered at Whitacre Tower in Downtown Dallas, Texas.[5] It is the world's third-largest telecommunications company by revenue and the largest wireless carrier in the United States.[6] As of 2023, AT&T was ranked 13th on the Fortune 500 rankings of the largest United States corporations, with revenues of $120.7 billion.[7]"
    },
    {
        "ticker": "ATO",
        "name": "Atmos Energy",
        "url": "https://en.wikipedia.org/wiki/Atmos_Energy",
        "desc": "Atmos Energy Corporation, headquartered in Dallas, Texas, is one of the United States' largest natural-gas-only distributors,[4] serving about three million natural gas distribution customers in over 1,400 communities in nine states[5] from the Blue Ridge Mountains in the East to the Rocky Mountains in the West.[citation needed]"
    },
    {
        "ticker": "ADSK",
        "name": "Autodesk",
        "url": "https://en.wikipedia.org/wiki/Autodesk",
        "desc": "Autodesk, Inc. is an American multinational software corporation that makes software products and services for the architecture, engineering, construction, manufacturing, media, education, and entertainment industries. Autodesk is headquartered in San Francisco, California,[2] and has offices worldwide. Its U.S. offices are located in the states of California, Oregon, Colorado, Texas, Michigan, New Hampshire and Massachusetts. Its Canada offices are located in the provinces of Ontario, Quebec, and Alberta."
    },
    {
        "ticker": "AZO",
        "name": "AutoZone",
        "url": "https://en.wikipedia.org/wiki/AutoZone",
        "desc": "AutoZone, Inc. is an American retailer of aftermarket automotive parts and accessories, the largest in the United States.[3] Founded in 1979, AutoZone has 7,014 stores across the United States, Mexico, Puerto Rico, Brazil and the US Virgin Islands. The company is based in Memphis, Tennessee.[3][4]"
    },
    {
        "ticker": "AVB",
        "name": "AvalonBay Communities",
        "url": "https://en.wikipedia.org/wiki/AvalonBay_Communities",
        "desc": "AvalonBay Communities, Inc. is a publicly traded real estate investment trust that invests in apartments."
    },
    {
        "ticker": "AVY",
        "name": "Avery Dennison",
        "url": "https://en.wikipedia.org/wiki/Avery_Dennison",
        "desc": "Avery Dennison Corporation is a multinational manufacturer and distributor of pressure-sensitive adhesive materials (such as self-adhesive labels), apparel branding labels and tags, RFID inlays, and specialty medical products. The company is a member of the Fortune 500 and is headquartered in Mentor, Ohio.[1][3]"
    },
    {
        "ticker": "AXON",
        "name": "Axon Enterprise",
        "url": "https://en.wikipedia.org/wiki/Axon_Enterprise",
        "desc": "Axon Enterprise, Inc. is an American company based in Scottsdale, Arizona that develops technology and weapons products for military, law enforcement, and civilians.[2]"
    },
    {
        "ticker": "BKR",
        "name": "Baker Hughes",
        "url": "https://en.wikipedia.org/wiki/Baker_Hughes",
        "desc": "Baker Hughes Company, incorporated under Delaware General Corporation Law and headquartered in Houston, is one of the world's largest oil field services companies. The company provides products and services for oil well drilling, formation evaluation, completion, production, and reservoir consulting. It operates in over 120 countries, with research and manufacturing facilities in Australia, Singapore, Malaysia, India, Dubai, Saudi Arabia, Italy, Germany, Norway, Oklahoma, Louisiana and Missouri. From 2017 to 2020, the company was majority owned by General Electric (GE); however, GE no longer owns an economic stake in the company.[2]"
    },
    {
        "ticker": "BALL",
        "name": "Ball Corporation",
        "url": "https://en.wikipedia.org/wiki/Ball_Corporation",
        "desc": "Ball Corporation is an American company headquartered in Westminster, Colorado. It is best known for its early production of glass jars, lids, and related products used for home canning. Since its founding in Buffalo, New York, in 1880,[2] when it was known as the Wooden Jacket Can Company, the Ball company has expanded and diversified into other business ventures, including aerospace technology. It eventually became the world's largest manufacturer of recyclable metal beverage and food containers."
    },
    {
        "ticker": "BAC",
        "name": "Bank of America",
        "url": "https://en.wikipedia.org/wiki/Bank_of_America",
        "desc": "The Bank of America Corporation (often abbreviated BofA or BoA) is an American multinational investment bank and financial services holding company headquartered at the Bank of America Corporate Center in Charlotte, North Carolina, with investment banking and auxiliary headquarters in Manhattan. The bank was founded in San Francisco, California. It is the second-largest banking institution in the United States, after JPMorgan Chase, and the second-largest bank in the world by market capitalization. Bank of America is one of the Big Four banking institutions of the United States.[5] It serves approximately 10.73% of all American bank deposits, in direct competition with JPMorgan Chase, Citigroup, and Wells Fargo. Its primary financial services revolve around commercial banking, wealth management, and investment banking."
    },
    {
        "ticker": "BBWI",
        "name": "Bath & Body Works, Inc.",
        "url": "https://en.wikipedia.org/wiki/Bath_%26_Body_Works,_Inc.",
        "desc": "Bath & Body Works, Inc. (formerly known as L Brands, Inc., Limited Brands, Inc. and The Limited, Inc.) is an American specialty retail company based in Columbus, Ohio. It owns Bath & Body Works, posted $11.9 billion in revenue in 2021, and was listed as 248 on the 2020 Fortune 500 list of largest United States companies by revenue.[1]"
    },
    {
        "ticker": "BAX",
        "name": "Baxter International",
        "url": "https://en.wikipedia.org/wiki/Baxter_International",
        "desc": "[1]"
    },
    {
        "ticker": "BDX",
        "name": "Becton Dickinson",
        "url": "https://en.wikipedia.org/wiki/BD_(company)",
        "desc": "Becton, Dickinson and Company, also known as BD, is an American multinational medical technology company that manufactures and sells medical devices, instrument systems, and reagents. BD also provides consulting and analytics services in certain geographies.[citation needed]"
    },
    {
        "ticker": "WRB",
        "name": "Berkley",
        "url": "https://en.wikipedia.org/wiki/W._R._Berkley_Corporation",
        "desc": "W. R. Berkley Corporation is a commercial lines property & casualty insurance holding company organized in Delaware and based in Greenwich, Connecticut.[2]"
    },
    {
        "ticker": "BRK.B",
        "name": "Berkshire Hathaway",
        "url": "https://en.wikipedia.org/wiki/Berkshire_Hathaway",
        "desc": "Berkshire Hathaway Inc. (/ˈbɜːrkʃər/) is an American multinational conglomerate holding company headquartered in Omaha, Nebraska, United States. Its main business and source of capital is insurance, from which it invests the float (the retained premiums) in a broad portfolio of subsidiaries, equity positions and other securities. The company has been overseen since 1965 by its chairman and CEO Warren Buffett and (since 1978) vice chairman Charlie Munger, who are known for their advocacy of value investing principles. Under their direction, the company's book value has grown at an average rate of 20%, compared to about 10% from the S&P 500 index with dividends included over the same period, while employing large amounts of capital and minimal debt.[4]"
    },
    {
        "ticker": "BBY",
        "name": "Best Buy",
        "url": "https://en.wikipedia.org/wiki/Best_Buy",
        "desc": "Best Buy Co. Inc. is an American multinational consumer electronics retailer headquartered in Richfield, Minnesota. Originally founded by Richard M. Schulze and James Wheeler in 1966 as an audio specialty store called Sound of Music, it was rebranded under its current name with an emphasis on consumer electronics in 1983."
    },
    {
        "ticker": "BIO",
        "name": "Bio-Rad",
        "url": "https://en.wikipedia.org/wiki/Bio-Rad",
        "desc": "Bio-Rad Laboratories, Inc. is an American developer and manufacturer of specialized technological products for the life science research and clinical diagnostics markets. The company was founded in 1952 in Berkeley, California, by husband and wife team David and Alice Schwartz, both graduates of the University of California, Berkeley. Bio-Rad is based in Hercules, California, and has operations worldwide."
    },
    {
        "ticker": "TECH",
        "name": "Bio-Techne",
        "url": "https://en.wikipedia.org/wiki/Bio-Techne",
        "desc": "Bio-Techne Corporation develops, manufactures and sells life science reagents, instruments and services for the research, diagnostic, and bioprocessing markets. The company's brands include R&D Systems, ProteinSimple, and Novus Biologicals.[1]"
    },
    {
        "ticker": "BIIB",
        "name": "Biogen",
        "url": "https://en.wikipedia.org/wiki/Biogen",
        "desc": "Biogen Inc. is an American multinational biotechnology company based in Cambridge, Massachusetts, specializing in the discovery, development, and delivery of therapies for the treatment of neurological diseases to patients worldwide.[2]"
    },
    {
        "ticker": "BLK",
        "name": "BlackRock",
        "url": "https://en.wikipedia.org/wiki/BlackRock",
        "desc": "BlackRock, Inc. is an American multinational investment company based in New York City. Founded in 1988, initially as an enterprise risk management and fixed income institutional asset manager, BlackRock is the world's largest asset manager, with US$9.42 trillion in assets under management as of June 30, 2023.[2] BlackRock operates globally with 70 offices in 30 countries, and clients in 100 countries.[1] BlackRock is the manager of the iShares group of exchange-traded funds, and along with The Vanguard Group and State Street, it is considered to be one of the Big Three index fund managers.[3][4] Its Aladdin software keeps track of investment portfolios for many major financial institutions and its BlackRock Solutions division provides financial risk management services.[5] BlackRock is ranked 184th on the Fortune 500 list of the largest United States corporations by revenue.[6]"
    },
    {
        "ticker": "BX",
        "name": "Blackstone",
        "url": "https://en.wikipedia.org/wiki/Blackstone_Inc.",
        "desc": "Blackstone Inc. is an American alternative investment management company based in New York City. Blackstone's private equity business has been one of the largest investors in leveraged buyouts in the last three decades, while its real estate business has actively acquired commercial real estate. Blackstone is also active in credit, infrastructure, hedge funds, insurance, secondaries, and growth equity. As of June 2023, the company's total assets under management were approximately US$1 trillion, making it the largest alternative investment firm globally.[2]"
    },
    {
        "ticker": "BK",
        "name": "BNY Mellon",
        "url": "https://en.wikipedia.org/wiki/BNY_Mellon",
        "desc": "The Bank of New York Mellon Corporation, commonly known as BNY Mellon, is an American investment banking services holding company headquartered in New York City. BNY Mellon was formed from the merger of The Bank of New York and the Mellon Financial Corporation in 2007. It is the world's largest custodian bank and securities services company,[2][3][4] with $1.8 trillion in assets under management and $44.3 trillion in assets under custody at the end of 2022 fiscal.[5][1] It is considered a systemically important bank by the Financial Stability Board. BNY Mellon is incorporated in Delaware.[6]"
    },
    {
        "ticker": "BA",
        "name": "Boeing",
        "url": "https://en.wikipedia.org/wiki/Boeing",
        "desc": "The Boeing Company (/ˈboʊɪŋ/) is an American multinational corporation that designs, manufactures, and sells airplanes, rotorcraft, rockets, satellites, telecommunications equipment, and missiles worldwide.[5] The company also provides leasing and product support services. Boeing is among the largest global aerospace manufacturers; it is the third-largest defense contractor in the world based on 2020 revenue,[6] and is the largest exporter in the United States by dollar value.[7] Boeing's stock is a component of the Dow Jones Industrial Average."
    },
    {
        "ticker": "BKNG",
        "name": "Booking Holdings",
        "url": "https://en.wikipedia.org/wiki/Booking_Holdings",
        "desc": "Booking Holdings Inc. is an American travel technology company incorporated under Delaware General Corporation Law and based in Norwalk, Connecticut, that owns and operates several travel fare aggregators and travel fare metasearch engines including namesake and flagship Booking.com, Priceline.com, Agoda.com, Kayak.com, Cheapflights, Rentalcars.com, Momondo, and OpenTable. It operates websites in about 40 languages and 200 countries."
    },
    {
        "ticker": "BWA",
        "name": "BorgWarner",
        "url": "https://en.wikipedia.org/wiki/BorgWarner",
        "desc": "BorgWarner Inc. is an American automotive and e-mobility supplier headquartered in Auburn Hills, Michigan. As of 2022, the company maintains production facilities and sites at 92 locations in 24 countries,[1] and generates revenues of US$15.8 billion, while employing around 52,000 people.[3] The company is one of the 25 largest automotive suppliers in the world.[4]"
    },
    {
        "ticker": "BXP",
        "name": "Boston Properties",
        "url": "https://en.wikipedia.org/wiki/Boston_Properties",
        "desc": "Boston Properties, Inc. is a publicly traded real estate investment trust that invests in premier workplaces in Boston, Los Angeles, New York City, San Francisco, Seattle, and Washington, D.C. As of June 30, 2022, the company owned or had interests in 193 commercial real estate properties, aggregating approximately 53.7 million square feet.[1]"
    },
    {
        "ticker": "BSX",
        "name": "Boston Scientific",
        "url": "https://en.wikipedia.org/wiki/Boston_Scientific",
        "desc": "Boston Scientific Corporation (\"BSC\"), incorporated in Delaware,[2] is a biomedical/biotechnology engineering firm and multinational manufacturer of medical devices used in interventional medical specialties, including interventional radiology, interventional cardiology, peripheral interventions, neuromodulation, neurovascular intervention, electrophysiology, cardiac surgery, vascular surgery, endoscopy, oncology, urology and gynecology. Boston Scientific is widely known for the development of the Taxus Stent, a drug-eluting stent which is used to open clogged arteries.[3] With the full acquisition of Cameron Health in June 2012, the company also became notable for offering a minimally invasive implantable cardioverter-defibrillator (ICD) which they call the EMBLEM subcutaneous implantable defibrillator (S-ICD).[4][5]"
    },
    {
        "ticker": "BMY",
        "name": "Bristol Myers Squibb",
        "url": "https://en.wikipedia.org/wiki/Bristol_Myers_Squibb",
        "desc": "The Bristol-Myers Squibb Company, doing business as Bristol Myers Squibb (BMS), is an American multinational pharmaceutical company. Headquartered in Princeton, New Jersey,[1] BMS is one of the world's largest pharmaceutical companies and consistently ranks on the Fortune 500 list of the largest U.S. corporations. For fiscal 2022, it had a total revenue of $46.2 billion.[2]"
    },
    {
        "ticker": "AVGO",
        "name": "Broadcom Inc.",
        "url": "https://en.wikipedia.org/wiki/Broadcom_Inc.",
        "desc": "Broadcom Inc. is an American multinational designer, developer, manufacturer, and global supplier of a wide range of semiconductor and infrastructure software products. Broadcom's product offerings serve the data center, networking, software, broadband, wireless, storage, and industrial markets. As of 2022, some 78 percent of Broadcom's revenue was coming from its semiconductor-based products and 22 percent from its infrastructure software products and services.[4]"
    },
    {
        "ticker": "BR",
        "name": "Broadridge Financial Solutions",
        "url": "https://en.wikipedia.org/wiki/Broadridge_Financial_Solutions",
        "desc": "Broadridge Financial Solutions, Inc. is a public corporate services and financial technology company founded in 2007 as a spin-off from management software company Automatic Data Processing. Broadridge supplies public companies with proxy statements, annual reports and other financial documents, and shareholder communications solutions, such as virtual annual meetings.[2][3]"
    },
    {
        "ticker": "BRO",
        "name": "Brown & Brown",
        "url": "https://en.wikipedia.org/wiki/Brown_%26_Brown",
        "desc": "Brown & Brown, Inc. (Brown & Brown Insurance) is an insurance brokerage firm, specialising in risk management. Headquartered in Daytona Beach, Florida, Brown & Brown has 450+ locations worldwide."
    },
    {
        "ticker": "BF.B",
        "name": "Brown–Forman",
        "url": "https://en.wikipedia.org/wiki/Brown%E2%80%93Forman",
        "desc": "The Brown–Forman Corporation is an American-based company, one of the largest in the spirits and wine business. Based in Louisville, Kentucky, it manufactures several very well known brands throughout the globe, including Jack Daniel's, Old Forester, Woodford Reserve, GlenDronach, BenRiach, Glenglassaugh, Finlandia, Herradura, Korbel, and Chambord. Brown–Forman formerly owned Southern Comfort and Tuaca before selling them off in 2016."
    },
    {
        "ticker": "BG",
        "name": "Bunge Limited",
        "url": "https://en.wikipedia.org/wiki/Bunge_Limited",
        "desc": "Bunge Limited (BUN-ghee)[1] is an American agribusiness and food company, incorporated in Bermuda,[2] and headquartered in St. Louis, Missouri, United States."
    },
    {
        "ticker": "CHRW",
        "name": "C.H. Robinson",
        "url": "https://en.wikipedia.org/wiki/C.H._Robinson",
        "desc": "C.H. Robinson is an American transportation company that includes third-party logistics (3PL). The company offers freight transportation, transportation management, brokerage and warehousing. It offers truckload, less than truckload, air freight, intermodal, and ocean transportation.[5]"
    },
    {
        "ticker": "CDNS",
        "name": "Cadence Design Systems",
        "url": "https://en.wikipedia.org/wiki/Cadence_Design_Systems",
        "desc": "Cadence Design Systems, Inc. (stylized as cādence), headquartered in San Jose, California,[2] is an American multinational computational software company, founded in 1988 by the merger of SDA Systems and ECAD, Inc. The company produces software, hardware, and silicon structures for designing integrated circuits, systems on chips (SoCs), and printed circuit boards.[3]"
    },
    {
        "ticker": "CZR",
        "name": "Caesars Entertainment",
        "url": "https://en.wikipedia.org/wiki/Caesars_Entertainment_(2020)",
        "desc": "Caesars Entertainment, Inc., formerly Eldorado Resorts, Inc., is an American hotel and casino entertainment company founded and based in Reno, Nevada that operates more than 50 properties.[4] Eldorado Resorts acquired Caesars Entertainment Corporation and changed its own name to Caesars Entertainment on July 20, 2020."
    },
    {
        "ticker": "CPT",
        "name": "Camden Property Trust",
        "url": "https://en.wikipedia.org/wiki/Camden_Property_Trust",
        "desc": "Camden Property Trust is a publicly-traded real estate investment trust that invests in apartments in the United States. As of November 30, 2021, the company owned interests in 171 apartment communities containing 58,588 apartment homes in the United States.[1]"
    },
    {
        "ticker": "CPB",
        "name": "Campbell Soup Company",
        "url": "https://en.wikipedia.org/wiki/Campbell_Soup_Company",
        "desc": "Campbell Soup Company, doing business as Campbell's, is an American company, most closely associated with its flagship canned soup products; however through mergers and acquisitions, it has grown to become one of the largest processed food companies in the United States with a wide variety of products under its flagship Campbell's brand as well as other brands including Pepperidge Farm, Snyder's of Hanover, V8, and Swanson. With its namesake brand Campbell's produces soups and other canned foods, baked goods, beverages, and snacks. It is headquartered in Camden, New Jersey.[4]"
    },
    {
        "ticker": "COF",
        "name": "Capital One",
        "url": "https://en.wikipedia.org/wiki/Capital_One",
        "desc": "Capital One Financial Corporation is an American bank holding company specializing in credit cards, auto loans, banking, and savings accounts, headquartered in McLean, Virginia with operations primarily in the United States.[2] It is on the list of largest banks in the United States, is the third largest issuer of Visa and Mastercard credit cards and is one of the largest car finance companies in the United States.[2]"
    },
    {
        "ticker": "CAH",
        "name": "Cardinal Health",
        "url": "https://en.wikipedia.org/wiki/Cardinal_Health",
        "desc": "Cardinal Health, Inc. is an American multinational health care services company, and the 14th highest revenue generating company in the United States. Headquartered in Dublin, Ohio, the company specializes in the distribution of pharmaceuticals and medical products, serving more than 100,000 locations.[4] The company also manufactures medical and surgical products, including gloves, surgical apparel, and fluid management products. In addition, it operates one of the largest networks of radiopharmacies in the U.S.[5] Cardinal Health provides medical products to over 75 percent of hospitals in the United States.[6]"
    },
    {
        "ticker": "KMX",
        "name": "CarMax",
        "url": "https://en.wikipedia.org/wiki/CarMax",
        "desc": "CarMax, Inc. is a used vehicle retailer based in the United States. It operates two business segments: CarMax Sales Operations and CarMax Auto Finance. The company began a side business of Circuit City, opening its first location in September 1993 in Richmond, Virginia. As of October 2022, CarMax operates 238 locations.[3]"
    },
    {
        "ticker": "CCL",
        "name": "Carnival",
        "url": "https://en.wikipedia.org/wiki/Carnival_Corporation_%26_plc",
        "desc": "Carnival Corporation & plc is a British-American cruise operator with a combined fleet of over ninety vessels across nine cruise line brands and one joint venture with China State Shipbuilding Corporation (CSSC).[4] A dual-listed company, Carnival is composed of two companies – Panama-incorporated, US-headquartered Carnival Corporation, and UK-based Carnival plc – which function as one entity. Carnival Corporation is listed on the New York Stock Exchange, whereas Carnival plc is listed on the London Stock Exchange with an ADR listing on the NYSE.[7] Carnival is listed in both the S&P 500 and FTSE 250 indices.[8]"
    },
    {
        "ticker": "CARR",
        "name": "Carrier Global",
        "url": "https://en.wikipedia.org/wiki/Carrier_Global",
        "desc": "Carrier Global Corporation is an American multinational heating, ventilation, and air conditioning (HVAC), refrigeration, and fire and security equipment corporation based in Palm Beach Gardens, Florida. Carrier was founded in 1915 as an independent company manufacturing and distributing HVAC systems, and has since expanded to include manufacturing commercial refrigeration and food service equipment, and fire and security technologies."
    },
    {
        "ticker": "CTLT",
        "name": "Catalent",
        "url": "https://en.wikipedia.org/wiki/Catalent",
        "desc": "Catalent, Inc. (Catalent Pharma Solutions) is a multinational corporation headquartered in Somerset, New Jersey. It is a global provider of delivery technologies, development, drug manufacturing, biologics, gene therapies and consumer health products. It employs more than 14,000 people,[3] including approximately 2,400 scientists and technicians. In fiscal year 2020, it generated over $3 billion in annual revenue.[1]"
    },
    {
        "ticker": "CAT",
        "name": "Caterpillar Inc.",
        "url": "https://en.wikipedia.org/wiki/Caterpillar_Inc.",
        "desc": "Caterpillar Inc. is an American construction, mining and other engineering equipment manufacturer.[6] The company is the world's largest manufacturer of construction equipment.[3][7][8] In 2018, Caterpillar was ranked number 73 on the Fortune 500 list[9] and number 265 on the Global Fortune 500 list.[10] Caterpillar stock is a component of the Dow Jones Industrial Average.[11]"
    },
    {
        "ticker": "CBOE",
        "name": "Cboe Global Markets",
        "url": "https://en.wikipedia.org/wiki/Cboe_Global_Markets",
        "desc": "Cboe Global Markets is an American company that owns the Chicago Board Options Exchange and the stock exchange operator BATS Global Markets."
    },
    {
        "ticker": "CBRE",
        "name": "CBRE Group",
        "url": "https://en.wikipedia.org/wiki/CBRE_Group",
        "desc": "CBRE Group, Inc. is an American commercial real estate services and investment firm. The abbreviation CBRE stands for Coldwell Banker Richard Ellis. It is the world's largest commercial real estate services and investment firm (based on 2021 revenue).[2][3][4]"
    },
    {
        "ticker": "CDW",
        "name": "CDW",
        "url": "https://en.wikipedia.org/wiki/CDW",
        "desc": "CDW Corporation, headquartered in Vernon Hills, Illinois, is a provider of technology products and services for business, government and education. The company has a secondary division known as CDW-G, devoted solely to United States governmental entities, such as K-12 schools, universities, non-profit healthcare organizations, State & Local and the Federal government."
    },
    {
        "ticker": "CE",
        "name": "Celanese",
        "url": "https://en.wikipedia.org/wiki/Celanese",
        "desc": "Celanese Corporation, formerly known as Hoechst Celanese, is an American technology and specialty materials company headquartered in Irving, Texas.[3] A Fortune 500 corporation, the company is the world’s leading producer of acetic acid, producing about 1.95 million tonnes per year, representing approximately 25% of global production.[4] Celanese is also the world's largest producer of vinyl acetate monomer (VAM).[5]"
    },
    {
        "ticker": "COR",
        "name": "Cencora",
        "url": "https://en.wikipedia.org/wiki/Cencora",
        "desc": "Cencora, Inc., formerly known as AmerisourceBergen, is an American drug wholesale company that was formed by the merger of Bergen Brunswig and AmeriSource in 2001.[2]"
    },
    {
        "ticker": "CNC",
        "name": "Centene Corporation",
        "url": "https://en.wikipedia.org/wiki/Centene_Corporation",
        "desc": "Centene Corporation is a publicly traded managed care company based in St. Louis, Missouri, which is an intermediary for government-sponsored and privately insured healthcare programs. Centene ranked No. 25 on the 2023 Fortune 500.[2]"
    },
    {
        "ticker": "CNP",
        "name": "CenterPoint Energy",
        "url": "https://en.wikipedia.org/wiki/CenterPoint_Energy",
        "desc": "CenterPoint Energy, Inc. is an American electric and natural gas utility serving several markets in the American states of Indiana, Ohio, Louisiana, Minnesota, Mississippi, and Texas. Part of the Fortune 500, the company was formerly known as Reliant Energy (from which it is now separated), NorAm Energy, Houston Industries, and HL&P. The company is headquartered in the CenterPoint Energy Tower at 1111 Louisiana Street in Downtown Houston.[3][4]"
    },
    {
        "ticker": "CDAY",
        "name": "Ceridian",
        "url": "https://en.wikipedia.org/wiki/Ceridian",
        "desc": "Ceridian HCM is an American provider of human resources software and services with employees in the USA, Canada, Europe, Australia and Mauritius. It is a publicly traded company on the New York Stock Exchange."
    },
    {
        "ticker": "CF",
        "name": "CF Industries",
        "url": "https://en.wikipedia.org/wiki/CF_Industries",
        "desc": "CF Industries Holdings, Inc. is an American manufacturer and distributor of agricultural fertilizers, including ammonia, urea, and ammonium nitrate products, based in Deerfield, Illinois, a suburb of Chicago.[3] It was founded in 1946 as the Central Farmers Fertilizer Company. For its first 56 years, it was a federation of regional agricultural supply cooperatives. CF then demutualized, and became a publicly traded company."
    },
    {
        "ticker": "CRL",
        "name": "Charles River Laboratories",
        "url": "https://en.wikipedia.org/wiki/Charles_River_Laboratories",
        "desc": "Charles River Laboratories International, Inc., is an American pharmaceutical company specializing in a variety of preclinical and clinical laboratory, gene therapy and cell therapy services for the Pharmaceutical, Medical device and Biotechnology industries.[2] It also supplies assorted biomedical products, outsourcing services, and animals for research and development in the pharmaceutical industry (for example, contract research organization services) and offers support in the fields of basic research, drug discovery, safety and efficacy, clinical support, and manufacturing."
    },
    {
        "ticker": "SCHW",
        "name": "Charles Schwab Corporation",
        "url": "https://en.wikipedia.org/wiki/Charles_Schwab_Corporation",
        "desc": "The Charles Schwab Corporation[2] is an American multinational financial services company. It offers banking, commercial banking, investing and related services including consulting, and wealth management advisory services to both retail and institutional clients. It has over 400 branches, primarily in financial centers in the United States and the United Kingdom. It ranks tenth on the list of largest banks in the United States by assets.[2] As of December 31, 2022, it had $7.05 trillion in client assets, 33.8 million active brokerage accounts, 2.4 million corporate retirement plan participants, and 1.7 million banking accounts.[2] It also offers a donor advised fund for clients seeking to donate securities.[5][6] It was founded in San Francisco, California, and is headquartered in Westlake, Texas."
    },
    {
        "ticker": "CHTR",
        "name": "Charter Communications",
        "url": "https://en.wikipedia.org/wiki/Charter_Communications",
        "desc": "Charter Communications, Inc., is an American telecommunications and mass media company with services branded as Spectrum. With over 32 million customers in 41 states,[5][1] it is the second-largest cable operator in the United States by subscribers, just behind Comcast, and the third-largest pay TV operator behind Comcast and AT&T.[6] Charter is the fifth-largest telephone provider based on number of residential lines."
    },
    {
        "ticker": "CVX",
        "name": "Chevron Corporation",
        "url": "https://en.wikipedia.org/wiki/Chevron_Corporation",
        "desc": "Chevron Corporation is an American multinational energy corporation predominantly specializing in oil and gas. The second-largest direct descendant of Standard Oil, and originally known as the Standard Oil Company of California (shortened to Socal or CalSo), it is headquartered in San Ramon, California, and active in more than 180 countries. Within oil and gas, Chevron is vertical integrated and is involved in hydrocarbon exploration, production, refining, marketing and transport, chemicals manufacturing and sales, and power generation."
    },
    {
        "ticker": "CMG",
        "name": "Chipotle Mexican Grill",
        "url": "https://en.wikipedia.org/wiki/Chipotle_Mexican_Grill",
        "desc": "Chipotle Mexican Grill, Inc. (/tʃɪˈpoʊtleɪ/, chih-POHT-lay),[3] often known simply as Chipotle, is an American chain of fast casual restaurants specializing in bowls, tacos and Mission burritos made to order in front of the customer.[4][5] Chipotle operates restaurants in the United States, United Kingdom,[6] Canada,[7][8] Germany,[9] and France.[10] Its name derives from chipotle, the Nahuatl name for a smoked and dried jalapeño chili pepper.[11][12]"
    },
    {
        "ticker": "CB",
        "name": "Chubb Limited",
        "url": "https://en.wikipedia.org/wiki/Chubb_Limited",
        "desc": "Chubb Limited is an American[2] company incorporated in Zürich, Switzerland. It is the parent company of Chubb, a global provider of insurance products covering property and casualty, accident and health, reinsurance, and life insurance and the largest publicly traded property and casualty company in the world.[3] Chubb operates in 55 countries and territories and in the Lloyd's insurance market in London. Clients of Chubb consist of multinational corporations and local businesses, individuals, and insurers seeking reinsurance coverage. Chubb provides commercial and personal property and casualty insurance, personal accident and supplemental health insurance, reinsurance and life insurance."
    },
    {
        "ticker": "CHD",
        "name": "Church & Dwight",
        "url": "https://en.wikipedia.org/wiki/Church_%26_Dwight",
        "desc": "Church & Dwight is an American consumer goods company focusing on personal care, household products, and specialty products. The company was founded in 1847 and is headquartered in Ewing, New Jersey. It is the parent company of well-known brands such as Arm & Hammer, Trojan, OxiClean, and First Response. In 2022, Church & Dwight reported annual revenue of $5.4 billion. The company's products and services include a wide range of consumer goods, including laundry detergent, air fresheners, baking soda, condoms, pregnancy tests, and oral hygiene products."
    },
    {
        "ticker": "CI",
        "name": "Cigna",
        "url": "https://en.wikipedia.org/wiki/Cigna",
        "desc": "The Cigna Group is a for-profit American multinational managed healthcare and insurance company based in Bloomfield, Connecticut.[3][4] Its insurance subsidiaries are major providers of medical, dental, disability, life and accident insurance and related products and services, the majority of which are offered through employers and other groups (e.g. governmental and non-governmental organizations, unions and associations). Cigna is incorporated in Delaware.[5]"
    },
    {
        "ticker": "CINF",
        "name": "Cincinnati Financial",
        "url": "https://en.wikipedia.org/wiki/Cincinnati_Financial",
        "desc": "Cincinnati Financial Corporation offers property and casualty insurance, its main business, through The Cincinnati Insurance Company, The Cincinnati Indemnity Company and The Cincinnati Casualty Company. The company has 1.01% of the domestic property and casualty insurance premiums, which ranks it as the 20th largest insurance company by market share in the U.S.[3]"
    },
    {
        "ticker": "CTAS",
        "name": "Cintas",
        "url": "https://en.wikipedia.org/wiki/Cintas",
        "desc": "Cintas Corporation (/ˈsɪntɑːz/) is an American corporation headquartered in Mason, Ohio which provides a range of products and services to businesses including uniforms, mats, mops, cleaning and restroom supplies, first aid and safety products, fire extinguishers and testing, and safety courses.[10] Cintas is a publicly held company traded on the Nasdaq Global Select Market under the symbol CTAS and is a component of the Standard & Poor's 500 Index."
    },
    {
        "ticker": "CSCO",
        "name": "Cisco",
        "url": "https://en.wikipedia.org/wiki/Cisco",
        "desc": "Cisco Systems, Inc., commonly known as Cisco, is an American-based multinational digital communications technology conglomerate corporation headquartered in San Jose, California. Cisco develops, manufactures, and sells networking hardware, software, telecommunications equipment and other high-technology services and products.[3] Cisco specializes in specific tech markets, such as the Internet of Things (IoT), domain security, videoconferencing, and energy management with leading products including Webex, OpenDNS, Jabber, Duo Security, and Jasper. Cisco is one of the largest technology companies in the world, ranking 82nd on the Fortune 100 with over $51 billion in revenue and nearly 83,300 employees.[4]"
    },
    {
        "ticker": "C",
        "name": "Citigroup",
        "url": "https://en.wikipedia.org/wiki/Citigroup",
        "desc": "Citigroup Inc. or Citi (stylized as citi) is an American multinational investment bank and financial services corporation headquartered in New York City. The company was formed by the merger of banking giant Citicorp and financial conglomerate Travelers Group in 1998; Travelers was subsequently spun off from the company in 2002.[23][24] Citigroup owns Citicorp, the holding company for Citibank, as well as several international subsidiaries. Citigroup is incorporated in Delaware."
    },
    {
        "ticker": "CFG",
        "name": "Citizens Financial Group",
        "url": "https://en.wikipedia.org/wiki/Citizens_Financial_Group",
        "desc": "Citizens Financial Group, Inc. is an American bank headquartered in Providence, Rhode Island, which operates in the states of Connecticut, Delaware, Florida, Maryland, Massachusetts, Michigan, New Hampshire, New Jersey, New York, Ohio, Pennsylvania, Rhode Island, Vermont, and Virginia, as well as Washington, DC.[2]"
    },
    {
        "ticker": "CLX",
        "name": "Clorox",
        "url": "https://en.wikipedia.org/wiki/Clorox",
        "desc": "The Clorox Company (formerly Clorox Chemical Company) is an American global manufacturer and marketer of consumer and professional products.[12] As of 2020 the Oakland, California-based company had approximately 8,800 employees worldwide. Net sales for the 2020 fiscal year were US$6.7 billion. Ranked annually since 2000, Clorox was named number 474 on Fortune magazine's 2020 Fortune 500 list."
    },
    {
        "ticker": "CME",
        "name": "CME Group",
        "url": "https://en.wikipedia.org/wiki/CME_Group",
        "desc": "CME Group Inc., headquartered in Chicago, operates financial derivatives exchanges including the Chicago Mercantile Exchange, Chicago Board of Trade, New York Mercantile Exchange, and The Commodity Exchange. The company also owns 27% of S&P Dow Jones Indices.[2][3][4][5] It is the world's largest operator of financial derivatives exchanges. Its exchanges are platforms for trading in agricultural products, currencies, energy, interest rates, metals, futures contracts, options, stock indexes, and cryptocurrencies futures."
    },
    {
        "ticker": "CMS",
        "name": "CMS Energy",
        "url": "https://en.wikipedia.org/wiki/CMS_Energy",
        "desc": "CMS Energy, based in Jackson, Michigan, is an energy company that is focused principally on utility operations in Michigan.[4] Its principal business is Consumers Energy, a public utility that provides electricity and natural gas to more than 6 million of Michigan's 10 million residents.[5][6] Its non-utility businesses are focused primarily on domestic independent power production. Consumers Energy has operated since 1886.[7]"
    },
    {
        "ticker": "KO",
        "name": "Coca-Cola Company (The)",
        "url": "https://en.wikipedia.org/wiki/The_Coca-Cola_Company",
        "desc": "The Coca-Cola Company is an American multinational corporation founded in 1892, best known as the producer of Coca-Cola. The drink industry company also manufactures, sells, and markets other non-alcoholic beverage concentrates and syrups, and alcoholic beverages. The company's stock is listed on the NYSE and is part of the DJIA and the S&P 500 and S&P 100 indexes."
    },
    {
        "ticker": "CTSH",
        "name": "Cognizant",
        "url": "https://en.wikipedia.org/wiki/Cognizant",
        "desc": "Cognizant is an American multinational information technology services and consulting company. It is headquartered in Teaneck, New Jersey, U.S. Cognizant is part of the NASDAQ-100 and trades under CTSH. It was founded as an in-house technology unit of Dun & Bradstreet in 1994,[6] and started serving external clients in 1996.[6]"
    },
    {
        "ticker": "CL",
        "name": "Colgate-Palmolive",
        "url": "https://en.wikipedia.org/wiki/Colgate-Palmolive",
        "desc": "Colgate-Palmolive Company is an American multinational consumer products company headquartered on Park Avenue in Midtown Manhattan, New York City. The company specializes in the production, distribution, and provision of household, health care, personal care, and veterinary products.[2]"
    },
    {
        "ticker": "CMCSA",
        "name": "Comcast",
        "url": "https://en.wikipedia.org/wiki/Comcast",
        "desc": "Comcast Corporation (formerly known as American Cable Systems and Comcast Holdings, stylized in all caps),[note 1] incorporated and headquartered in Philadelphia, is the largest American multinational telecommunications and media conglomerate.[8] The corporation is the second-largest broadcasting and cable television company in the world by revenue (behind AT&T), and is also the largest pay-TV company, the largest cable TV company, and largest home Internet service provider in the United States. Comcast is additionally the nation's third-largest home telephone service provider. It provides services to U.S. residential and commercial customers in 40 states and the District of Columbia.[9] As the owner of the international media company NBCUniversal since 2011, Comcast is also a high-volume producer of feature films for theatrical exhibition, over-the-air and cable television programming, and theme park operator."
    },
    {
        "ticker": "CMA",
        "name": "Comerica",
        "url": "https://en.wikipedia.org/wiki/Comerica",
        "desc": "Comerica Bank is a subsidiary of Comerica Incorporated (NYSE: CMA), a financial services company headquartered in Dallas, Texas, and strategically aligned by three business segments: The Commercial Bank, The Retail Bank and Wealth Management. Under the leadership of chairman, President and chief executive officer Curt Farmer, Comerica focuses on relationships, and helping people and businesses be successful."
    },
    {
        "ticker": "CAG",
        "name": "Conagra Brands",
        "url": "https://en.wikipedia.org/wiki/Conagra_Brands",
        "desc": "Conagra Brands, Inc. (formerly ConAgra Foods) is an American consumer packaged goods holding company headquartered in Chicago, Illinois. Conagra makes and sells products under various brand names that are available in supermarkets, restaurants, and food service establishments. Based on its 2021 revenue, the company ranked 331st on the 2022 Fortune 500.[3]"
    },
    {
        "ticker": "COP",
        "name": "ConocoPhillips",
        "url": "https://en.wikipedia.org/wiki/ConocoPhillips",
        "desc": "ConocoPhillips Company is an American multinational corporation engaged in hydrocarbon exploration and production. It is based in the Energy Corridor district of Houston, Texas."
    },
    {
        "ticker": "ED",
        "name": "Consolidated Edison",
        "url": "https://en.wikipedia.org/wiki/Consolidated_Edison",
        "desc": "Consolidated Edison, Inc., commonly known as Con Edison (stylized as conEdison) or ConEd, is one of the largest investor-owned energy companies in the United States, with approximately $12 billion in annual revenues as of 2017, and over $62 billion in assets.[4] The company provides a wide range of energy-related products and services to its customers through its subsidiaries:"
    },
    {
        "ticker": "STZ",
        "name": "Constellation Brands",
        "url": "https://en.wikipedia.org/wiki/Constellation_Brands",
        "desc": "Constellation Brands, Inc. is an American producer and marketer of beer, wine, and spirits. A Fortune 500 company,[3] Constellation is the largest beer import company in the US, measured by sales,[4] and has the third-largest market share (7.4 percent) of all major beer suppliers.[5] It also has sizable investments in medical and recreational cannabis through its association with Canopy Growth.[6] Based in Victor, New York, Constellation has about 40 facilities and approximately 9,000 employees.[7]"
    },
    {
        "ticker": "CEG",
        "name": "Constellation Energy",
        "url": "https://en.wikipedia.org/wiki/Constellation_Energy",
        "desc": "Constellation Energy Corporation is an American energy company headquartered in Baltimore, Maryland. The company provides electric power, natural gas, and energy management services. It has approximately two million customers across the continental United States.[2]"
    },
    {
        "ticker": "COO",
        "name": "CooperCompanies",
        "url": "https://en.wikipedia.org/wiki/CooperCompanies",
        "desc": "The Cooper Companies, Inc., branded as CooperCompanies, is a global medical device company, publicly traded on the NYSE (NYSE:COO). With its headquarters in San Ramon, California, it has a workforce of more than 12,000 employees worldwide[2] and consists of two business units, CooperVision (CVI) which manufactures contact lenses, and CooperSurgical (CSI) which manufactures medical devices and fertility and genomic products for the women’s health care market.[3]"
    },
    {
        "ticker": "CPRT",
        "name": "Copart",
        "url": "https://en.wikipedia.org/wiki/Copart",
        "desc": "Copart, Inc. is a global provider of online vehicle auction and remarketing services to automotive resellers such as insurance, rental car, fleet and finance companies in 11 countries; the US, Canada, the UK, Germany, Ireland, Brazil, Spain, UAE, Bahrain, Oman and Finland. Headquartered in Dallas, Texas, Copart has more than 200 physical locations around the world, where it houses more than 10,000 acres of vehicle inventory. Copart sells used, wholesale and repairable vehicles in weekly and bi-weekly online auctions to buyers ranging from consumers to automotive businesses around the world. Copart provides vehicle sellers with a range of services to process and sell repairable and clean title vehicles over the internet, using its patented virtual auction technology, named VB3, as well as others of its auction-related brands."
    },
    {
        "ticker": "GLW",
        "name": "Corning Inc.",
        "url": "https://en.wikipedia.org/wiki/Corning_Inc.",
        "desc": "Corning Incorporated (/ˈkoʊrniːnɡ/) is an American multinational technology company that specializes in specialty glass, ceramics, and related materials and technologies including advanced optics, primarily for industrial and scientific applications. The company was named Corning Glass Works until 1989.[3] Corning divested its consumer product lines (including CorningWare and Visions Pyroceram-based cookware, Corelle Vitrelle tableware, and Pyrex glass bakeware) in 1998 by selling the Corning Consumer Products Company subsidiary (now known as Corelle Brands) to Borden."
    },
    {
        "ticker": "CTVA",
        "name": "Corteva",
        "url": "https://en.wikipedia.org/wiki/Corteva",
        "desc": "Corteva, Inc. (also known as Corteva Agriscience) is a major American agricultural chemical and seed company that was the agricultural unit of DowDuPont prior to being spun off as an independent public company."
    },
    {
        "ticker": "CSGP",
        "name": "CoStar Group",
        "url": "https://en.wikipedia.org/wiki/CoStar_Group",
        "desc": "CoStar Group, Inc. is a Washington, DC-based provider of information, analytics, and marketing services to the commercial property industry in the United States, Canada, the United Kingdom, France, Germany, and Spain.[1] Founded in 1987 by Andrew C. Florance, the company has grown to include the online database CoStar and many online marketplaces, including Apartments.com, LoopNet, Lands of America, and BizBuySell."
    },
    {
        "ticker": "COST",
        "name": "Costco",
        "url": "https://en.wikipedia.org/wiki/Costco",
        "desc": "Costco Wholesale Corporation (commonly shortened to Costco) is an American multinational corporation which operates a chain of membership-only big-box retail stores (warehouse club).[4] As of 2022, Costco is the fifth largest retailer in the world[5] and is the world's largest retailer of choice and prime beef, organic foods, rotisserie chicken, and wine as of 2016.[6] Costco is ranked #11 on the Fortune 500 rankings of the largest United States corporations by total revenue.[7]"
    },
    {
        "ticker": "CTRA",
        "name": "Coterra",
        "url": "https://en.wikipedia.org/wiki/Coterra",
        "desc": "Coterra Energy Inc. is a company engaged in hydrocarbon exploration organized in Delaware and based in Houston, Texas. The company has operations in the Permian Basin, Marcellus Shale, and the Anadarko Basin.[1]"
    },
    {
        "ticker": "CCI",
        "name": "Crown Castle",
        "url": "https://en.wikipedia.org/wiki/Crown_Castle",
        "desc": "Crown Castle Inc. is a real estate investment trust and provider of shared communications infrastructure in the United States headquartered in Houston, Texas. Operating with 100 offices worldwide, its network includes over 40,000 cell towers and approximately 85,000 route miles of fiber supporting small cells and fiber solutions.[5]"
    },
    {
        "ticker": "CSX",
        "name": "CSX",
        "url": "https://en.wikipedia.org/wiki/CSX_Corporation",
        "desc": "CSX Corporation is an American holding company focused on rail transportation and real estate in North America, among other industries. The company was established in 1980 as part of the Chessie System and Seaboard Coast Line Industries merger. The various railroads of the former Chessie System and Seaboard Coast Line Industries that are now owned by CSX Corporation were eventually merged into a single line in 1986 and it became known as CSX Transportation. CSX Corporation currently has a number of subsidiaries beyond CSX Transportation. Previously based in Richmond, Virginia after the merger, the corporation moved its headquarters to Jacksonville, Florida, in 2003. CSX is a Fortune 500 company."
    },
    {
        "ticker": "CMI",
        "name": "Cummins",
        "url": "https://en.wikipedia.org/wiki/Cummins",
        "desc": "Cummins Inc. is an American multinational corporation that designs, manufactures, and distributes engines, filtration and power generation products.[2] Cummins also services engines and related equipment, including fuel systems, controls, air handling, filtration, emission control, electrical power generation systems, and trucks."
    },
    {
        "ticker": "CVS",
        "name": "CVS Health",
        "url": "https://en.wikipedia.org/wiki/CVS_Health",
        "desc": "CVS Health Corporation (previously CVS Corporation and CVS Caremark Corporation) is an American healthcare company that owns CVS Pharmacy, a retail pharmacy chain; CVS Caremark, a pharmacy benefits manager; and Aetna, a health insurance provider, among many other brands. The company is the world's largest healthcare company, and its headquarters are in Woonsocket, Rhode Island."
    },
    {
        "ticker": "DHI",
        "name": "D.R. Horton",
        "url": "https://en.wikipedia.org/wiki/D.R._Horton",
        "desc": "D.R. Horton, Inc. is a home construction company incorporated in Delaware and headquartered in Arlington, Texas. Since 2002, the company has been the largest homebuilder by volume in the United States.[2] The company ranked number 194 on the 2019 Fortune 500 list of the largest United States corporations by revenue.[3] The company operates in 90 markets in 29 states.[1]"
    },
    {
        "ticker": "DHR",
        "name": "Danaher Corporation",
        "url": "https://en.wikipedia.org/wiki/Danaher_Corporation",
        "desc": "Danaher Corporation is an American globally diversified conglomerate founded by brothers Steven and Mitchell Rales in 1984. Headquartered in Washington, D.C., the company designs, manufactures, and markets medical, industrial, and commercial products and services.[1] It has primarily grown by acquisitions, and historically has tried to maintain a very low public profile.[2][3] Danaher was one of the first companies in North America to adopt the Kaizen principles to manufacturing,[4] which is a lean manufacturing Japanese philosophy of continuous improvement and elimination of waste.[5]"
    },
    {
        "ticker": "DRI",
        "name": "Darden Restaurants",
        "url": "https://en.wikipedia.org/wiki/Darden_Restaurants",
        "desc": "Darden Restaurants, Inc. is an American multi-brand restaurant operator headquartered in Orlando, Florida.[5] As of May 2023, the firm owns three fine dining restaurant chains: Ruth’s Chris Steak House, Eddie V's and The Capital Grille; and six casual dining restaurant chains: Olive Garden Italian Restaurant, LongHorn Steakhouse, Bahama Breeze, Seasons 52, Yard House and Cheddar's Scratch Kitchen. Until July 28, 2014, Darden also owned Red Lobster. Darden has more than 1,800 restaurant locations and more than 175,000 employees, making it the world's largest full-service restaurant company.[7]"
    },
    {
        "ticker": "DVA",
        "name": "DaVita Inc.",
        "url": "https://en.wikipedia.org/wiki/DaVita_Inc.",
        "desc": "DaVita Inc. provides kidney dialysis services through a network of 2,816 outpatient dialysis centers in the United States, serving 204,200 patients, and 321 outpatient dialysis centers in 10 other countries serving 3,200 patients. The company primarily treats end-stage renal disease (ESRD), which requires patients to undergo dialysis 3 times per week for the rest of their lives unless they receive a donor kidney. The company has a 37% market share in the U.S. dialysis market. It is organized in Delaware and based in Denver.[2]"
    },
    {
        "ticker": "DE",
        "name": "John Deere",
        "url": "https://en.wikipedia.org/wiki/John_Deere",
        "desc": "Deere & Company, doing business as John Deere (/ˈdʒɒnˈdɪər/), is an American corporation that manufactures agricultural machinery, heavy equipment, forestry machinery, diesel engines, drivetrains (axles, transmissions, gearboxes) used in heavy equipment, and lawn care equipment. It also provides financial services and other related activities."
    },
    {
        "ticker": "DAL",
        "name": "Delta Air Lines",
        "url": "https://en.wikipedia.org/wiki/Delta_Air_Lines",
        "desc": "Delta Air Lines is one of the major airlines of the United States and a legacy carrier. One of the world's oldest airlines in operation, Delta is headquartered in Atlanta, Georgia.[1] The airline, along with its subsidiaries and regional affiliates, including Delta Connection, operates over 5,400 flights daily and serves 325 destinations in 52 countries on six continents.[6][7] Delta is a founding member of the SkyTeam airline alliance.[7] As of the end of 2022, it had 90,000 employees.[8]"
    },
    {
        "ticker": "XRAY",
        "name": "Dentsply Sirona",
        "url": "https://en.wikipedia.org/wiki/Dentsply_Sirona",
        "desc": "Dentsply Sirona is an American dental equipment manufacturer and dental consumables producer that markets its products in over 120 countries. It has factories in 21 countries.[5] The present company is largely the result of a merger in 1993 in which Gendex Corporation acquired Dentsply International Inc. for $590 million.[6]"
    },
    {
        "ticker": "DVN",
        "name": "Devon Energy",
        "url": "https://en.wikipedia.org/wiki/Devon_Energy",
        "desc": "Devon Energy Corporation is an energy company engaged in hydrocarbon exploration in the United States. It is organized in Delaware and its corporate operative headquarters are in the 50-story Devon Energy Center in Oklahoma City, Oklahoma. Its primary operations are in the Barnett Shale STACK formation in Oklahoma, Delaware Basin, Eagle Ford Group, and the Rocky Mountains.[1]"
    },
    {
        "ticker": "DXCM",
        "name": "Dexcom",
        "url": "https://en.wikipedia.org/wiki/Dexcom",
        "desc": "DexCom, Inc.[1] is a company that develops, manufactures, produces, and distributes continuous glucose monitoring (CGM) systems for diabetes management. It operates internationally with headquarters in San Diego, California, and has manufacturing facilities in Mesa, Arizona and Batu Kawan, Malaysia."
    },
    {
        "ticker": "FANG",
        "name": "Diamondback Energy",
        "url": "https://en.wikipedia.org/wiki/Diamondback_Energy",
        "desc": "Diamondback Energy is a company engaged in hydrocarbon exploration headquartered in Midland, Texas."
    },
    {
        "ticker": "DLR",
        "name": "Digital Realty",
        "url": "https://en.wikipedia.org/wiki/Digital_Realty",
        "desc": "Digital Realty (Digital Realty Trust, Inc.) is a real estate investment trust that owns, operates and invests in carrier-neutral data centers across the world. The company brings companies and data together by delivering the full spectrum of data center, colocation and interconnection services."
    },
    {
        "ticker": "DFS",
        "name": "Discover Financial",
        "url": "https://en.wikipedia.org/wiki/Discover_Financial",
        "desc": "Discover Financial Services is an American financial services company that owns and operates Discover Bank, an online bank that offers checking and savings accounts, personal loans, home equity loans, student loans and credit cards. It also owns and operates the Discover and Pulse networks, and owns Diners Club International. Discover Card is the third largest credit card brand in the United States, when measured by cards in force, with nearly 50 million cardholders. Discover is currently headquartered in the Chicago suburb of Riverwoods, Illinois.[2]"
    },
    {
        "ticker": "DIS",
        "name": "Disney",
        "url": "https://en.wikipedia.org/wiki/Disney",
        "desc": "The Walt Disney Company, commonly known as Disney (/ˈdɪzni/),[4] is an American multinational mass media and entertainment conglomerate that is headquartered at the Walt Disney Studios complex in Burbank, California. Disney was founded on October 16, 1923, by brothers Walt Disney and Roy Disney as Disney Brothers Studio; it also operated under the names Walt Disney Studio and Walt Disney Productions before changing its name to The Walt Disney Company in 1986. Early in its existence, the company established itself as a leader in the animation industry, with the creation of the widely popular character Mickey Mouse, who first appeared in Steamboat Willie, which used synchronized sound, to become the first post-produced sound cartoon.[5] The character would go on to become the company's mascot and corporate icon."
    },
    {
        "ticker": "DG",
        "name": "Dollar General",
        "url": "https://en.wikipedia.org/wiki/Dollar_General",
        "desc": "Dollar General Corporation is an American chain of variety stores headquartered in Goodlettsville, Tennessee. As of March 28, 2023, Dollar General operates 18,774 stores[1][2] in the continental United States and Mexico.[5][10][11]"
    },
    {
        "ticker": "DLTR",
        "name": "Dollar Tree",
        "url": "https://en.wikipedia.org/wiki/Dollar_Tree",
        "desc": "Dollar Tree, Inc. (stylized in all caps) is an American multi-price-point chain of discount variety stores. Headquartered in Chesapeake, Virginia, it is a Fortune 500 company and operates 15,115 stores throughout the 48 contiguous U.S. states and Canada.[1] Its stores are supported by a nationwide logistics network of 24 distribution centers. Additionally, the company operates stores under the name of Dollar Bills, as well as a multi-price-point variety chain under the Family Dollar banner."
    },
    {
        "ticker": "D",
        "name": "Dominion Energy",
        "url": "https://en.wikipedia.org/wiki/Dominion_Energy",
        "desc": "Virginia Electric and Power Company (VEPCO) (1925–1983)"
    },
    {
        "ticker": "DPZ",
        "name": "Domino's",
        "url": "https://en.wikipedia.org/wiki/Domino%27s",
        "desc": "Domino's is an American multinational pizza restaurant chain. Founded in 1960, the chain is owned by master franchisor Domino's Pizza, Inc.[3] and led by CEO Russell Weiner. The corporation is Delaware-domiciled[4] and headquartered at the Domino's Farms Office Park in Ann Arbor Township, near Ann Arbor, Michigan.[5][6] As of 2018, Domino's had approximately 15,000 stores, with 5,649 in the United States, 1,500 in India, and 1,249 in the United Kingdom.[7][8] Domino's has stores in over 83 countries[9] and 5,701 cities worldwide.[10]"
    },
    {
        "ticker": "DOV",
        "name": "Dover Corporation",
        "url": "https://en.wikipedia.org/wiki/Dover_Corporation",
        "desc": "Dover Corporation is an American conglomerate manufacturer of industrial products.[5] The Downers Grove, Illinois-based company was founded in 1955.[5][6] As of 2021, Dover's business was divided into five segments: Engineered Products, Clean Energy and Fueling, Imaging & Identification, Pumps & Process Solutions and Climate and Sustainability Technologies.[7] Dover is a constituent of the S&P 500 index[8] and trades on the New York Stock Exchange under \"DOV\". Dover was ranked 433rd in the 2022 Fortune 500.[9] The company relocated its headquarters to Illinois from New York in mid-2010.[10][11]"
    },
    {
        "ticker": "DOW",
        "name": "Dow Inc.",
        "url": "https://en.wikipedia.org/wiki/Dow_Inc.",
        "desc": "The Dow Chemical Company, officially Dow Inc., is an American multinational corporation headquartered in Midland, Michigan, United States. The company is among the three largest chemical producers in the world.[2]"
    },
    {
        "ticker": "DTE",
        "name": "DTE Energy",
        "url": "https://en.wikipedia.org/wiki/DTE_Energy",
        "desc": "DTE Energy (formerly Detroit Edison until 1996) is a Detroit-based diversified energy company involved in the development and management of energy-related businesses and services in the United States and Canada. Its operating units include an electric utility serving 2.2 million customers and a natural gas utility serving 1.3 million customers in Michigan."
    },
    {
        "ticker": "DUK",
        "name": "Duke Energy",
        "url": "https://en.wikipedia.org/wiki/Duke_Energy",
        "desc": "Duke Energy Corporation is an American electric power and natural gas holding company headquartered in Charlotte, North Carolina."
    },
    {
        "ticker": "DD",
        "name": "DuPont",
        "url": "https://en.wikipedia.org/wiki/DuPont",
        "desc": "DuPont de Nemours, Inc., commonly shortened to DuPont, is an American multinational chemical company first formed in 1802 by French-American chemist and industrialist Éleuthère Irénée du Pont de Nemours. The company played a major role in the development of Delaware and first arose as a major supplier of gunpowder. DuPont developed many polymers such as Vespel, neoprene, nylon, Corian, Teflon, Mylar, Kapton, Kevlar, Zemdrain, M5 fiber, Nomex, Tyvek, Sorona, Corfam and Lycra in the 20th century, and its scientists developed many chemicals, most notably Freon (chlorofluorocarbons), for the refrigerant industry. It also developed synthetic pigments and paints including ChromaFlair."
    },
    {
        "ticker": "EMN",
        "name": "Eastman Chemical Company",
        "url": "https://en.wikipedia.org/wiki/Eastman_Chemical_Company",
        "desc": "Eastman Chemical Company is an American company primarily involved in the chemical industry. Once a subsidiary of Kodak,[4] today it is an independent global specialty materials company that produces a broad range of advanced materials, chemicals and fibers for everyday purposes. Founded in 1920 and based in Kingsport, Tennessee, the company now has more than 50 manufacturing sites worldwide and employs approximately 14,000 people.[5]"
    },
    {
        "ticker": "ETN",
        "name": "Eaton Corporation",
        "url": "https://en.wikipedia.org/wiki/Eaton_Corporation",
        "desc": "Eaton Corporation plc is an American-Irish[2] multinational power management company with 2022 sales of $20.75 billion, founded in the United States[3] with global headquarters in Dublin, Ireland,[4] and a secondary administrative center in Beachwood, Ohio.[5] Eaton has more than 92,000 employees and sells products to customers in more than 175 countries.[6]"
    },
    {
        "ticker": "EBAY",
        "name": "eBay",
        "url": "https://en.wikipedia.org/wiki/EBay",
        "desc": "eBay Inc. (/ˈiːbeɪ/ EE-bay, often stylized as ebay) is an American multinational e-commerce company based in San Jose, California, that facilitates consumer-to-consumer and business-to-consumer sales through its website. eBay was founded by Pierre Omidyar in 1995 and became a notable success story of the dot-com bubble. eBay is a multibillion-dollar business with operations in about 32 countries, as of 2019.[1][2] The company manages the eBay website, an online auction and shopping website in which people and businesses buy and sell a wide variety of goods and services worldwide. The website is free to use for buyers, but sellers are charged fees for listing items after a limited number of free listings, and an additional or separate fee when those items are sold.[3]"
    },
    {
        "ticker": "ECL",
        "name": "Ecolab",
        "url": "https://en.wikipedia.org/wiki/Ecolab",
        "desc": "Ecolab Inc. is an American corporation headquartered in Saint Paul, Minnesota. It develops and offers services, technology and systems that specialize in treatment, purification, cleaning and hygiene of water in a wide variety of applications. It helps organizations, both in private as well as public markets, treat their water for drinking use and for use in food, healthcare, hospitality-related safety and industry.[3] Founded as Economics Laboratory in 1923 by Merritt J. Osborn, it was eventually renamed \"Ecolab\" in 1986.[4][5]"
    },
    {
        "ticker": "EIX",
        "name": "Edison International",
        "url": "https://en.wikipedia.org/wiki/Edison_International",
        "desc": "Edison International is a public utility holding company based in Rosemead, California. Its subsidiaries include Southern California Edison, and unregulated non-utility business assets Edison Energy. Edison's roots trace back to Holt & Knupps, a company founded in 1886 as a provider of street lights in Visalia, California."
    },
    {
        "ticker": "EW",
        "name": "Edwards Lifesciences",
        "url": "https://en.wikipedia.org/wiki/Edwards_Lifesciences",
        "desc": "Edwards Lifesciences is an American medical technology company headquartered in Irvine, California, specializing in artificial heart valves and hemodynamic monitoring. It developed the SAPIEN transcatheter aortic heart valve made of cow tissue within a balloon-expandable, cobalt-chromium frame, deployed via catheter.[4] The company has manufacturing facilities at the Irvine headquarters, as well as in Draper, Utah; Costa Rica; the Dominican Republic; Puerto Rico; and Singapore;[5] and is building a new facility due to be completed in 2021 in Limerick, Ireland.[6]"
    },
    {
        "ticker": "EA",
        "name": "Electronic Arts",
        "url": "https://en.wikipedia.org/wiki/Electronic_Arts",
        "desc": "Electronic Arts Inc. (EA) is an American video game company headquartered in Redwood City, California. Founded in May 1982 by Apple employee Trip Hawkins, the company was a pioneer of the early home computer game industry and promoted the designers and programmers responsible for its games as \"software artists\". EA published numerous games and some productivity software for personal computers, all of which were developed by external individuals or groups until 1987's Skate or Die!. The company shifted toward internal game studios, often through acquisitions, such as Distinctive Software becoming EA Canada in 1991."
    },
    {
        "ticker": "ELV",
        "name": "Elevance Health",
        "url": "https://en.wikipedia.org/wiki/Elevance_Health",
        "desc": "Elevance Health, Inc. is an American health insurance provider. Prior to June 2022, Elevance Health was named Anthem, Inc.[2] The company's services include medical, pharmaceutical, dental, behavioral health, long-term care, and disability plans through affiliated companies such as Anthem Blue Cross and Blue Shield, Empire BlueCross BlueShield in New York State, Anthem Blue Cross in California,[3] Wellpoint, and Carelon.[4] It is the largest for-profit managed health care company in the Blue Cross Blue Shield Association. As of 2022, the company had 46.8 million members within its affiliated companies' health plans.[5]"
    },
    {
        "ticker": "LLY",
        "name": "Eli Lilly and Company",
        "url": "https://en.wikipedia.org/wiki/Eli_Lilly_and_Company",
        "desc": "Eli Lilly and Company is an American pharmaceutical company headquartered in Indianapolis, Indiana, with offices in 18 countries. Its products are sold in approximately 125 countries. The company was founded in 1876 by, and named after, Colonel Eli Lilly, a pharmaceutical chemist and veteran of the American Civil War.[4]"
    },
    {
        "ticker": "EMR",
        "name": "Emerson Electric",
        "url": "https://en.wikipedia.org/wiki/Emerson_Electric",
        "desc": "Emerson Electric Co. is an American multinational corporation headquartered in Ferguson, Missouri.[2][3][4] The Fortune 500 company manufactures products and provides engineering services for industrial, commercial, and consumer markets.[5][6][7] Emerson has approximately 86,700 employees and 170 manufacturing locations.[8]"
    },
    {
        "ticker": "ENPH",
        "name": "Enphase",
        "url": "https://en.wikipedia.org/wiki/Enphase",
        "desc": "Enphase Energy, Inc. is an American energy technology company headquartered in Fremont, California, that develops and manufactures solar micro-inverters, battery energy storage, and EV charging stations primarily for residential customers. Enphase was established in 2006 and is the first company to successfully commercialize the solar micro-inverter, which converts the direct current (DC) power generated by a solar panel into grid-compatible alternating current (AC) for use or export. The company has shipped more than 48 million microinverters to 2.5 million solar systems in more than 140 countries.[2]"
    },
    {
        "ticker": "ETR",
        "name": "Entergy",
        "url": "https://en.wikipedia.org/wiki/Entergy",
        "desc": "Entergy Corporation is a Fortune 500 integrated energy company engaged primarily in electric power production and retail distribution operations in the Deep South of the United States. Entergy is headquartered in New Orleans, Louisiana,[4] and generates and distributes electric power to 3 million customers in Arkansas, Louisiana, Mississippi and Texas. Entergy has annual revenues of $11 billion and employs more than 13,000 people."
    },
    {
        "ticker": "EOG",
        "name": "EOG Resources",
        "url": "https://en.wikipedia.org/wiki/EOG_Resources",
        "desc": "EOG Resources, Inc. is an American energy company engaged in hydrocarbon exploration. It is organized in Delaware and headquartered in the Heritage Plaza building in Houston, Texas."
    },
    {
        "ticker": "EPAM",
        "name": "EPAM Systems",
        "url": "https://en.wikipedia.org/wiki/EPAM_Systems",
        "desc": "EPAM Systems, Inc. is an American company that specializes in software engineering services, digital platform engineering, and digital product design, operating out of Newtown, Pennsylvania. EPAM is a founding member of the MACH Alliance."
    },
    {
        "ticker": "EQT",
        "name": "EQT",
        "url": "https://en.wikipedia.org/wiki/EQT",
        "desc": "EQT Corporation is an American energy company engaged in hydrocarbon exploration and pipeline transport. It is headquartered in EQT Plaza in Pittsburgh, Pennsylvania."
    },
    {
        "ticker": "EFX",
        "name": "Equifax",
        "url": "https://en.wikipedia.org/wiki/Equifax",
        "desc": "Equifax Inc. is an American multinational consumer credit reporting agency headquartered in Atlanta, Georgia and is one of the three largest consumer credit reporting agencies, along with Experian and TransUnion (together known as the \"Big Three\").[4] Equifax collects and aggregates information on over 800 million individual consumers and more than 88 million businesses worldwide. In addition to credit and demographic data and services to business,[5] Equifax sells credit monitoring and fraud prevention services directly to consumers.[6]"
    },
    {
        "ticker": "EQIX",
        "name": "Equinix",
        "url": "https://en.wikipedia.org/wiki/Equinix",
        "desc": "Equinix, Inc. is an American multinational company headquartered in Redwood City, California, that specializes in Internet connection and data centers. The company is a leader in global colocation data center market share,[3] with 248 data centers [2] in 27 countries[4] on five continents.[5]"
    },
    {
        "ticker": "EQR",
        "name": "Equity Residential",
        "url": "https://en.wikipedia.org/wiki/Equity_Residential",
        "desc": "Equity Residential is a publicly traded real estate investment trust that invests in apartments."
    },
    {
        "ticker": "ESS",
        "name": "Essex Property Trust",
        "url": "https://en.wikipedia.org/wiki/Essex_Property_Trust",
        "desc": "Essex Property Trust is a publicly traded real estate investment trust that invests in apartments, primarily on the West Coast of the United States.[1]"
    },
    {
        "ticker": "EL",
        "name": "Estée Lauder Companies (The)",
        "url": "https://en.wikipedia.org/wiki/The_Est%C3%A9e_Lauder_Companies",
        "desc": "The Estée Lauder Companies Inc. (/ˈɛsteɪ ˈlɔːdər/ EST-ay LAW-dər; stylized as ESTĒE LAUDER) is an American multinational cosmetics company, a manufacturer and marketer of makeup, skincare, perfume , and hair care products, based in Midtown Manhattan, New York City. It is the second largest cosmetics company in the world after L'Oréal. The company owns a diverse portfolio of brands, including La Mer, Jo Malone London, Clinique and Tom Ford Beauty, among many more, distributed internationally through both digital commerce and retail channels."
    },
    {
        "ticker": "ETSY",
        "name": "Etsy",
        "url": "https://en.wikipedia.org/wiki/Etsy",
        "desc": "Etsy, Inc. is an American e-commerce company focused on handmade or vintage items and craft supplies. These items fall under a wide range of categories, including jewelry, bags, clothing, home décor and furniture, toys, art, as well as craft supplies and tools. Items described as vintage must be at least 20 years old.[2] The site follows in the tradition of open craft fairs, giving sellers personal storefronts where they list their goods for a fee of US$0.20 per item.[3] Beginning in 2013, Etsy allowed sellers to sell mass-manufactured items.[4]"
    },
    {
        "ticker": "EG",
        "name": "Everest Re",
        "url": "https://en.wikipedia.org/wiki/Everest_Re",
        "desc": "Everest Group, Ltd. is a Bermuda-based provider of reinsurance and insurance, operating for close to 50 years through subsidiaries in the U.S., Europe, Singapore, Canada, Bermuda and other territories."
    },
    {
        "ticker": "EVRG",
        "name": "Evergy",
        "url": "https://en.wikipedia.org/wiki/Evergy",
        "desc": "Evergy, Inc. is an American investor-owned utility (IOU) with publicly traded stock with headquarters in Topeka, Kansas, and in Kansas City, Missouri. The company was formed from a merger of Westar Energy of Topeka and Great Plains Energy of Kansas City, parent company of Kansas City Power & Light. Evergy is the largest electric company in Kansas, serving more than 1.7 million residential, commercial and industrial customers in Kansas and Missouri.[2] Its more than 40 power plants have generating capacity of 16,000 megawatt electricity in Kansas and Missouri. Service territory covers 28,130 square miles (72,900 km2) in east Kansas and west Missouri. It owns more than 10,100 miles (16,300 km) of transmission lines and about 52,000 miles (84,000 km) of distribution lines."
    },
    {
        "ticker": "ES",
        "name": "Eversource",
        "url": "https://en.wikipedia.org/wiki/Eversource",
        "desc": "Eversource Energy is a publicly traded, Fortune 500 energy company headquartered in Hartford, Connecticut, and Boston, Massachusetts, with several regulated subsidiaries offering retail electricity, natural gas service and water service to approximately 4 million[7] customers in Connecticut, Massachusetts, and New Hampshire."
    },
    {
        "ticker": "EXC",
        "name": "Exelon",
        "url": "https://en.wikipedia.org/wiki/Exelon",
        "desc": "Exelon Corporation is a public utility headquartered in Chicago, Illinois, and incorporated in Pennsylvania.[1] Exelon is the largest electric parent company in the United States by revenue and is the largest regulated electric utility in the United States with approximately 10 million customers. The company is ranked 99th on the Fortune 500.[2]"
    },
    {
        "ticker": "EXPE",
        "name": "Expedia Group",
        "url": "https://en.wikipedia.org/wiki/Expedia_Group",
        "desc": "Expedia Group, Inc. is an American travel technology company that owns and operates travel fare aggregators and travel metasearch engines, including Expedia.com, Hotels.com, Vrbo, Travelocity, Hotwire.com, Orbitz, Ebookers, CheapTickets, CarRentals.com, Expedia Cruises, Wotif, and Trivago.[1] Over 3 million lodging facilities and flights on over 500 airlines are bookable on the company's websites.[1] It has 16,500 employees, and its headquarters are located in Seattle, Washington."
    },
    {
        "ticker": "EXPD",
        "name": "Expeditors International",
        "url": "https://en.wikipedia.org/wiki/Expeditors_International",
        "desc": "Expeditors (Expeditors International of Washington) is an American worldwide logistics and freight forwarding company headquartered in Seattle, Washington.[3]"
    },
    {
        "ticker": "EXR",
        "name": "Extra Space Storage",
        "url": "https://en.wikipedia.org/wiki/Extra_Space_Storage",
        "desc": "Extra Space Storage is a real estate investment trust headquartered in Salt Lake City, UT that invests in self storage facilities. The company rents storage units, including climate controlled units, drive-up units, lockers, boat storage, RV storage and business storage under the brands Extra Space Storage, Life Storage, and Storage Express. As of July 20, 2023 the company owned and/or operated over 3,500 locations in 43 states, and Washington, D.C. comprising approximately 270 million square feet of net rentable space.[1][2] It is the largest owner of self storage units in the United States[3] and the largest self storage property manager.[4]"
    },
    {
        "ticker": "XOM",
        "name": "ExxonMobil",
        "url": "https://en.wikipedia.org/wiki/ExxonMobil",
        "desc": "ExxonMobil Corporation[a] (commonly shortened to Exxon[4][5][6]) is an American multinational oil and gas corporation and the largest direct descendant of John D. Rockefeller's Standard Oil. The company, which took its present name in 1999 per the merger of Exxon and Mobil, is vertically integrated across the entire oil and gas industry, and within it is also a chemicals division which produces plastic, synthetic rubber, and other chemical products. ExxonMobil is headquartered in the Houston suburb of Spring, Texas, though officially incorporated in New Jersey.[7][8]: 1"
    },
    {
        "ticker": "FFIV",
        "name": "F5, Inc.",
        "url": "https://en.wikipedia.org/wiki/F5,_Inc.",
        "desc": "F5, Inc. is a publicly-held American technology company specializing in application security, multi-cloud management, online fraud prevention, application delivery networking (ADN), application availability & performance, network security, and access & authorization."
    },
    {
        "ticker": "FDS",
        "name": "FactSet",
        "url": "https://en.wikipedia.org/wiki/FactSet",
        "desc": "FactSet provides client support & learning, implementation services, business advisory, data delivery, index services, portfolio data management, and transition services.[5]"
    },
    {
        "ticker": "FICO",
        "name": "Fair Isaac",
        "url": "https://en.wikipedia.org/wiki/FICO",
        "desc": "FICO (legal name: Fair Isaac Corporation), originally Fair, Isaac and Company, is a data analytics company based in Bozeman, Montana, focused on credit scoring services. It was founded by Bill Fair and Earl Isaac in 1956.[2] Its FICO score, a measure of consumer credit risk,[3] has become a fixture of consumer lending in the United States."
    },
    {
        "ticker": "FAST",
        "name": "Fastenal",
        "url": "https://en.wikipedia.org/wiki/Fastenal",
        "desc": "Fastenal Company is an American company based in Winona, Minnesota, founded in 1967. It placed 479 in the 2021 Fortune 500 based on its 2020 revenues,[2] and its stock is a component of the Nasdaq 100 and S&P 500 stock market indices. Fastenal currently has 3,334 in-market locations as of March 2023.[3]"
    },
    {
        "ticker": "FRT",
        "name": "Federal Realty",
        "url": "https://en.wikipedia.org/wiki/Federal_Realty",
        "desc": "Federal Realty Investment Trust is a real estate investment trust that invests in shopping centers in the Northeastern United States, the Mid-Atlantic states, California, and South Florida.[1]"
    },
    {
        "ticker": "FDX",
        "name": "FedEx",
        "url": "https://en.wikipedia.org/wiki/FedEx",
        "desc": "FedEx Corporation, formerly Federal Express Corporation and later FDX Corporation, is an American multinational conglomerate holding company focused on transportation, e-commerce and business services based in Memphis, Tennessee.[3][4] The name \"FedEx\" is a syllabic abbreviation of the name of the company's original air division, Federal Express, which was used from 1973 until 2000. FedEx today is best known for its air delivery service, FedEx Express, which was one of the first major shipping companies to offer overnight delivery as a flagship service. Since then, FedEx also started FedEx Ground, FedEx Office (originally known as Kinko's), FedEx Supply Chain, FedEx Freight, and various other services across multiple subsidiaries, often meant to respond to its main competitor, UPS. The company is the fifth largest American-headquartered employer globally with 547,000 employees, and FedEx is also one of the top contractors of the US government and assists in the transport of some United States Postal Service packages through their Air Cargo Network contract.[5]"
    },
    {
        "ticker": "FITB",
        "name": "Fifth Third Bank",
        "url": "https://en.wikipedia.org/wiki/Fifth_Third_Bank",
        "desc": "Fifth Third Bank (5/3 Bank), the principal subsidiary of Fifth Third Bancorp, is an American bank holding company headquartered in Cincinnati, Ohio. Fifth Third is one of the largest consumer banks in the Midwestern United States."
    },
    {
        "ticker": "FSLR",
        "name": "First Solar",
        "url": "https://en.wikipedia.org/wiki/First_Solar",
        "desc": "First Solar, Inc. is an American manufacturer of solar panels, and a provider of utility-scale PV power plants and supporting services that include finance, construction, maintenance and end-of-life panel recycling. First Solar uses rigid thin-film modules for its solar panels, and produces CdTe panels using cadmium telluride (CdTe) as a semiconductor.[3] The company was founded in 1990 by inventor Harold McMaster as Solar Cells, Inc. and the Florida Corporation in 1993 with JD Polk. In 1999 it was purchased by True North Partners, LLC, who rebranded it as First Solar, Inc."
    },
    {
        "ticker": "FE",
        "name": "FirstEnergy",
        "url": "https://en.wikipedia.org/wiki/FirstEnergy",
        "desc": "FirstEnergy Corp is an electric utility headquartered in Akron, Ohio. It was established when Ohio Edison merged with Centerior Energy in 1997. Its subsidiaries and affiliates are involved in the distribution, transmission, and generation of electricity, as well as energy management and other energy-related services. Its ten electric utility operating companies comprise one of the United States' largest investor-owned utilities, based on serving 6 million customers within a 65,000-square-mile (170,000 km2) area of Ohio, Pennsylvania, West Virginia, Virginia, Maryland, New Jersey, and New York.[3] Its generation subsidiaries control more than 16,000 megawatts of capacity, and its distribution lines span over 194,000 miles. In 2018, FirstEnergy ranked 219 on the Fortune 500 list of the largest public corporations in the United States by revenue.[4]"
    },
    {
        "ticker": "FIS",
        "name": "FIS",
        "url": "https://en.wikipedia.org/wiki/FIS_(company)",
        "desc": "Fidelity National Information Services, Inc. (FIS) is an American multinational corporation which offers a wide range of financial products and services. FIS is most known for its development of Financial Technology, or FinTech, and as of Q2 2020 it offers its solutions in three primary segments: Merchant Solutions, Banking Solutions, and Capital Market Solutions. Annually, FIS facilitates the movement of roughly $9 trillion through the processing of approximately 75 billion transactions in service to more than 20,000 clients around the globe.[2]"
    },
    {
        "ticker": "FI",
        "name": "Fiserv",
        "url": "https://en.wikipedia.org/wiki/Fiserv",
        "desc": "Fiserv, Inc. (/faɪˈsərv/) is an American multinational company headquartered in Brookfield, Wisconsin, that provides financial technology services to clients across the financial services sector, including: banks, thrifts, credit unions, securities broker dealers, mortgage, insurance, leasing and finance companies, and retailers.[3][4]"
    },
    {
        "ticker": "FLT",
        "name": "Fleetcor",
        "url": "https://en.wikipedia.org/wiki/Fleetcor",
        "desc": "FLEETCOR Technologies, Inc. is a global business payments and spend management company that provides solutions that control expense-related purchasing and payment processes. FLEETCOR is an S&P 500 company with a portfolio of brands that automate, secure, digitize and manage billions of payment transactions annually on behalf of businesses across more than 100 countries in North America, Latin America, Europe, and Asia-Pacific.[3]"
    },
    {
        "ticker": "FMC",
        "name": "FMC Corporation",
        "url": "https://en.wikipedia.org/wiki/FMC_Corporation",
        "desc": "FMC Corporation is an American chemical manufacturing company headquartered in Philadelphia, Pennsylvania, which originated as an insecticide producer in 1883 and later diversified into other industries.[contradictory] In 1941 at the beginning of US involvement in WWII, the company received a contract to design and build amphibious tracked landing vehicles for the United States Department of War,[2] and afterwards the company continued to diversify its products. FMC employs 7,000 people worldwide, and had gross revenues of US$4.7 billion in 2018.[3][4][5]"
    },
    {
        "ticker": "F",
        "name": "Ford Motor Company",
        "url": "https://en.wikipedia.org/wiki/Ford_Motor_Company",
        "desc": "Ford Motor Company (commonly known as Ford) is an American multinational automobile manufacturer headquartered in Dearborn, Michigan, United States. It was founded by Henry Ford and incorporated on June 16, 1903. The company sells automobiles and commercial vehicles under the Ford brand, and luxury cars under its Lincoln brand. Ford also owns a 32% stake in China's Jiangling Motors.[8] It also has joint ventures in China (Changan Ford), Taiwan (Ford Lio Ho), Thailand (AutoAlliance Thailand), and Turkey (Ford Otosan). The company is listed on the New York Stock Exchange and is controlled by the Ford family; they have minority ownership but the majority of the voting power.[6][9]"
    },
    {
        "ticker": "FTNT",
        "name": "Fortinet",
        "url": "https://en.wikipedia.org/wiki/Fortinet",
        "desc": "Fortinet is a cybersecurity company with headquarters in Sunnyvale, California. The company develops and sells security solutions like firewalls, endpoint security and intrusion detection systems. Fortinet has offices located all over the world."
    },
    {
        "ticker": "FTV",
        "name": "Fortive",
        "url": "https://en.wikipedia.org/wiki/Fortive",
        "desc": "Fortive is an American industrial technology conglomerate company headquartered in Everett, Washington. Fortive was spun off from Danaher in July 2016.[2] Brothers Steven and Mitchell Rales, Danaher's founders, retained board seats with Fortive after the separation.[3] At the point of its independent incorporation, Fortive immediately became a component of the S&P 500. Later the transportation, automation and franchise distribution businesses would be spun off. In 2018 and 2019, Fortune named Fortive as a Future 50 company.[4] In 2020, Fortune named Fortive one of the world's most admired companies.[5][6]"
    },
    {
        "ticker": "FOXA",
        "name": "Fox Corporation",
        "url": "https://en.wikipedia.org/wiki/Fox_Corporation",
        "desc": "Fox Corporation (stylized in all-caps as FOX Corporation[6]) is an American multinational mass media company headquartered at 1211 Avenue of the Americas in New York City. Incorporated in Delaware, it was formed on March 19, 2019, as a result of the acquisition of 21st Century Fox by The Walt Disney Company, which was closed on March 20.[7][8][9][10] The company is controlled by the Murdoch family via a family trust with 39.6% ownership share, and by Rupert Murdoch himself to the effect of almost 40%.[11][12]"
    },
    {
        "ticker": "FOX",
        "name": "Fox Corporation",
        "url": "https://en.wikipedia.org/wiki/Fox_Corporation",
        "desc": "Fox Corporation (stylized in all-caps as FOX Corporation[6]) is an American multinational mass media company headquartered at 1211 Avenue of the Americas in New York City. Incorporated in Delaware, it was formed on March 19, 2019, as a result of the acquisition of 21st Century Fox by The Walt Disney Company, which was closed on March 20.[7][8][9][10] The company is controlled by the Murdoch family via a family trust with 39.6% ownership share, and by Rupert Murdoch himself to the effect of almost 40%.[11][12]"
    },
    {
        "ticker": "BEN",
        "name": "Franklin Templeton",
        "url": "https://en.wikipedia.org/wiki/Franklin_Templeton",
        "desc": "Franklin Resources, Inc. is an American multinational holding company that, together with its subsidiaries, is referred to as Franklin Templeton; it is a global investment firm founded in New York City in 1947 as Franklin Distributors, Inc. It is listed on the New York Stock Exchange under the ticker symbol BEN, in honor of Benjamin Franklin, for whom the company is named, and who was admired by founder Rupert Johnson Sr. In 1973, the company's headquarters moved from New York to San Mateo, California.[2] As of October 12, 2020, Franklin Templeton held US$1.4 trillion in assets under management (AUM) on behalf of private, professional and institutional investors.[3]"
    },
    {
        "ticker": "FCX",
        "name": "Freeport-McMoRan",
        "url": "https://en.wikipedia.org/wiki/Freeport-McMoRan",
        "desc": "Freeport-McMoRan Inc., often called Freeport, is an American mining company based in the Freeport-McMoRan Center, in Phoenix, Arizona. The company is the world's largest producer of molybdenum, is a major copper producer and operates the world's largest gold mine, the Grasberg mine in Papua, Indonesia."
    },
    {
        "ticker": "GRMN",
        "name": "Garmin",
        "url": "https://en.wikipedia.org/wiki/Garmin",
        "desc": "Garmin Ltd. (shortened to Garmin, stylized as GARMIN, and formerly known as ProNav) is an American, Swiss-domiciled multinational technology company founded in 1989 by Gary Burrell and Min Kao in Lenexa, Kansas, United States, with headquarters in Olathe, Kansas.[2][3] Since 2010, the company is legally incorporated in Schaffhausen, Switzerland.[4]"
    },
    {
        "ticker": "IT",
        "name": "Gartner",
        "url": "https://en.wikipedia.org/wiki/Gartner",
        "desc": "Gartner, Inc. is an American technological research and consulting firm based in Stamford, Connecticut that conducts research on technology and shares this research both through private consulting as well as executive programs and conferences. Its clients include large corporations, government agencies, technology companies, and investment firms."
    },
    {
        "ticker": "GEHC",
        "name": "GE HealthCare",
        "url": "https://en.wikipedia.org/wiki/GE_HealthCare",
        "desc": "GE HealthCare Technologies, Inc.,[5] doing business as GE HealthCare, is an American multinational medical technology company headquartered in Chicago, Illinois.[6] It was spun-off from General Electric on January 4, 2023, with GE retaining 20%. As of 2017, it is a manufacturer and distributor of diagnostic imaging agents and radiopharmaceuticals for imaging modalities used in medical imaging procedures. It offers dyes used in magnetic-resonance-imaging procedures; manufactures medical diagnostic equipment, including CT image machines; MRI, XRAY; Ultrasound; Cath Labs; Mammogram; Nuclear Medicine Cameras; and develops Health technology for medical imaging and information technologies, medical diagnostics, patient monitoring systems, disease research, drug discovery, and biopharmaceutical manufacturing. It was incorporated in 1994[7] and operates in more than 100 countries."
    },
    {
        "ticker": "GEN",
        "name": "Gen Digital",
        "url": "https://en.wikipedia.org/wiki/Gen_Digital",
        "desc": "Gen Digital Inc. (formerly Symantec Corporation and NortonLifeLock) is a multinational software company co-headquartered in Tempe, Arizona and Prague, Czech Republic. The company provides cybersecurity software and services. Gen is a Fortune 500 company and a member of the S&P 500 stock-market index. The company also has development centers in Pune, Chennai and Bangalore. Its portfolio includes Norton, Avast, LifeLock, Avira, AVG, ReputationDefender, and CCleaner."
    },
    {
        "ticker": "GNRC",
        "name": "Generac",
        "url": "https://en.wikipedia.org/wiki/Generac",
        "desc": "Generac Holdings Inc., commonly referred to as Generac (derived from a combination of generating and AC), is a Fortune 1000 American manufacturer of backup power generation products for residential, light commercial and industrial markets.[6] Generac's power systems range in output from 800 watts to 9 megawatts,[7] and are available through independent dealers, retailers and wholesalers.[6] Generac is headquartered in Waukesha, Wisconsin,[3][4] and has manufacturing facilities in Berlin, Oshkosh, Jefferson, Eagle, and Whitewater; all in Wisconsin.[7]"
    },
    {
        "ticker": "GD",
        "name": "General Dynamics",
        "url": "https://en.wikipedia.org/wiki/General_Dynamics",
        "desc": "General Dynamics Corporation (GD) is an American publicly traded aerospace and defense corporation headquartered in Reston, Virginia. As of 2020, it was the fifth-largest defense contractor in the world by arms sales, and fifth largest in the United States by total sales.[2] The company is a Fortune 100 company, and was ranked No. 94 in 2022.[3]"
    },
    {
        "ticker": "GE",
        "name": "General Electric",
        "url": "https://en.wikipedia.org/wiki/General_Electric",
        "desc": "General Electric Company (GE) is an American multinational conglomerate founded in 1892 and incorporated in the state of New York and headquartered in Boston. The company has several divisions, including aerospace, power, renewable energy, digital industry, additive manufacturing, and venture capital and finance.[2][3][4]"
    },
    {
        "ticker": "GIS",
        "name": "General Mills",
        "url": "https://en.wikipedia.org/wiki/General_Mills",
        "desc": "General Mills, Inc., is an American multinational manufacturer and marketer of branded processed consumer foods sold through retail stores. Founded on the banks of the Mississippi River at Saint Anthony Falls in Minneapolis, the company originally gained fame for being a large flour miller. Today, the company markets many well-known North American brands, including Gold Medal flour, Annie's Homegrown, Lärabar, Cascadian Farm, Betty Crocker, Yoplait, Nature Valley, Totino's, Pillsbury, Old El Paso, Häagen-Dazs, as well as breakfast cereals under the General Mills name, including Cheerios, Chex, Lucky Charms, Trix, Cocoa Puffs and Count Chocula and the other monster cereals.[3]"
    },
    {
        "ticker": "GM",
        "name": "General Motors",
        "url": "https://en.wikipedia.org/wiki/General_Motors",
        "desc": "The General Motors Company (GM)[2] is an American multinational automotive manufacturing company headquartered in Detroit, Michigan, United States.[3] The company is most known for owning and manufacturing its four core automobile brands of Chevrolet, GMC, Cadillac and Buick. By sales, it was the largest automaker in the United States in 2022, and was the largest in the world for 77 years before losing the top spot to Toyota in 2008.[4][5]"
    },
    {
        "ticker": "GPC",
        "name": "Genuine Parts Company",
        "url": "https://en.wikipedia.org/wiki/Genuine_Parts_Company",
        "desc": "Genuine Parts Company (GPC) is an American service organization engaged in the distribution of automotive replacement parts, industrial replacement parts, office products and electrical/electronic materials. GPC serves numerous customers from more than 2,600 operations around the world, and has approximately 48,000 employees.[1] It owns the NAPA Auto Parts brand."
    },
    {
        "ticker": "GILD",
        "name": "Gilead Sciences",
        "url": "https://en.wikipedia.org/wiki/Gilead_Sciences",
        "desc": "Gilead Sciences, Inc. (/ˈɡɪliəd/) is an American biopharmaceutical company headquartered in Foster City, California, that focuses on researching and developing antiviral drugs used in the treatment of HIV/AIDS, hepatitis B, hepatitis C, influenza, and COVID-19, including ledipasvir/sofosbuvir and sofosbuvir. Gilead is a member of the NASDAQ Biotechnology Index and the S&P 500."
    },
    {
        "ticker": "GL",
        "name": "Globe Life",
        "url": "https://en.wikipedia.org/wiki/Globe_Life",
        "desc": "Globe Life (GL) is an American financial services holding company listed on the New York Stock Exchange which operates through its wholly owned subsidiaries providing life insurance, annuity, and supplemental health insurance products. The company is based in McKinney, Texas."
    },
    {
        "ticker": "GPN",
        "name": "Global Payments",
        "url": "https://en.wikipedia.org/wiki/Global_Payments",
        "desc": "Global Payments Inc. is an American multinational financial technology company that provides payment technology and services to merchants, issuers and consumers.[8] In June 2021, the company was named to the Fortune 500.[9] The company processes payments made through credit cards, debit cards,[10] and digital and contactless payments.[11]"
    },
    {
        "ticker": "GS",
        "name": "Goldman Sachs",
        "url": "https://en.wikipedia.org/wiki/Goldman_Sachs",
        "desc": "The Goldman Sachs Group, Inc. (/sæks/ SAKS) is an American multinational investment bank and financial services company. Founded in 1869, Goldman Sachs is headquartered in Lower Manhattan in New York City, with regional headquarters in many international financial centers.[2] Goldman Sachs is the second largest investment bank in the world by revenue[3] and is ranked 55th on the Fortune 500 list of the largest United States corporations by total revenue.[4] It is considered a systemically important financial institution by the Financial Stability Board."
    },
    {
        "ticker": "HAL",
        "name": "Halliburton",
        "url": "https://en.wikipedia.org/wiki/Halliburton",
        "desc": "Halliburton Company is an American multinational corporation and its world's second largest oil service company and responsible for most of the worlds largest fracking operations.[6]. It employs approximately 55,000 people through its hundreds of subsidiaries, affiliates, branches, brands, and divisions in more than 70 countries.[7][8] The company, though incorporated in the United States, has dual headquarters located in Houston and in Dubai.[9][10][11]"
    },
    {
        "ticker": "HIG",
        "name": "Hartford (The)",
        "url": "https://en.wikipedia.org/wiki/The_Hartford",
        "desc": "The Hartford Financial Services Group, Inc., usually known as The Hartford, is a United States-based investment and insurance company. The Hartford is a Fortune 500 company headquartered in its namesake city of Hartford, Connecticut.[3] It was ranked 160th in Fortune 500 in the year of 2020.[4] The company's earnings are divided between property-and-casualty operations, group benefits and mutual funds."
    },
    {
        "ticker": "HAS",
        "name": "Hasbro",
        "url": "https://en.wikipedia.org/wiki/Hasbro",
        "desc": "Hasbro, Inc. (/ˈhæzbroʊ/; a syllabic abbreviation of its original name, Hassenfeld Brothers) is an American multinational conglomerate holding company incorporated and headquartered in Pawtucket, Rhode Island.[6] Hasbro owns the trademarks and products of Kenner, Milton Bradley, Parker Brothers, and Wizards of the Coast, among others. As of August 2020 over 81.5% of its shares were held by large financial institutions.[7]"
    },
    {
        "ticker": "HCA",
        "name": "HCA Healthcare",
        "url": "https://en.wikipedia.org/wiki/HCA_Healthcare",
        "desc": "HCA Healthcare is an American for-profit operator of health care facilities that was founded in 1968. It is based in Nashville, Tennessee, and, as of May 2020, owns and operates 186 hospitals and approximately 2,000 sites of care, including surgery centers, freestanding emergency rooms, urgent care centers and physician clinics in 21 states and the United Kingdom.[6] As of 2023, HCA Healthcare is ranked #66 on the Fortune 500 rankings of the largest United States corporations by total revenue.[7]"
    },
    {
        "ticker": "PEAK",
        "name": "Healthpeak",
        "url": "https://en.wikipedia.org/wiki/Healthpeak_Properties",
        "desc": "Healthpeak Properties, Inc. is an American real estate investment trust that invests in real estate related to the healthcare industry including senior housing, life science, and medical offices. It is organized 2007 in Maryland and headquartered in Denver, Colorado with offices in Irvine, Nashville and San Francisco. As of December 31, 2019, the company owned interests in 617 properties.[1]"
    },
    {
        "ticker": "HSIC",
        "name": "Henry Schein",
        "url": "https://en.wikipedia.org/wiki/Henry_Schein",
        "desc": "Henry Schein, Inc. is an American distributor of health care products and services with a presence in 32 countries.[3][4] The company is a Fortune World's Most Admired Company[5] and is ranked number one in its industry for social responsibility by Fortune magazine.[6] Ethisphere named Henry Schein as one of the 2023 World's Most Ethical Companies for the 12th consecutive year.[7]"
    },
    {
        "ticker": "HSY",
        "name": "Hershey's",
        "url": "https://en.wikipedia.org/wiki/The_Hershey_Company",
        "desc": "The Hershey Company, commonly known as Hershey's, is an American multinational company and one of the largest chocolate manufacturers in the world. It also manufactures baked products, such as cookies and cakes, and sells beverages like milkshakes, as well as other products. Its headquarters are in Hershey, Pennsylvania, United States, which is also home to Hersheypark and Hershey's Chocolate World. It was founded by Milton S. Hershey in 1894 as the Hershey Chocolate Company, which was a subsidiary of his Lancaster Caramel Company. The Hershey Trust Company owns a minority stake but retains a majority of the voting power within the company.[6]"
    },
    {
        "ticker": "HES",
        "name": "Hess Corporation",
        "url": "https://en.wikipedia.org/wiki/Hess_Corporation",
        "desc": "Hess Corporation (formerly Amerada Hess Corporation) is an American global independent energy company involved in the exploration and production of crude oil and natural gas.[3] It was formed by the merger of Hess Oil and Chemical and Amerada Petroleum in 1968. Leon Hess served as CEO from the early 1960s through 1995, after which his son John B Hess succeeded him as chairman and CEO.[4]"
    },
    {
        "ticker": "HPE",
        "name": "Hewlett Packard Enterprise",
        "url": "https://en.wikipedia.org/wiki/Hewlett_Packard_Enterprise",
        "desc": "The Hewlett Packard Enterprise Company (HPE) is an American multinational information technology company based in Spring, Texas, United States."
    },
    {
        "ticker": "HLT",
        "name": "Hilton Worldwide",
        "url": "https://en.wikipedia.org/wiki/Hilton_Worldwide",
        "desc": "Hilton Worldwide Holdings Inc. is an American multinational hospitality company that manages and franchises a broad portfolio of hotels and resorts. Founded by Conrad Hilton in May 1919, the company is now led by Christopher J. Nassetta. Hilton is headquartered in Tysons, Virginia, United States."
    },
    {
        "ticker": "HOLX",
        "name": "Hologic",
        "url": "https://en.wikipedia.org/wiki/Hologic",
        "desc": "Hologic, Inc. is a medical technology company primarily focused on women’s health; it sells medical devices for diagnostics, surgery, and medical imaging.[2]"
    },
    {
        "ticker": "HD",
        "name": "Home Depot (The)",
        "url": "https://en.wikipedia.org/wiki/The_Home_Depot",
        "desc": "The Home Depot, Inc., often simply referred to as Home Depot, is an American multinational home improvement retail corporation that sells tools, construction products, appliances, and services, including fuel and transportation rentals. Home Depot is the largest home improvement retailer in the United States.[4] In 2021, the company had 490,600 employees and more than $151 billion in revenue. The company is headquartered in incorporated Cobb County, Georgia, with an Atlanta mailing address.[5]"
    },
    {
        "ticker": "HON",
        "name": "Honeywell",
        "url": "https://en.wikipedia.org/wiki/Honeywell",
        "desc": "Honeywell International Inc. is an American publicly traded, multinational conglomerate corporation headquartered in Charlotte, North Carolina. It primarily operates in four areas of business: aerospace, building technologies, performance materials and technologies (PMT), and safety and productivity solutions (SPS).[2]"
    },
    {
        "ticker": "HRL",
        "name": "Hormel Foods",
        "url": "https://en.wikipedia.org/wiki/Hormel_Foods",
        "desc": "Hormel Foods Corporation is an American food processing company founded in 1891 in Austin, Minnesota, by George A. Hormel as George A. Hormel & Company. The company originally focused on the packaging and selling of ham, sausage and other pork, chicken, beef and lamb products to consumers, adding Spam in 1937. By the 1980s, Hormel began offering a wider range of packaged and refrigerated foods. The company changed its name to Hormel Foods Corporation in 1993 and uses the Hormel brand on many of its products; the company's other brands include Planters, Columbus Craft Meats, Dinty Moore, Jennie-O, and Skippy. The company's products are available in 80 countries."
    },
    {
        "ticker": "HST",
        "name": "Host Hotels & Resorts",
        "url": "https://en.wikipedia.org/wiki/Host_Hotels_%26_Resorts",
        "desc": "Host Hotels & Resorts, Inc. is an American real estate investment trust that invests in hotels. As of February 19, 2021, the company owned 80 upscale hotels containing approximately 46,500 rooms in the United States, Brazil, and Canada.[1]"
    },
    {
        "ticker": "HWM",
        "name": "Howmet Aerospace",
        "url": "https://en.wikipedia.org/wiki/Howmet_Aerospace",
        "desc": "Howmet Aerospace Inc. (formerly Arconic Inc.)[3][4] is an American aerospace company based in Pittsburgh, Pennsylvania. The company manufactures components for jet engines, fasteners and titanium structures for aerospace applications, and forged aluminum wheels for heavy trucks.[5]"
    },
    {
        "ticker": "HPQ",
        "name": "HP Inc.",
        "url": "https://en.wikipedia.org/wiki/HP_Inc.",
        "desc": "HP Inc. is an American multinational information technology company headquartered in Palo Alto, California, that develops personal computers (PCs), printers and related supplies, as well as 3D printing solutions. It was formed on November 1, 2015, as the legal successor of the original Hewlett-Packard after the company's enterprise product and business services divisions were spun off as a new publicly traded company, Hewlett Packard Enterprise.[2]"
    },
    {
        "ticker": "HUM",
        "name": "Humana",
        "url": "https://en.wikipedia.org/wiki/Humana",
        "desc": "Humana Inc. is a for-profit American health insurance company based in Louisville, Kentucky. In 2023, the company ranked 42 on the Fortune 500 list,[2] which made it the highest ranked (by revenues) company based in Kentucky. It is the fourth largest health insurance provider in the U.S.[3]"
    },
    {
        "ticker": "HBAN",
        "name": "Huntington Bancshares",
        "url": "https://en.wikipedia.org/wiki/Huntington_Bancshares",
        "desc": "Huntington Bancshares Incorporated is an American bank holding company headquartered in Columbus, Ohio. The company is ranked 521st on the Fortune 500,[6] and is 26th on the list of largest banks in the United States."
    },
    {
        "ticker": "HII",
        "name": "Huntington Ingalls Industries",
        "url": "https://en.wikipedia.org/wiki/Huntington_Ingalls_Industries",
        "desc": "Huntington Ingalls Industries, Inc. (HII) is the largest military shipbuilding company in the United States as well as a provider of professional services to partners in government and industry. HII, ranked No. 375 on the Fortune 500, was formed on 31 March 2011, as a divestiture from Northrop Grumman.[5][6]"
    },
    {
        "ticker": "IBM",
        "name": "IBM",
        "url": "https://en.wikipedia.org/wiki/IBM",
        "desc": "The International Business Machines Corporation (doing business as IBM), nicknamed Big Blue,[6] is an American multinational technology corporation headquartered in Armonk, New York and is present in over 175 countries.[7][8] It specializes in computer hardware, middleware, and software, and provides hosting and consulting services in areas ranging from mainframe computers to nanotechnology. IBM is the largest industrial research organization in the world, with 19 research facilities across a dozen countries, and has held the record for most annual U.S. patents generated by a business for 29 consecutive years from 1993 to 2021.[9][10][11]"
    },
    {
        "ticker": "IEX",
        "name": "IDEX Corporation",
        "url": "https://en.wikipedia.org/wiki/IDEX_Corporation",
        "desc": "IDEX Corporation, based in Northbrook, Illinois, is a publicly traded company engaged in the development, design, and manufacture of fluidics systems, optics systems, fire and rescue equipment, and other specialty engineered products."
    },
    {
        "ticker": "IDXX",
        "name": "Idexx Laboratories",
        "url": "https://en.wikipedia.org/wiki/Idexx_Laboratories",
        "desc": "IDEXX Laboratories, Inc. is an American multinational corporation[4][5] engaged in the development, manufacture, and distribution of products and services for the companion animal veterinary, livestock and poultry, water testing, and dairy markets. Incorporated in 1983 by David Evans Shaw, the company is headquartered in Westbrook, Maine, and in Hoofddorp, Netherlands for its EMEA divisions.[6]"
    },
    {
        "ticker": "ITW",
        "name": "Illinois Tool Works",
        "url": "https://en.wikipedia.org/wiki/Illinois_Tool_Works",
        "desc": "Illinois Tool Works Inc. or ITW is an American Fortune 200[3] company that produces engineered fasteners and components, equipment and consumable systems, and specialty products. It was founded in 1912 by Byron L. Smith and has built its growth on a \"small-wins strategy\" based on decentralization, simplicity, customer-focused innovation, and acquisitions.[4]"
    },
    {
        "ticker": "ILMN",
        "name": "Illumina",
        "url": "https://en.wikipedia.org/wiki/Illumina,_Inc.",
        "desc": "Illumina, Inc. is an American biotechnology company, headquartered in San Diego, California, and it serves more than 140 countries.[2] Incorporated on April 1, 1998, Illumina develops, manufactures, and markets integrated systems for the analysis of genetic variation and biological function. The company provides a line of products and services that serves the sequencing, genotyping and gene expression, and proteomics markets."
    },
    {
        "ticker": "INCY",
        "name": "Incyte",
        "url": "https://en.wikipedia.org/wiki/Incyte",
        "desc": "Incyte is an American multinational pharmaceutical company with headquarters in Wilmington, Delaware,[2] and Morges, Switzerland.[3] The company was created in 2002 through the merger of Incyte Pharmaceuticals, founded in Palo Alto, California in 1991[4] and Incyte Genomics, Inc. of Delaware.[5] The company currently operates manufacturing and R&D locations in North America, Europe, and Asia.[6]"
    },
    {
        "ticker": "IR",
        "name": "Ingersoll Rand",
        "url": "https://en.wikipedia.org/wiki/Ingersoll_Rand",
        "desc": "Ingersoll Rand is an American multinational company that provides flow creation and industrial products. The company was formed in February 2020 through the spinoff of the industrial segment of Ingersoll-Rand plc (now known as Trane Technologies) and its merger with Gardner Denver. Its products are sold under more than 40 brands across all major global markets."
    },
    {
        "ticker": "PODD",
        "name": "Insulet",
        "url": "https://en.wikipedia.org/w/index.php?title=Insulet&action=edit&redlink=1",
        "desc": "Other reasons this message may be displayed:"
    },
    {
        "ticker": "INTC",
        "name": "Intel",
        "url": "https://en.wikipedia.org/wiki/Intel",
        "desc": "Intel Corporation (commonly known as Intel) is an American multinational corporation and technology company headquartered in Santa Clara, California. It is one of the world's largest semiconductor chip manufacturer by revenue,[3][4] and is one of the developers of the x86 series of instruction sets found in most personal computers (PCs). Incorporated in Delaware,[5] Intel ranked No. 45 in the 2020 Fortune 500 list of the largest United States corporations by total revenue for nearly a decade, from 2007 to 2016 fiscal years.[6]"
    },
    {
        "ticker": "ICE",
        "name": "Intercontinental Exchange",
        "url": "https://en.wikipedia.org/wiki/Intercontinental_Exchange",
        "desc": "Intercontinental Exchange, Inc. (ICE) is an American company formed in 2000 that operates global financial exchanges and clearing houses and provides mortgage technology, data and listing services. Listed on the Fortune 500, S&P 500, and Russell 1000, the company owns exchanges for financial and commodity markets, and operates 12 regulated exchanges and marketplaces. This includes ICE futures exchanges in the United States, Canada and Europe, the Liffe futures exchanges in Europe, the New York Stock Exchange, equity options exchanges and OTC energy, credit and equity markets."
    },
    {
        "ticker": "IFF",
        "name": "International Flavors & Fragrances",
        "url": "https://en.wikipedia.org/wiki/International_Flavors_%26_Fragrances",
        "desc": "International Flavors & Fragrances is an American corporation that produces flavors, fragrances, and cosmetic actives, which it markets globally. It is headquartered in New York City and has creative, sales, and manufacturing facilities in 44 different countries. The company is a member of the S&P 500 Index."
    },
    {
        "ticker": "IP",
        "name": "International Paper",
        "url": "https://en.wikipedia.org/wiki/International_Paper",
        "desc": "The International Paper Company is an American pulp and paper company, the largest such company in the world.[7] It has approximately 56,000 employees,[8] and is headquartered in Memphis, Tennessee.[9][10]"
    },
    {
        "ticker": "IPG",
        "name": "Interpublic Group of Companies (The)",
        "url": "https://en.wikipedia.org/wiki/The_Interpublic_Group_of_Companies",
        "desc": "The Interpublic Group of Companies, Inc. (IPG) is an American publicly traded advertising company. The company consists of five major networks: FCB, IPG Mediabrands, McCann Worldgroup, MullenLowe Group, and Marketing Specialists, as well as several independent specialty agencies in the areas of public relations, sports marketing, talent representation, and healthcare.[3] It is one of the \"Big Four\" agency companies, alongside WPP, Publicis and Omnicom.[4] Phillippe Krakowsky became the company's CEO on January 1, 2021.[1]"
    },
    {
        "ticker": "INTU",
        "name": "Intuit",
        "url": "https://en.wikipedia.org/wiki/Intuit",
        "desc": "Intuit Inc. is an American business software company that specializes in financial software. The company is headquartered in Mountain View, California, and the CEO is Sasan Goodarzi. Intuit's products include the tax preparation application TurboTax, personal finance app Mint, the small business accounting program QuickBooks, the credit monitoring service Credit Karma,[2] and email marketing platform Mailchimp.[3] As of 2019, more than 95% of its revenues and earnings come from its activities within the United States.[4]"
    },
    {
        "ticker": "ISRG",
        "name": "Intuitive Surgical",
        "url": "https://en.wikipedia.org/wiki/Intuitive_Surgical",
        "desc": "Intuitive Surgical, Inc. is an American corporation that develops, manufactures, and markets robotic products designed to improve clinical outcomes of patients through minimally invasive surgery, most notably with the da Vinci Surgical System. The company is part of the NASDAQ-100 and S&P 500. As of 31 December 2021, Intuitive Surgical had an installed base of 6,730 da Vinci Surgical Systems, including 4,139 in the U.S., 1,199 in Europe, 1,050 in Asia, and 342 in the rest of the world.[2]"
    },
    {
        "ticker": "IVZ",
        "name": "Invesco",
        "url": "https://en.wikipedia.org/wiki/Invesco",
        "desc": "Invesco Ltd. is an American independent investment management company that is headquartered in Atlanta, Georgia, with additional branch offices in 20 countries. Its common stock is a constituent of the S&P 500 and trades on the New York stock exchange.[3] Invesco operates under the Invesco, Trimark, Invesco Perpetual, WL Ross & Co and Powershares brand names."
    },
    {
        "ticker": "INVH",
        "name": "Invitation Homes",
        "url": "https://en.wikipedia.org/wiki/Invitation_Homes",
        "desc": "Invitation Homes Inc. is a public company traded on the New York Stock Exchange. It is headquartered in the Comerica Bank Tower in Dallas, Texas.[2] Dallas B. Tanner serves as chief executive officer. As of 2017, the company was reportedly the largest owner of single-family rental homes in the United States.[2] As of December 2022, the company owned about 83,000 rental homes in 16 markets.[3]"
    },
    {
        "ticker": "IQV",
        "name": "IQVIA",
        "url": "https://en.wikipedia.org/wiki/IQVIA",
        "desc": "IQVIA, formerly Quintiles and IMS Health, Inc.,[2] is an American multinational company serving the combined industries of health information technology and clinical research. IQVIA is a provider of biopharmaceutical development, consulting and commercial outsourcing services, focused primarily on Phase I-IV clinical trials and associated laboratory and analytical services, including strategy and management consulting services. It has a network of more than 88,000 employees in more than 100 countries and a market capitalization of $49 Billion as of August 2021.[2] As of 2017, IQVIA was reported to be one of the world's largest contract research organizations.[3]"
    },
    {
        "ticker": "IRM",
        "name": "Iron Mountain",
        "url": "https://en.wikipedia.org/wiki/Iron_Mountain_(company)",
        "desc": "Iron Mountain Inc. (NYSE: IRM) is an American enterprise information management services company founded in 1951 and headquartered in Boston, Massachusetts. Its records management, information destruction, and data backup and recovery services are supplied to more than 220,000 customers[4] in 58 countries throughout North America, Europe, Latin America, Africa, Asia, and Australia. As of 2020 over 94% of Fortune 1000 companies use Iron Mountain's services to store and manage their information in some capacity.[5]"
    },
    {
        "ticker": "JBHT",
        "name": "J.B. Hunt",
        "url": "https://en.wikipedia.org/wiki/J.B._Hunt",
        "desc": "J.B. Hunt Transport Services, Inc. is an American transportation and logistics company based in Lowell, Arkansas. It was founded by Johnnie Bryan Hunt and Johnelle Hunt in Arkansas on August 10, 1961. By 1983, J.B. Hunt had grown into the 80th largest trucking firm in the U.S. and earned $623.47 million in revenue. At that time J.B. Hunt was operating 550 tractors, 1,049 trailers, and had roughly 1,050 employees.[3] J.B. Hunt primarily operates large semi-trailer trucks and provides transportation services throughout the continental U.S., Canada and Mexico. The company currently employs over 24,000 and operates more than 12,000 trucks. The company's fleet consists of over 145,000 trailers and containers. [4]"
    },
    {
        "ticker": "JKHY",
        "name": "Jack Henry & Associates",
        "url": "https://en.wikipedia.org/wiki/Jack_Henry_%26_Associates",
        "desc": "Jack Henry & Associates, Inc. is an American technology company and payment processing service for the financial services industry. It serves more than 9,000 customers nationwide, and operates through three primary brands.[2] Headquartered in Monett, Missouri, JHA made $1.55 billion in annual revenue during fiscal 2019.[3]"
    },
    {
        "ticker": "J",
        "name": "Jacobs Solutions",
        "url": "https://en.wikipedia.org/wiki/Jacobs_Solutions",
        "desc": "Jacobs Solutions Inc. is an American international technical professional services firm.[5] The company provides engineering, technical, professional and construction services, as well as scientific and specialty consulting for a broad range of clients globally, including companies, organizations, and government agencies.[6] Jacobs has consistently ranked No. 1 on both Engineering News-Record (ENR)'s 2018, 2019, 2020 and 2021 Top 500 Design Firms[7] and Trenchless Technology’s 2018, 2019, 2020 and 2021 Top 50 Trenchless Engineering Firms.[8] Its worldwide annual revenue reached over $14 billion in the 2021 fiscal year, and earnings rose to $477 million.[4]: F-4"
    },
    {
        "ticker": "JNJ",
        "name": "Johnson & Johnson",
        "url": "https://en.wikipedia.org/wiki/Johnson_%26_Johnson",
        "desc": "Johnson & Johnson (J&J) is an American multinational, pharmaceutical, and medical technologies corporation headquartered in New Brunswick, New Jersey, and publicly traded on the New York Stock Exchange. Its common stock is a component of the Dow Jones Industrial Average, and the company is ranked No. 40 on the 2023 Fortune 500 list of the largest United States corporations. Johnson & Johnson has a global workforce of approximately 130,000 employees who are led by the company’s current chairman and chief executive officer, Joaquin Duato."
    },
    {
        "ticker": "JCI",
        "name": "Johnson Controls",
        "url": "https://en.wikipedia.org/wiki/Johnson_Controls",
        "desc": "Johnson Controls International is an American, Irish-domiciled multinational conglomerate headquartered in Cork, Ireland,[3] that produces fire, HVAC, and security equipment for buildings. As of mid-2019, it employed 105,000 people in around 2,000 locations across six continents.[4] In 2017 it was listed as 389th in the Fortune Global 500.[5] It became ineligible for the Fortune 500 in subsequent years since it relocated its headquarters outside the U.S.[6]"
    },
    {
        "ticker": "JPM",
        "name": "JPMorgan Chase",
        "url": "https://en.wikipedia.org/wiki/JPMorgan_Chase",
        "desc": "JPMorgan Chase & Co. is an American multinational financial services firm headquartered in New York City and incorporated in Delaware. It is the largest bank in the United States and the world's largest bank by market capitalization as of 2023.[4][5] As the largest of Big Four banks, the firm is considered systemically important by the Financial Stability Board. Its size and scale have often led to enhanced regulatory oversight as well as the maintenance of an internal \"Fortress Balance Sheet\"[6][7] of capital reserves. The firm is headquartered at 383 Madison Avenue in Midtown Manhattan and is set to move into the under-construction JPMorgan Chase Building at 270 Park Avenue in 2025."
    },
    {
        "ticker": "JNPR",
        "name": "Juniper Networks",
        "url": "https://en.wikipedia.org/wiki/Juniper_Networks",
        "desc": "Juniper Networks, Inc. is an American multinational corporation headquartered in Sunnyvale, California. The company develops and markets networking products, including routers, switches, network management software, network security products, and software-defined networking technology."
    },
    {
        "ticker": "K",
        "name": "Kellogg's",
        "url": "https://en.wikipedia.org/wiki/Kellogg%27s",
        "desc": "Kellanova (formerly known as the Kellogg Company) is an American multinational food manufacturing company headquartered in Chicago, Illinois, United States. Kellogg's produces cereal and convenience foods, including crackers and toaster pastries, and markets their products by several well-known brands including the Kellogg's brand itself, Rice Krispies Treats, Pringles, Eggo, and Cheez-It, along with cereal internationally such as Corn Flakes, Rice Krispies, Frosties and Coco Pops. Kellogg's mission statement is \"Nourishing families so they can flourish and thrive.\"[3]"
    },
    {
        "ticker": "KVUE",
        "name": "Kenvue",
        "url": "https://en.wikipedia.org/wiki/Kenvue",
        "desc": "Kenvue Inc. is an American consumer health company. Formerly the Consumer Healthcare division of Johnson & Johnson,[2][3] Kenvue is the proprietor of well-known brands such as Aveeno, Band-Aid, Benadryl, Johnson's Baby, Listerine, Mylanta, Neutrogena, Tylenol, and Visine."
    },
    {
        "ticker": "KDP",
        "name": "Keurig Dr Pepper",
        "url": "https://en.wikipedia.org/wiki/Keurig_Dr_Pepper",
        "desc": "Keurig Dr Pepper Inc., formerly Green Mountain Coffee Roasters (1981–2014) and Keurig Green Mountain (2014–2018), is a publicly traded American beverage and coffeemaker conglomerate with headquarters in Burlington, Massachusetts and Frisco, Texas.[5] Formed in July 2018, with the merger of Keurig Green Mountain and Dr Pepper Snapple Group (formerly Dr. Pepper/7up Inc.), Keurig Dr Pepper offers over 125 hot and cold beverages. The company's Canadian business unit subsidiary operates as Keurig Dr Pepper Canada (formerly Canada Dry Motts)."
    },
    {
        "ticker": "KEY",
        "name": "KeyCorp",
        "url": "https://en.wikipedia.org/wiki/KeyBank",
        "desc": "KeyBank, the primary subsidiary of KeyCorp, is an American regional bank headquartered in Cleveland, Ohio, and is the only major bank based in Cleveland. KeyBank is one of the largest banks in the United States.[3]"
    },
    {
        "ticker": "KEYS",
        "name": "Keysight",
        "url": "https://en.wikipedia.org/wiki/Keysight",
        "desc": "Keysight Technologies, or Keysight, is an American company that manufactures electronics test and measurement equipment and software. The name is a blend of key and insight.[2][4] The company was formed as a spin-off of Agilent Technologies, which inherited and rebranded the test and measurement product lines developed and produced from the late 1960s to the turn of the millennium by Hewlett-Packard's Test & Measurement division."
    },
    {
        "ticker": "KMB",
        "name": "Kimberly-Clark",
        "url": "https://en.wikipedia.org/wiki/Kimberly-Clark",
        "desc": "Kimberly-Clark Corporation is an American multinational personal care corporation that produces mostly paper-based consumer products. The company manufactures sanitary paper products and surgical & medical instruments. Kimberly-Clark brand name products include Kleenex facial tissue, Kotex feminine hygiene products, Cottonelle, Scott and Andrex toilet paper, Wypall utility wipes, KimWipes scientific cleaning wipes and Huggies disposable diapers and baby wipes."
    },
    {
        "ticker": "KIM",
        "name": "Kimco Realty",
        "url": "https://en.wikipedia.org/wiki/Kimco_Realty",
        "desc": "Kimco Realty Corporation is a real estate investment trust that invests in shopping centers. As of March 31, 2022, the company owned interests in 537 U.S. shopping centers and mixed-use assets comprising 93 million square feet of gross leasable space.[1]"
    },
    {
        "ticker": "KMI",
        "name": "Kinder Morgan",
        "url": "https://en.wikipedia.org/wiki/Kinder_Morgan",
        "desc": "Kinder Morgan, Inc. is one of the largest energy infrastructure companies in North America.[2] The company specializes in owning and controlling oil and gas pipelines and terminals.[3]"
    },
    {
        "ticker": "KLAC",
        "name": "KLA Corporation",
        "url": "https://en.wikipedia.org/wiki/KLA_Corporation",
        "desc": "KLA Corporation is an American capital equipment company based in Milpitas, California. It supplies process control and yield management systems for the semiconductor industry and other related nanoelectronics industries. The company's products and services are intended for all phases of wafer, reticle, integrated circuit (IC) and packaging production, from research and development to final volume manufacturing.[2]"
    },
    {
        "ticker": "KHC",
        "name": "Kraft Heinz",
        "url": "https://en.wikipedia.org/wiki/Kraft_Heinz",
        "desc": "The Kraft Heinz Company (KHC), commonly known as Kraft Heinz (/ˈkræft ˈhaɪnz/), is an American multinational food company formed by the merger of Kraft Foods and H.J. Heinz Company co-headquartered in Chicago and Pittsburgh.[5][6] Kraft Heinz is the third-largest food and beverage company in North America and the fifth-largest in the world with over $26.0 billion in annual sales as of 2021.[7][8]"
    },
    {
        "ticker": "KR",
        "name": "Kroger",
        "url": "https://en.wikipedia.org/wiki/Kroger",
        "desc": "The Kroger Company, or simply Kroger, is an American retail company that operates (either directly or through its subsidiaries[5]) supermarkets and multi-department stores throughout the United States.[1][6]"
    },
    {
        "ticker": "LHX",
        "name": "L3Harris",
        "url": "https://en.wikipedia.org/wiki/L3Harris",
        "desc": "L3Harris Technologies, Inc. is an American technology company, defense contractor, and information technology services provider that produces command and control systems and products, wireless equipment, tactical radios, avionics and electronic systems, night vision equipment, and both terrestrial and spaceborne antennas for use in the government, defense, and commercial sectors. They specialize in surveillance solutions,[3] microwave weaponry,[4] and electronic warfare.[5] It was formed from the merger of L3 Technologies (formerly L-3 Communications) and Harris Corporation on June 29, 2019,[6] and was expected to be the sixth-largest defense contractor in the United States.[7][8][9]"
    },
    {
        "ticker": "LH",
        "name": "LabCorp",
        "url": "https://en.wikipedia.org/wiki/LabCorp",
        "desc": "Laboratory Corporation of America Holdings, more commonly known as Labcorp, is an American healthcare company headquartered in Burlington, North Carolina. It operates one of the largest clinical laboratory networks in the world, with a United States network of 36 primary laboratories. Before a merger with National Health Laboratory in 1995, the company operated under the name Roche BioMedical. Labcorp performs its largest volume of specialty testing at its Center for Esoteric Testing in Burlington, North Carolina, where the company is headquartered.[2][3] As of 2018, Labcorp processes 2.5 million lab tests weekly.[4]"
    },
    {
        "ticker": "LRCX",
        "name": "Lam Research",
        "url": "https://en.wikipedia.org/wiki/Lam_Research",
        "desc": "Lam Research Corporation is an American supplier of wafer-fabrication equipment and related services to the semiconductor industry.[2] Its products are used primarily in front-end wafer processing, which involves the steps that create the active components of semiconductor devices (transistors, capacitors) and their wiring (interconnects). The company also builds equipment for back-end wafer-level packaging (WLP) and for related manufacturing markets such as for microelectromechanical systems (MEMS)."
    },
    {
        "ticker": "LW",
        "name": "Lamb Weston",
        "url": "https://en.wikipedia.org/wiki/Lamb_Weston",
        "desc": "Lamb Weston Holdings, Inc., is an American food processing company that is one of the world's largest producers and processors of frozen french fries, waffle fries, and other frozen potato products.[2][3][4] It is headquartered in Eagle, Idaho, a suburb of Boise.[5]"
    },
    {
        "ticker": "LVS",
        "name": "Las Vegas Sands",
        "url": "https://en.wikipedia.org/wiki/Las_Vegas_Sands",
        "desc": "Las Vegas Sands Corporation is an American casino and resort company with corporate headquarters in Paradise, Nevada, United States. Its corporate mission is to create \"Integrated Resorts\" which feature a combination of gambling, accommodation, retail, and meeting space."
    },
    {
        "ticker": "LDOS",
        "name": "Leidos",
        "url": "https://en.wikipedia.org/wiki/Leidos",
        "desc": "Leidos, formerly known as Science Applications International Corporation (SAIC),[6] is an American defense, aviation, information technology, and biomedical research company headquartered in Reston, Virginia, that provides scientific, engineering, systems integration, and technical services. Leidos merged with Lockheed Martin's IT sector, Information Systems & Global Solutions (Lockheed Martin IS&GS), in August 2016 to create the defense industry’s largest IT services provider. The Leidos-Lockheed Martin merger is one of the biggest transactions thus far in the consolidation of the defense sector. Leidos contracts extensively with the Department of Defense, the Department of Homeland Security, and the Intelligence Community, as well as other U.S. government agencies and select commercial markets."
    },
    {
        "ticker": "LEN",
        "name": "Lennar",
        "url": "https://en.wikipedia.org/wiki/Lennar",
        "desc": "Lennar Corporation is a home construction company based in the census-designated place of Fontainebleau, Florida, with a Miami postal address.[1] In 2021, the company was the second-largest home construction company in the United States based on the number of homes sold.[2] In 2021, the company was ranked 129th on the Fortune 500.[3] The company operates in Florida, Arizona, California, Colorado, Delaware, Georgia, Idaho, Illinois, Indiana, Maryland, Minnesota, Nevada, New Jersey, North Carolina, Oregon, Pennsylvania, South Carolina, Tennessee, Texas, Utah, Virginia, Washington, West Virginia, and Wisconsin. It also has investments in multifamily and single family residential rental properties and investments in property technology companies. The name Lennar is a portmanteau of the first names of two of the company's founders, Leonard Miller and Arnold Rosen.[4]"
    },
    {
        "ticker": "LIN",
        "name": "Linde plc",
        "url": "https://en.wikipedia.org/wiki/Linde_plc",
        "desc": "Linde plc is a global multinational chemical company founded in Germany and, since 2018, domiciled in Ireland and headquartered in the United Kingdom. Linde is the world's largest industrial gas company by market share and revenue. It serves customers in the healthcare, petroleum refining, manufacturing, food, beverage carbonation, fiber-optics, steel making, aerospace, material handling equipment (MHE), chemicals, electronics and water treatment industries.[1] The company's primary business is the manufacturing and distribution of atmospheric gases, including oxygen, nitrogen, argon, rare gases, and process gases, including carbon dioxide, helium, hydrogen, ammonia, electronic gases, specialty gases, and acetylene.[1]"
    },
    {
        "ticker": "LYV",
        "name": "Live Nation Entertainment",
        "url": "https://en.wikipedia.org/wiki/Live_Nation_Entertainment",
        "desc": "Live Nation Entertainment is an American multinational entertainment company that was founded in 2010 following the merger of Live Nation and Ticketmaster. The company promotes, operates, and manages ticket sales for live entertainment in the United States and internationally. It also owns and operates entertainment venues and manages the careers of music artists."
    },
    {
        "ticker": "LKQ",
        "name": "LKQ Corporation",
        "url": "https://en.wikipedia.org/wiki/LKQ_Corporation",
        "desc": "LKQ Corporation (“Leadership, Know-how, and Quality”) is an American provider of alternative and speciality parts to repair and accessorize automobiles and other vehicles. LKQ has operations in North America, Europe and Taiwan. LKQ sells replacement systems, components, equipment and parts to repair and accessorize automobiles, trucks, and recreational and performance vehicles.[2]"
    },
    {
        "ticker": "LMT",
        "name": "Lockheed Martin",
        "url": "https://en.wikipedia.org/wiki/Lockheed_Martin",
        "desc": "The Lockheed Martin Corporation is an American aerospace, arms, defense, information security, and technology corporation with worldwide interests. It was formed by the merger of Lockheed Corporation with Martin Marietta in March 1995. It is headquartered in North Bethesda, Maryland, in the Washington, D.C. area. As of January 2022, Lockheed Martin employs approximately 115,000 employees worldwide, including about 60,000 engineers and scientists.[3]"
    },
    {
        "ticker": "L",
        "name": "Loews Corporation",
        "url": "https://en.wikipedia.org/wiki/Loews_Corporation",
        "desc": "Loews Corporation is an American conglomerate headquartered in New York City. The company's majority-stake holdings include CNA Financial Corporation, Boardwalk Pipeline Partners, Loews Hotels and Altium Packaging."
    },
    {
        "ticker": "LOW",
        "name": "Lowe's",
        "url": "https://en.wikipedia.org/wiki/Lowe%27s",
        "desc": "Lowe's Companies, Inc. (/loʊz/) is an American retail company specializing in home improvement.[4] Headquartered in Mooresville, North Carolina, the company operates a chain of retail stores in the United States. As of Oct. 28, 2022, Lowe's and its related businesses operated 2,181 home improvement and hardware stores in North America.[2]"
    },
    {
        "ticker": "LYB",
        "name": "LyondellBasell",
        "url": "https://en.wikipedia.org/wiki/LyondellBasell",
        "desc": "LyondellBasell Industries N.V. is a multinational chemical company incorporated in the Netherlands with U.S. operations headquartered in Houston, Texas, and offices in London, UK. The company is the largest licensor of polyethylene and polypropylene technologies.[3] It also produces ethylene, propylene, polyolefins, and oxyfuels.[4][5]"
    },
    {
        "ticker": "MTB",
        "name": "M&T Bank",
        "url": "https://en.wikipedia.org/wiki/M%26T_Bank",
        "desc": "M&T Bank Corporation (Manufacturers and Traders Trust Company) is an American bank holding company headquartered in Buffalo, New York.[2] It operates 1,000+ branches in 12 states across the Eastern United States, from Maine to Southern Virginia.[1][3] Until May 1998, the bank's holding company was named First Empire State Corporation.[4]"
    },
    {
        "ticker": "MRO",
        "name": "Marathon Oil",
        "url": "https://en.wikipedia.org/wiki/Marathon_Oil",
        "desc": "Marathon Oil Corporation is an American company engaged in hydrocarbon exploration incorporated in Ohio and headquartered in the Marathon Oil Tower in Houston, Texas.[1] A direct descendant of Standard Oil, it also runs international gas operations focused on Equatorial Guinea, offshore Central Africa."
    },
    {
        "ticker": "MPC",
        "name": "Marathon Petroleum",
        "url": "https://en.wikipedia.org/wiki/Marathon_Petroleum",
        "desc": "Marathon Petroleum Corporation is an American petroleum refining, marketing, and transportation company headquartered in Findlay, Ohio. The company was a wholly owned subsidiary of Marathon Oil until a corporate spin-off in 2011."
    },
    {
        "ticker": "MKTX",
        "name": "MarketAxess",
        "url": "https://en.wikipedia.org/wiki/MarketAxess",
        "desc": "MarketAxess Holdings Inc. (MarketAxess) is an international financial technology company that operates an electronic trading platform for the institutional credit markets,[2] and also provides market data and post-trade services.[3] It enables institutional investors and broker-dealers to trade credit instruments, including corporate bonds, and other types of fixed income products.[4]"
    },
    {
        "ticker": "MAR",
        "name": "Marriott International",
        "url": "https://en.wikipedia.org/wiki/Marriott_International",
        "desc": "Marriott International, Inc. is an American multinational company that operates, franchises, and licenses lodging including hotel, residential and timeshare properties.[1] It is headquartered in Bethesda, Maryland. The company was founded by J. Willard Marriott (1900–1985) and his wife Alice Marriott (1907–2000)."
    },
    {
        "ticker": "MMC",
        "name": "Marsh McLennan",
        "url": "https://en.wikipedia.org/wiki/Marsh_McLennan",
        "desc": "Marsh & McLennan Companies, Inc., doing business as Marsh McLennan, is a global professional services firm, headquartered in New York City with businesses in insurance brokerage, risk management, reinsurance services, talent management, investment advisory, and management consulting.[3] Its four main operating companies are Marsh, Guy Carpenter, Mercer, and Oliver Wyman.[4]"
    },
    {
        "ticker": "MLM",
        "name": "Martin Marietta Materials",
        "url": "https://en.wikipedia.org/wiki/Martin_Marietta_Materials",
        "desc": "Martin Marietta Materials, Inc. is an American company and a member of the S&P 500 Index. The company is a supplier of aggregates and heavy building materials, with operations spanning 26 states, Canada and the Caribbean. In particular, Martin Marietta Materials supplies resources for the construction of roads, sidewalks and foundations."
    },
    {
        "ticker": "MAS",
        "name": "Masco",
        "url": "https://en.wikipedia.org/wiki/Masco",
        "desc": "Masco Corporation is an American manufacturer of products for the home improvement and new home construction markets. Comprising more than 20 companies, the Masco conglomerate operates nearly 60 manufacturing facilities in the United States and over 20 in other parts of the world. Since 1969 it trades on the NYSE.[3] Under the leadership of Richard Manoogian, the company grew exponentially and subsequently joined the Fortune 500 list of largest U.S. corporations.[3]"
    },
    {
        "ticker": "MA",
        "name": "Mastercard",
        "url": "https://en.wikipedia.org/wiki/Mastercard",
        "desc": "Mastercard Inc. (stylized as MasterCard from 1979 to 2016, mastercard from 2016 to 2019) is the second-largest payment-processing corporation worldwide. It offers a range of payment transaction processing and other related-payment services (such as travel-related payments and bookings). Its headquarters are in Purchase, New York.[3] Throughout the world, its principal business is to process payments between the banks of merchants and the card-issuing banks or credit unions of the purchasers who use the Mastercard-brand debit, credit and prepaid cards to make purchases. Mastercard has been publicly traded since 2006."
    },
    {
        "ticker": "MTCH",
        "name": "Match Group",
        "url": "https://en.wikipedia.org/wiki/Match_Group",
        "desc": "Match Group is an American internet and technology company headquartered in Dallas, Texas.[1] It owns and operates the largest global portfolio of popular online dating services including Tinder, Match.com, Meetic, OkCupid, Hinge, Plenty of Fish, OurTime, and other dating global brands.[2] The company was owned by IAC until July 2020 when Match Group was spun off as a separate, public company. As of 2019, the company had 9.3 million subscribers, of which 4.6 million were in North America.[3] Japan is the company's second largest market, after the United States.[4]"
    },
    {
        "ticker": "MKC",
        "name": "McCormick & Company",
        "url": "https://en.wikipedia.org/wiki/McCormick_%26_Company",
        "desc": "McCormick & Company, Incorporated is an American food company that manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavoring products to retail outlets, food manufacturers, and foodservice businesses."
    },
    {
        "ticker": "MCD",
        "name": "McDonald's",
        "url": "https://en.wikipedia.org/wiki/McDonald%27s",
        "desc": "McDonald's Corporation is an American multinational fast food chain, founded in 1940 as a restaurant operated by Richard and Maurice McDonald, in San Bernardino, California, United States. They rechristened their business as a hamburger stand, and later turned the company into a franchise, with the Golden Arches logo being introduced in 1953 at a location in Phoenix, Arizona. In 1955, Ray Kroc, a businessman, joined the company as a franchise agent and proceeded to purchase the chain from the McDonald brothers. McDonald's previous headquarters was based in Oak Brook, Illinois, but the company moved its global headquarters to Chicago in June 2018.[9][10][11][12] McDonald's is also a real estate company through its ownership of around 70% of restaurant buildings and 45% of the underlying land (which it leases to its franchisees).[13][14]"
    },
    {
        "ticker": "MCK",
        "name": "McKesson",
        "url": "https://en.wikipedia.org/wiki/McKesson",
        "desc": "McKesson Corporation is an American company distributing pharmaceuticals and providing health information technology, medical supplies, and care management tools. The company delivers a third of all pharmaceuticals used in North America and employs over 78,000 employees.[2] McKesson had revenues of $238.2 billion in its fiscal year ending March 31, 2021.[3]"
    },
    {
        "ticker": "MDT",
        "name": "Medtronic",
        "url": "https://en.wikipedia.org/wiki/Medtronic",
        "desc": "Medtronic plc is an American medical device company. The company's operational and executive headquarters are in Minneapolis, Minnesota, and its legal headquarters are in Ireland due to its acquisition of Irish-based Covidien in 2015.[3][4] While it primarily operates in the United States,[5][6] it operates in more than 150 countries and employs over 90,000 people.[7] It develops and manufactures healthcare technologies and therapies."
    },
    {
        "ticker": "MRK",
        "name": "Merck & Co.",
        "url": "https://en.wikipedia.org/wiki/Merck_%26_Co.",
        "desc": "Merck & Co., Inc. is an American multinational pharmaceutical company headquartered in Rahway, New Jersey, and is named for Merck Group, founded in Germany in 1668, of whom it was once the American arm. The company does business as Merck Sharp & Dohme or MSD outside the United States and Canada. It is one of the largest pharmaceutical companies in the world, generally ranking in the global top five by revenue.[5][6]"
    },
    {
        "ticker": "META",
        "name": "Meta Platforms",
        "url": "https://en.wikipedia.org/wiki/Meta_Platforms",
        "desc": "Meta Platforms, Inc.,[15][16] doing business as Meta,[17][18] and formerly named Facebook, Inc., and TheFacebook, Inc.,[19] is an American multinational technology conglomerate based in Menlo Park, California. The company owns and operates Facebook, Instagram, Threads, and WhatsApp, among other products and services.[20] Meta is one of the world's most valuable companies and among the ten largest publicly traded corporations in the United States.[21] It is considered one of the Big Five American information technology companies, alongside Google's parent company Alphabet, Amazon, Apple, and Microsoft."
    },
    {
        "ticker": "MET",
        "name": "MetLife",
        "url": "https://en.wikipedia.org/wiki/MetLife",
        "desc": "MetLife, Inc. is the holding corporation for the Metropolitan Life Insurance Company (MLIC),[3] better known as MetLife, and its affiliates. MetLife is among the largest global providers of insurance, annuities, and employee benefit programs, with 90 million customers in over 60 countries.[4][5] The firm was founded on March 24, 1868.[6] MetLife ranked No. 43 in the 2018 Fortune 500 list of the largest United States corporations by total revenue.[7]"
    },
    {
        "ticker": "MTD",
        "name": "Mettler Toledo",
        "url": "https://en.wikipedia.org/wiki/Mettler_Toledo",
        "desc": "Mettler Toledo (NYSE: MTD) is a multinational manufacturer of scales and analytical instruments. It is the largest provider of weighing instruments for use in laboratory, industrial, and food retailing applications. The company also provides various analytical instruments, process analytics instruments, and end-of-line inspection systems. The company operates worldwide with 70% of net sales, derived in equal parts, from Europe and from the Americas. Asian business is included in the remaining 30%.[2] Mettler Toledo is headquartered in Switzerland and incorporated in the United States.[4]"
    },
    {
        "ticker": "MGM",
        "name": "MGM Resorts",
        "url": "https://en.wikipedia.org/wiki/MGM_Resorts",
        "desc": "MGM Resorts International is an American global hospitality and entertainment company operating destination resorts in Las Vegas, Massachusetts, Michigan, Mississippi, Maryland, Ohio, and New Jersey, including Bellagio, Mandalay Bay, MGM Grand, and Park MGM."
    },
    {
        "ticker": "MCHP",
        "name": "Microchip Technology",
        "url": "https://en.wikipedia.org/wiki/Microchip_Technology",
        "desc": "Microchip Technology Inc. is a publicly listed American corporation that manufactures microcontroller, mixed-signal, analog, and Flash-IP integrated circuits. Its products include microcontrollers (PIC, dsPIC, AVR and SAM), Serial EEPROM devices, Serial SRAM devices, embedded security devices, radio frequency (RF) devices, thermal, power and battery management analog devices, as well as linear, interface and wireless products."
    },
    {
        "ticker": "MU",
        "name": "Micron Technology",
        "url": "https://en.wikipedia.org/wiki/Micron_Technology",
        "desc": "Micron Technology, Inc. is an American producer of computer memory and computer data storage including dynamic random-access memory, flash memory, and USB flash drives. It is headquartered in Boise, Idaho. Its consumer products, including the Ballistix line of memory modules, are marketed under the Crucial brand. Micron and Intel together created IM Flash Technologies, which produced NAND flash memory. It owned Lexar between 2006[3] and 2017.[4]"
    },
    {
        "ticker": "MSFT",
        "name": "Microsoft",
        "url": "https://en.wikipedia.org/wiki/Microsoft",
        "desc": "Microsoft Corporation is an American multinational technology corporation headquartered in Redmond, Washington. Microsoft's best-known software products are the Windows line of operating systems, the Microsoft 365 suite of productivity applications, and the Edge web browser. Its flagship hardware products are the Xbox video game consoles and the Microsoft Surface lineup of touchscreen personal computers. Microsoft ranked No. 14 in the 2022 Fortune 500 rankings of the largest United States corporations by total revenue;[2] it was the world's largest software maker by revenue as of 2022. It is considered one of the Big Five American information technology companies, alongside Alphabet (parent company of Google), Amazon, Apple, and Meta Platforms."
    },
    {
        "ticker": "MAA",
        "name": "Mid-America Apartment Communities",
        "url": "https://en.wikipedia.org/wiki/Mid-America_Apartment_Communities",
        "desc": "Mid-America Apartment Communities (MAA) is a publicly traded real estate investment trust based in Memphis, Tennessee that invests in apartments in the Southeastern United States and the Southwestern United States.[1]"
    },
    {
        "ticker": "MRNA",
        "name": "Moderna",
        "url": "https://en.wikipedia.org/wiki/Moderna",
        "desc": "Moderna, Inc. (/məˈdɜːrnə/ mə-DUR-nə)[4] is a pharmaceutical and biotechnology company based in Cambridge, Massachusetts, that focuses on RNA therapeutics, primarily mRNA vaccines. These vaccines use a copy of a molecule called messenger RNA (mRNA) to carry instructions for proteins to produce an immune response.[5][1] The company's name is derived from the terms \"modified\", \"RNA\", and \"modern\".[6][7][8]"
    },
    {
        "ticker": "MHK",
        "name": "Mohawk Industries",
        "url": "https://en.wikipedia.org/wiki/Mohawk_Industries",
        "desc": "Mohawk Industries is an American flooring manufacturer based in Calhoun, Georgia, United States. Mohawk produces floor covering products for residential and commercial applications in North America and residential applications in Europe. The company manufacturing portfolio consists of soft flooring products (broadloom carpet, carpet tiles, carpet cushion and rugs), hard flooring products (ceramic and porcelain tile, natural stone and hardwood flooring), laminate flooring, sheet vinyl and luxury vinyl tile, natural stone and quartz countertops. In Europe, the company also produces and sells insulation, panels and mezzanine flooring. The company employs 43,000 people in operations in Australia, Brazil, Canada, Europe, Malaysia, Mexico, New Zealand, Russia and the United States.[5]"
    },
    {
        "ticker": "MOH",
        "name": "Molina Healthcare",
        "url": "https://en.wikipedia.org/wiki/Molina_Healthcare",
        "desc": "Molina Healthcare, Inc. is a managed care company headquartered in Long Beach, California, United States. The company provides health insurance to individuals through government programs such as Medicaid and Medicare."
    },
    {
        "ticker": "TAP",
        "name": "Molson Coors Beverage Company",
        "url": "https://en.wikipedia.org/wiki/Molson_Coors_Beverage_Company",
        "desc": "Molson Coors is a Canadian-American multinational drink and brewing company headquartered in Chicago, IL with main offices in Golden, Colorado, and Montreal, Quebec.[2]"
    },
    {
        "ticker": "MDLZ",
        "name": "Mondelez International",
        "url": "https://en.wikipedia.org/wiki/Mondelez_International",
        "desc": "Mondelez International, Inc. (/ˌmɒ̃dəˈliːz/ MAWN-də-LEEZ),[3] styled as Mondelēz International, is an American multinational confectionery, food, holding, beverage and snack food company based in Chicago.[4] Mondelez has an annual revenue of about $26 billion and operates in approximately 160 countries.[5] It ranked No. 108 in the 2021 Fortune 500 list of the largest United States corporations by total revenue.[6]"
    },
    {
        "ticker": "MPWR",
        "name": "Monolithic Power Systems",
        "url": "https://en.wikipedia.org/wiki/Monolithic_Power_Systems",
        "desc": "Monolithic Power Systems, Inc. is an American, publicly traded company headquartered in Kirkland, Washington. It operates in more than 15+ locations worldwide.[2]"
    },
    {
        "ticker": "MNST",
        "name": "Monster Beverage",
        "url": "https://en.wikipedia.org/wiki/Monster_Beverage",
        "desc": "Monster Beverage Corporation[3] is an American beverage company that manufactures energy drinks including Monster Energy, Relentless and Burn. The company was originally founded as Hansen's in 1935 in Southern California, originally selling juice products. The company renamed itself as Monster Beverage in 2012, and then sold their Hansen's juices and sodas and their other non-energy drink brands to the Coca-Cola Company in 2015."
    },
    {
        "ticker": "MCO",
        "name": "Moody's Corporation",
        "url": "https://en.wikipedia.org/wiki/Moody%27s_Corporation",
        "desc": "Moody's Corporation, often referred to as Moody's, is an American business and financial services company. It is the holding company for Moody's Investors Service (MIS), an American credit rating agency, and Moody's Analytics (MA), an American provider of financial analysis software and services."
    },
    {
        "ticker": "MS",
        "name": "Morgan Stanley",
        "url": "https://en.wikipedia.org/wiki/Morgan_Stanley",
        "desc": "Morgan Stanley is an American multinational investment bank and financial services company headquartered at 1585 Broadway in Midtown Manhattan, New York City. With offices in 41 countries and more than 75,000 employees, the firm's clients include corporations, governments, institutions, and individuals.[3] Morgan Stanley ranked No. 61 in the 2021 Fortune 500 list of the largest United States corporations by total revenue.[5]"
    },
    {
        "ticker": "MOS",
        "name": "Mosaic Company (The)",
        "url": "https://en.wikipedia.org/wiki/The_Mosaic_Company",
        "desc": "The Mosaic Company is a Fortune 500 company based in Tampa, Florida which mines phosphate, potash, and collects urea for fertilizer, through various international distribution networks,[3] and Mosaic Fertilizantes.[4] It is the largest U.S. producer of potash and phosphate fertilizer.[5]"
    },
    {
        "ticker": "MSI",
        "name": "Motorola Solutions",
        "url": "https://en.wikipedia.org/wiki/Motorola_Solutions",
        "desc": "Motorola Solutions, Inc. is an American video equipment, telecommunications equipment, software, systems and services provider that succeeded Motorola, Inc., following the spinoff of the mobile phone division into Motorola Mobility in 2011. The company is headquartered in Chicago, Illinois.[2]"
    },
    {
        "ticker": "MSCI",
        "name": "MSCI",
        "url": "https://en.wikipedia.org/wiki/MSCI",
        "desc": "MSCI Inc. is an American finance company headquartered in New York City. MSCI is a global provider of equity, fixed income, real estate indexes, multi-asset portfolio analysis tools, ESG and climate products. It operates the MSCI World, MSCI All Country World Index (ACWI) and MSCI Emerging Markets Indexes among others."
    },
    {
        "ticker": "NDAQ",
        "name": "Nasdaq, Inc.",
        "url": "https://en.wikipedia.org/wiki/Nasdaq,_Inc.",
        "desc": "Nasdaq, Inc. is an American multinational financial services corporation that owns and operates three stock exchanges in the United States: the namesake Nasdaq stock exchange, the Philadelphia Stock Exchange, and the Boston Stock Exchange, and seven European stock exchanges: Nasdaq Copenhagen, Nasdaq Helsinki, Nasdaq Iceland, Nasdaq Riga, Nasdaq Stockholm, Nasdaq Tallinn, and Nasdaq Vilnius. It is headquartered in New York City, and its president and chief executive officer is Adena Friedman."
    },
    {
        "ticker": "NTAP",
        "name": "NetApp",
        "url": "https://en.wikipedia.org/wiki/NetApp",
        "desc": "NetApp, Inc. is an American data storage and data management services company headquartered in San Jose, California.[2] It has ranked in the Fortune 500 from 2012 to 2021.[3] Founded in 1992[4] with an initial public offering in 1995,[5] NetApp offers cloud data services for management of applications and data both online and physically."
    },
    {
        "ticker": "NFLX",
        "name": "Netflix",
        "url": "https://en.wikipedia.org/wiki/Netflix,_Inc.",
        "desc": "Netflix, Inc. is an American media company founded in 1997 by Reed Hastings and Marc Randolph in Scotts Valley, California and currently based in Los Gatos, California. It owns and operates an eponymous over-the-top subscription video on-demand service, which showcases acquired and original programming as well as third-party content licensed from other production companies and distributors. Netflix is also the first (as so far only) streaming media company to be a member of the Motion Picture Association"
    },
    {
        "ticker": "NEM",
        "name": "Newmont",
        "url": "https://en.wikipedia.org/wiki/Newmont",
        "desc": "Newmont Corporation is an American gold mining company based in Greenwood Village, Colorado. It is the world's largest gold mining corporation.[3] Incorporated in 1921, it owns gold mines in Nevada, Colorado, Ontario, Quebec, Mexico, the Dominican Republic, Australia, Ghana, Argentina, Peru, and Suriname.[4] In addition to gold, Newmont mines copper, silver, zinc and lead.[5]"
    },
    {
        "ticker": "NWSA",
        "name": "News Corp",
        "url": "https://en.wikipedia.org/wiki/News_Corp",
        "desc": "News Corporation, stylized as News Corp,[3] is a mass media and publishing company headquartered in Midtown Manhattan, New York City. It was formed on June 28, 2013, following a spin-off of the media outlets of the original News Corporation as 21st Century Fox (21CF). Operating across digital real estate information, news media, book publishing, and cable television, News Corp's notable assets include Dow Jones & Company (publisher of The Wall Street Journal), News UK (publisher of The Sun and The Times), News Corp Australia, REA Group (operator of realestate.com.au), Realtor.com, and book publisher HarperCollins."
    },
    {
        "ticker": "NWS",
        "name": "News Corp",
        "url": "https://en.wikipedia.org/wiki/News_Corp",
        "desc": "News Corporation, stylized as News Corp,[3] is a mass media and publishing company headquartered in Midtown Manhattan, New York City. It was formed on June 28, 2013, following a spin-off of the media outlets of the original News Corporation as 21st Century Fox (21CF). Operating across digital real estate information, news media, book publishing, and cable television, News Corp's notable assets include Dow Jones & Company (publisher of The Wall Street Journal), News UK (publisher of The Sun and The Times), News Corp Australia, REA Group (operator of realestate.com.au), Realtor.com, and book publisher HarperCollins."
    },
    {
        "ticker": "NEE",
        "name": "NextEra Energy",
        "url": "https://en.wikipedia.org/wiki/NextEra_Energy",
        "desc": "NextEra Energy, Inc. is an American energy company with about 58 GW of generating capacity (24 GW of which were from fossil fuel sources[4]), revenues of over $18 billion in 2020, and about 14,900 employees throughout the US and Canada.[5][4] It is the largest electric utility holding company by market capitalization.[clarification needed] Its subsidiaries include Florida Power & Light (FPL), NextEra Energy Resources (NEER), NextEra Energy Partners, Gulf Power Company, and NextEra Energy Services."
    },
    {
        "ticker": "NKE",
        "name": "Nike, Inc.",
        "url": "https://en.wikipedia.org/wiki/Nike,_Inc.",
        "desc": "Nike, Inc.[note 1] (stylized as NIKE) is an American athletic footwear and apparel corporation headquartered near Beaverton, Oregon, United States.[4] It is the world's largest supplier of athletic shoes and apparel and a major manufacturer of sports equipment, with revenue in excess of US$46 billion in its fiscal year 2022.[5][6]"
    },
    {
        "ticker": "NI",
        "name": "NiSource",
        "url": "https://en.wikipedia.org/wiki/NiSource",
        "desc": "NiSource Inc. is one of the largest fully regulated utility companies in the United States, serving approximately 3.5 million natural gas customers and 500,000 electric customers across six states through its local Columbia Gas and NIPSCO brands. The company, based in Merrillville, Indiana, has more than 8,000 employees. As of 2018, NiSource is the sole Indiana-based utility company."
    },
    {
        "ticker": "NDSN",
        "name": "Nordson Corporation",
        "url": "https://en.wikipedia.org/wiki/Nordson_Corporation",
        "desc": "Nordson Corporation is an American multinational corporation that designs and manufactures dispensing equipment for consumer and industrial adhesives, sealants and coatings. The company also manufactures equipment used in the testing and inspection of electronic components, technology-based systems for curing and surface treatment processes as well as medical devices and component technologies. The company is headquartered in Westlake, Ohio,[2] and has direct operations and sales-support offices in approximately 30 countries."
    },
    {
        "ticker": "NSC",
        "name": "Norfolk Southern Railway",
        "url": "https://en.wikipedia.org/wiki/Norfolk_Southern_Railway",
        "desc": "The Norfolk Southern Railway (reporting mark NS) is a Class I freight railroad operating in the Eastern United States. Headquartered in Atlanta, the company was formed in 1982 with the merger of the Norfolk and Western Railway and Southern Railway.[4] The company operates 19,420 route miles (31,250 km) in 22 eastern states, the District of Columbia,[5] and has rights in Canada over the Albany to Montréal route of the Canadian Pacific Kansas City.[6][7] Norfolk Southern Railway is the leading subsidiary of the Norfolk Southern Corporation."
    },
    {
        "ticker": "NTRS",
        "name": "Northern Trust",
        "url": "https://en.wikipedia.org/wiki/Northern_Trust",
        "desc": "Northern Trust Corporation is an American financial services company headquartered in Chicago, Illinois that caters to corporations, institutional investors, and ultra high net worth individuals. Northern Trust is one of the largest banking institutions in the United States and one of the oldest banks in continuous operation. As of June 30, 2022, it had $1.7 trillion in assets under management and $17 trillion in assets under custody. Northern Trust Corporation is incorporated in Delaware.[3]"
    },
    {
        "ticker": "NOC",
        "name": "Northrop Grumman",
        "url": "https://en.wikipedia.org/wiki/Northrop_Grumman",
        "desc": "Northrop Grumman Corporation is an American multinational aerospace and defense technology company. With 95,000 employees[3] and an annual revenue in excess of $30 billion, it is one of the world's largest weapons manufacturers and military technology providers.[4][5][6] The firm ranks No. 101 on the 2022 Fortune 500 list of America's largest corporations.[7]"
    },
    {
        "ticker": "NCLH",
        "name": "Norwegian Cruise Line Holdings",
        "url": "https://en.wikipedia.org/wiki/Norwegian_Cruise_Line_Holdings",
        "desc": "Norwegian Cruise Line Holdings (NCLH) is a holding company that is domiciled in Bermuda and based in the United States.[4][5] It operates three cruise lines as wholly owned subsidiaries: Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises. With its subsidiaries combined, it is the third-largest cruise operator in the world. It is a publicly traded company listed on the New York Stock Exchange."
    },
    {
        "ticker": "NRG",
        "name": "NRG Energy",
        "url": "https://en.wikipedia.org/wiki/NRG_Energy",
        "desc": "NRG Energy, Inc. is an American energy company, headquartered in Houston, Texas.[2][3] It was formerly the wholesale arm of Northern States Power Company (NSP), which became Xcel Energy, but became independent in 2000. NRG Energy is involved in energy generation and retail electricity.[4] Their portfolio includes natural gas generation, coal generation, oil generation, nuclear generation, wind generation, utility-scale generation, and distributed solar generation.[5][6] NRG serves over 7 million retail customers in 24 US states including Texas, Connecticut, Delaware, Illinois, Maryland, Massachusetts, New Jersey, New York, Pennsylvania, Ohio; the District of Columbia, and eight provinces in Canada.[1][7]"
    },
    {
        "ticker": "NUE",
        "name": "Nucor",
        "url": "https://en.wikipedia.org/wiki/Nucor",
        "desc": "Nucor Corporation is an American producer of steel and related products based in Charlotte, North Carolina. It is the largest steel producer in the United States, the largest \"mini-mill\" steelmaker (i.e. it uses electric arc furnaces to melt scrap steel as opposed to blast furnaces to melt iron), and the biggest recycler of scrap in North America.[1] As of 2021, Nucor is the 15th-largest steel producer in the world.[2]"
    },
    {
        "ticker": "NVDA",
        "name": "Nvidia",
        "url": "https://en.wikipedia.org/wiki/Nvidia",
        "desc": "Nvidia Corporation[note 1][note 2] (/ɛnˈvɪdiə/ en-VID-ee-ə) is an American multinational technology company incorporated in Delaware and based in Santa Clara, California.[2] It is a software and fabless company which designs graphics processing units (GPUs), application programming interface (APIs) for data science and high-performance computing as well as system on a chip units (SoCs) for the mobile computing and automotive market. Nvidia is a dominant supplier of artificial intelligence hardware and software.[3][4] Its professional line of GPUs are used in workstations for applications in such fields as architecture, engineering and construction, media and entertainment, automotive, scientific research, and manufacturing design.[5]"
    },
    {
        "ticker": "NVR",
        "name": "NVR, Inc.",
        "url": "https://en.wikipedia.org/wiki/NVR,_Inc.",
        "desc": "NVR, Inc. is a company engaged in home construction headquartered in Reston, Virginia. It also operates a mortgage banking and title services business. The company primarily operates on the East Coast of the United States, but its operations encompass 14 states as well as Washington, D.C. In 2021, 22% of the company's revenue was from the Washington metropolitan area.[1]"
    },
    {
        "ticker": "NXPI",
        "name": "NXP Semiconductors",
        "url": "https://en.wikipedia.org/wiki/NXP_Semiconductors",
        "desc": "NXP Semiconductors N.V. (NXP) is a Dutch semiconductor designer and manufacturer with headquarters in Eindhoven, Netherlands.[2] The company employs approximately 31,000 people in more than 30 countries. NXP reported revenue of $11.06 billion in 2021.[3]"
    },
    {
        "ticker": "ORLY",
        "name": "O'Reilly Auto Parts",
        "url": "https://en.wikipedia.org/wiki/O%27Reilly_Auto_Parts",
        "desc": "O’Reilly Automotive, Inc. is an American auto parts retailer that provides automotive aftermarket parts, tools, supplies, equipment, and accessories to professional service providers and do-it-yourself customers. Founded in 1957 by the O’Reilly family, the company operates more than 6,000 stores in 47 states and Mexico."
    },
    {
        "ticker": "OXY",
        "name": "Occidental Petroleum",
        "url": "https://en.wikipedia.org/wiki/Occidental_Petroleum",
        "desc": "Occidental Petroleum Corporation (often abbreviated Oxy in reference to its ticker symbol and logo) is an American company engaged in hydrocarbon exploration in the United States, and the Middle East as well as petrochemical manufacturing in the United States, Canada, and Chile. It is organized in Delaware and headquartered in Houston. The company ranked 183rd on the 2021 Fortune 500 based on its 2020 revenues[4] and 670th on the 2021 Forbes Global 2000.[5]"
    },
    {
        "ticker": "ODFL",
        "name": "Old Dominion",
        "url": "https://en.wikipedia.org/wiki/Old_Dominion_Freight_Line",
        "desc": "Old Dominion Freight Line, Inc. (ODFL) is an American regional, inter-regional and national less than truckload shipping (LTL) company. In addition to its core LTL services, the company offers expedited, logistics and household moving services.[3][5]"
    },
    {
        "ticker": "OMC",
        "name": "Omnicom Group",
        "url": "https://en.wikipedia.org/wiki/Omnicom_Group",
        "desc": "Omnicom Group Inc. is an American global media, marketing and corporate communications holding company, headquartered in New York City."
    },
    {
        "ticker": "ON",
        "name": "ON Semiconductor",
        "url": "https://en.wikipedia.org/wiki/ON_Semiconductor",
        "desc": "onsemi (stylized in lowercase as \"onsemi\"; legally ON Semiconductor Corporation; formerly ON Semiconductor until August 5, 2021) is an American semiconductor supplier company, based in Scottsdale, Arizona and ranked #483 on the 2022 Fortune 500 based on its 2021 sales.[2][3] Products include power and signal management, logic, discrete, and custom devices for automotive, communications, computing, consumer, industrial, LED lighting, medical, military/aerospace and power applications. onsemi runs a network of manufacturing facilities, sales offices and design centers in North America, Europe, and the Asia Pacific regions. Based on its 2016 revenues of $3.907 billion,[4] onsemi ranked among the worldwide top 20 semiconductor sales leaders.[5]"
    },
    {
        "ticker": "OKE",
        "name": "ONEOK",
        "url": "https://en.wikipedia.org/wiki/Oneok",
        "desc": "Oneok, Inc. (/ˈwʌnˌoʊk/ WUN-oke[2]) is an American diversified corporation focused primarily on the natural gas industry, and headquartered in Tulsa, Oklahoma. The company is part of the Fortune 500 and S&P 500. [3] Oneok was founded in 1906 as Oklahoma Natural Gas Company, but it changed its corporate name to Oneok in December 1980. It also owns major natural gas liquids (NGL) systems due to the 2005 acquisition of Koch Industries natural gas businesses."
    },
    {
        "ticker": "ORCL",
        "name": "Oracle Corporation",
        "url": "https://en.wikipedia.org/wiki/Oracle_Corporation",
        "desc": "Oracle Corporation is an American multinational computer technology company headquartered in Austin, Texas, United States.[5] In 2020, Oracle was the third-largest software company in the world by revenue and market capitalization.[6] The company sells database software and technology (particularly its own brands), cloud engineered systems, and enterprise software products, such as enterprise resource planning (ERP) software, human capital management (HCM) software, customer relationship management (CRM) software (also known as customer experience), enterprise performance management (EPM) software, and supply chain management (SCM) software.[7]"
    },
    {
        "ticker": "OGN",
        "name": "Organon & Co.",
        "url": "https://en.wikipedia.org/wiki/Organon_%26_Co.",
        "desc": "Organon & Co. is an American pharmaceutical company headquartered in Jersey City, New Jersey.[4] Organon specializes in the following core therapeutic fields: reproductive medicine, contraception, psychiatry, hormone replacement therapy (HRT), and anesthesia. Organon produces all its products outside of the United States but gets a third of its revenue from the United States. Organon & Co. is an example of increasing women's representation on Wall Street with over 50% of its Board of Directors and executive leadership being female.[3]"
    },
    {
        "ticker": "OTIS",
        "name": "Otis Worldwide",
        "url": "https://en.wikipedia.org/wiki/Otis_Worldwide",
        "desc": "Otis Worldwide Corporation (branded as the Otis Elevator Company, its former legal name) is an American company that develops, manufactures and markets elevators, escalators, moving walkways, and related equipment."
    },
    {
        "ticker": "PCAR",
        "name": "Paccar",
        "url": "https://en.wikipedia.org/wiki/Paccar",
        "desc": "PACCAR Inc is a multinational company primarily focused on the design and manufacturing of large commercial trucks through its subsidiaries DAF, Kenworth and Peterbilt. The company is headquartered in Bellevue, Washington, in the Seattle metropolitan area, and was founded in 1971 as the successor to the Pacific Car and Foundry Company, from which it draws its name. The company traces its predecessors to the Seattle Car Manufacturing Company formed in 1905. In addition to its principal business, the company also has a parts division, a financial services segment, and manufactures and markets industrial winches. The company's stock is a component of the Nasdaq-100 and S&P 500 stock market indices."
    },
    {
        "ticker": "PKG",
        "name": "Packaging Corporation of America",
        "url": "https://en.wikipedia.org/wiki/Packaging_Corporation_of_America",
        "desc": "Packaging Corporation of America is an American manufacturing company based in Lake Forest, Illinois.[2] The company has about 15,500 employees, with operations primarily in the United States. The CEO is Mark W. Kowlzan.[3]"
    },
    {
        "ticker": "PANW",
        "name": "Palo Alto Networks",
        "url": "https://en.wikipedia.org/wiki/Palo_Alto_Networks",
        "desc": "Palo Alto Networks, Inc. is an American multinational cybersecurity company with headquarters in Santa Clara, California. The core product is a platform that includes advanced firewalls and cloud-based offerings that extend those firewalls to cover other aspects of security. The company serves over 70,000 organizations in over 150 countries, including 85 of the Fortune 100.[6] It is home to the Unit 42 threat research team[7] and hosts the Ignite cybersecurity conference.[8] It is a partner organization of the World Economic Forum.[9]"
    },
    {
        "ticker": "PARA",
        "name": "Paramount Global",
        "url": "https://en.wikipedia.org/wiki/Paramount_Global",
        "desc": "Paramount Global[a] (doing business as Paramount)[6] is an American multinational mass media and entertainment conglomerate controlled by National Amusements and headquartered at One Astor Plaza in Midtown Manhattan in New York City. The company was formed on December 4, 2019, as ViacomCBS Inc. through the merger of the second incarnations of CBS Corporation and Viacom[7] (which were split from the original Viacom on December 31, 2005). The company changed its name to Paramount Global on February 16, 2022, the day after its Q4 earnings presentation.[8]"
    },
    {
        "ticker": "PH",
        "name": "Parker Hannifin",
        "url": "https://en.wikipedia.org/wiki/Parker_Hannifin",
        "desc": "Parker Hannifin Corporation, originally Parker Appliance Company, usually referred to as just Parker, is an American corporation specializing in motion and control technologies. Its corporate headquarters are in Mayfield Heights, Ohio, in Greater Cleveland (with a Cleveland mailing address).[3][4]"
    },
    {
        "ticker": "PAYX",
        "name": "Paychex",
        "url": "https://en.wikipedia.org/wiki/Paychex",
        "desc": "Paychex, Inc. is an American provider of human resource, payroll, and benefits outsourcing services for small- to medium-sized businesses.[2][3] With headquarters in Rochester, New York, the company has more than 100 offices serving approximately 670,000 payroll clients in the U.S. and Europe.[4] In 2019, Paychex ranked in position 700 on the Fortune 500 list of largest corporations by revenue,[5] and the company's revenue for fiscal year 2020 is projected to exceed $4.1 billion.[6]"
    },
    {
        "ticker": "PAYC",
        "name": "Paycom",
        "url": "https://en.wikipedia.org/wiki/Paycom",
        "desc": "Paycom Software, Inc., known simply as Paycom, is an American online payroll and human resource technology provider based in Oklahoma City, Oklahoma with offices throughout the United States.[2][4] It is attributed with being one of the first fully online payroll providers.[5] It has been recognized by Fortune and Forbes as one of the fastest-growing publicly traded companies in the world, and as one of the World's Most Innovative Enterprise Companies by Fast Company in 2022.[6][7][8] Founded in 1998, it reported annual revenue of $1.375 billion for 2022, up from $1.06 billion for 2021.[9]"
    },
    {
        "ticker": "PYPL",
        "name": "PayPal",
        "url": "https://en.wikipedia.org/wiki/PayPal",
        "desc": "PayPal Holdings, Inc. is an American multinational financial technology company operating an online payments system in the majority of countries that support online money transfers, and serves as an electronic alternative to traditional paper methods such as checks and money orders. The company operates as a payment processor for online vendors, auction sites and many other commercial users, for which it charges a fee."
    },
    {
        "ticker": "PNR",
        "name": "Pentair",
        "url": "https://en.wikipedia.org/wiki/Pentair",
        "desc": "Pentair plc (PNR) is an American water treatment company incorporated in Ireland with tax residency in UK, with its main U.S. office in Golden Valley, Minnesota.[6] Pentair was founded in the US, with 65% of company's revenue coming from the US and Canada as of 2017. PNR was reorganized in 2014, shifting the corporate domicile from Switzerland to Ireland.[7]"
    },
    {
        "ticker": "PEP",
        "name": "PepsiCo",
        "url": "https://en.wikipedia.org/wiki/PepsiCo",
        "desc": "PepsiCo, Inc. is an American multinational food, snack, and beverage corporation headquartered in Harrison, New York, in the hamlet of Purchase. PepsiCo's business encompasses all aspects of the food and beverage market. It oversees the manufacturing, distribution, and marketing of its products. PepsiCo was formed in 1965 with the merger of the Pepsi-Cola Company and Frito-Lay, Inc., PepsiCo has since expanded from its namesake product Pepsi Cola to an immensely diversified range of food and beverage brands. The largest and most recent acquisition was Pioneer Foods in 2020 for US$1.7 billion[2] and prior to it was buying the Quaker Oats Company in 2001, which added the Gatorade brand to the Pepsi portfolio and Tropicana Products in 1998."
    },
    {
        "ticker": "PFE",
        "name": "Pfizer",
        "url": "https://en.wikipedia.org/wiki/Pfizer",
        "desc": "Pfizer Inc. (/ˈfaɪzər/ FY-zər)[2] is an American multinational pharmaceutical and biotechnology corporation headquartered at The Spiral in Manhattan, New York City. The company was established in 1849 in New York by two German entrepreneurs, Charles Pfizer (1824–1906) and his cousin Charles F. Erhart (1821–1891)."
    },
    {
        "ticker": "PCG",
        "name": "PG&E Corporation",
        "url": "https://en.wikipedia.org/wiki/PG%26E",
        "desc": "The Pacific Gas and Electric Company (PG&E) is an American investor-owned utility (IOU).[2] The company is headquartered at 300 Lakeside Drive, in Oakland, California. PG&E provides natural gas and electricity to 5.2 million households in the northern two-thirds of California, from Bakersfield and northern Santa Barbara County, almost to the Oregon and Nevada state lines.[3]: 27 [4]"
    },
    {
        "ticker": "PM",
        "name": "Philip Morris International",
        "url": "https://en.wikipedia.org/wiki/Philip_Morris_International",
        "desc": "Philip Morris International Inc. (PMI) is an American multinational tobacco company, with products sold in over 180 countries. The most recognized and best selling product of the company is Marlboro.[3] Philip Morris International is often referred to as one of the companies comprising Big Tobacco."
    },
    {
        "ticker": "PSX",
        "name": "Phillips 66",
        "url": "https://en.wikipedia.org/wiki/Phillips_66",
        "desc": "The Phillips 66 Company is an American multinational energy company headquartered in Westchase, Houston, Texas. Its name, dating back to 1927 as a trademark of the Phillips Petroleum Company, helped ground the newly reconfigured Phillips 66. The company today was formed ten years after Phillips merged with Conoco to form ConocoPhillips. The merged company spun off its refining, chemical, and retail assets (known as downstream operations in the oil industry) into a new company bearing the Phillips name. It began trading on the New York Stock Exchange on May 1, 2012, under the ticker PSX."
    },
    {
        "ticker": "PNW",
        "name": "Pinnacle West",
        "url": "https://en.wikipedia.org/wiki/Pinnacle_West",
        "desc": "Pinnacle West Capital Corporation is an American utility holding company that owns Arizona Public Service (APS) and Bright Canyon Energy. It is publicly traded on the New York Stock exchange and a component of the S&P 500 stock market index. APS is the largest utility company in Arizona it is regulated by the Arizona Corporation Commission (ACC)."
    },
    {
        "ticker": "PXD",
        "name": "Pioneer Natural Resources",
        "url": "https://en.wikipedia.org/wiki/Pioneer_Natural_Resources",
        "desc": "Pioneer Natural Resources Company is an American company engaged in hydrocarbon exploration headquartered in Irving, Texas. It operates in the Cline Shale, which is part of the Spraberry Trend of the Permian Basin, where the company is the largest acreage holder.[1][2][3]"
    },
    {
        "ticker": "PNC",
        "name": "PNC Financial Services",
        "url": "https://en.wikipedia.org/wiki/PNC_Financial_Services",
        "desc": "The PNC Financial Services Group, Inc. is an American bank holding company and financial services corporation based in Pittsburgh, Pennsylvania. Its banking subsidiary, PNC Bank, operates in 27 states and the District of Columbia, with 2,629 branches and 9,523 ATMs. PNC Bank is on the list of largest banks in the United States by assets and is one of the largest banks by number of branches, deposits, and number of ATMs."
    },
    {
        "ticker": "POOL",
        "name": "Pool Corporation",
        "url": "https://en.wikipedia.org/wiki/Pool_Corporation",
        "desc": "Pool Corporation, doing business as POOLCORP, is a publicly-traded American company that manufactures equipment and machinery for swimming pools. As of 2021, it was the largest wholesale distributor of swimming pool and backyard products in the world.[3]"
    },
    {
        "ticker": "PPG",
        "name": "PPG Industries",
        "url": "https://en.wikipedia.org/wiki/PPG_Industries",
        "desc": "PPG Industries, Inc. is an American Fortune 500 company and global supplier of paints, coatings, and specialty materials. With headquarters in Pittsburgh, Pennsylvania, PPG operates in more than 70 countries around the globe. By revenue it is the largest coatings company in the world followed by AkzoNobel.[2] It is headquartered in PPG Place, an office and retail complex in downtown Pittsburgh, and is known for its glass facade designed by Postmodern architect Philip Johnson."
    },
    {
        "ticker": "PPL",
        "name": "PPL Corporation",
        "url": "https://en.wikipedia.org/wiki/PPL_Corporation",
        "desc": "PPL Corporation is an energy company headquartered in Allentown, Pennsylvania in the Lehigh Valley region of eastern Pennsylvania. The company is publicly traded on the New York Stock Exchange."
    },
    {
        "ticker": "PFG",
        "name": "Principal Financial Group",
        "url": "https://en.wikipedia.org/wiki/Principal_Financial_Group",
        "desc": "Principal Financial Group is an American global financial investment management and insurance company headquartered in Des Moines, Iowa, U.S."
    },
    {
        "ticker": "PG",
        "name": "Procter & Gamble",
        "url": "https://en.wikipedia.org/wiki/Procter_%26_Gamble",
        "desc": "The Procter & Gamble Company (P&G) is an American multinational consumer goods corporation headquartered in Cincinnati, Ohio, founded in 1837 by William Procter and James Gamble.[2] It specializes in a wide range of personal health/consumer health, personal care and hygiene products; these products are organized into several segments including beauty; grooming; health care; fabric and home care; and baby, feminine, and family care. Before the sale of Pringles to Kellogg's, its product portfolio also included food, snacks, and beverages.[3] P&G is incorporated in Ohio.[4]"
    },
    {
        "ticker": "PGR",
        "name": "Progressive Corporation",
        "url": "https://en.wikipedia.org/wiki/Progressive_Corporation",
        "desc": "The Progressive Corporation is an American insurance company. In late 2022, Progressive became the largest motor insurance carrier in the U.S.[2] The company was co-founded in 1937 by Jack Green and Joseph M. Lewis, and is headquartered in Mayfield Village, Ohio.[3] The company insures passenger vehicles, motorcycles, RVs, trailers, boats, PWC, and commercial vehicles. Progressive also provides home, life, pet, and other insurance through select companies. Additionally, Progressive offers auto insurance in Australia."
    },
    {
        "ticker": "PLD",
        "name": "Prologis",
        "url": "https://en.wikipedia.org/wiki/Prologis",
        "desc": "Prologis, Inc. is a real estate investment trust headquartered in San Francisco, California that invests in logistics facilities.[6] The company was formed through the merger of AMB Property Corporation and Prologis in June 2011, which made Prologis the largest industrial real estate company in the world.[7][8] As of December 2022, the company owned 5,495 buildings comprising about 1.2 billion square feet[9] in 19 countries across North America, Latin America, Europe, and Asia.[10] According to The Economist, its business strategy is focused on warehouses that are located close to huge urban areas where land is scarce.[11] It serves about 6,600 tenants.[9] Prologis began to expand its non-real estate business, Essentials, in 2022, offering customers solar power, racking systems, forklifts, generators,[12] and EV charging infrastructure.[13] and other logistics tech equipment for purchase."
    },
    {
        "ticker": "PRU",
        "name": "Prudential Financial",
        "url": "https://en.wikipedia.org/wiki/Prudential_Financial",
        "desc": "Prudential Financial, Inc. is an American Fortune Global 500 and Fortune 500 company whose subsidiaries provide insurance, retirement planning, investment management, and other products and services to both retail and institutional customers throughout the United States and in over 40 other countries. In 2019, Prudential was the largest insurance provider in the United States with $815.1 billion in total assets."
    },
    {
        "ticker": "PEG",
        "name": "Public Service Enterprise Group",
        "url": "https://en.wikipedia.org/wiki/Public_Service_Enterprise_Group",
        "desc": "The Public Service Enterprise Group (PSEG) is a publicly traded diversified energy company headquartered in Newark, New Jersey, US established in 1985 with a legacy dating back to 1903."
    },
    {
        "ticker": "PTC",
        "name": "PTC",
        "url": "https://en.wikipedia.org/wiki/PTC_(software_company)",
        "desc": "PTC (formerly Parametric Technology Corporation) is a computer software and services company founded in 1985 and headquartered in Boston, Massachusetts. The company was a pioneer in parametric, associative feature-based, solid computer-aided design (CAD) modeling software in 1988, including an Internet-based product for Product Lifecycle Management (PLM) in 1998. PTC (NASDAQ: PTC) markets products and services and an Internet of Things (IoT) and augmented reality (AR) platform for partners and developers."
    },
    {
        "ticker": "PSA",
        "name": "Public Storage",
        "url": "https://en.wikipedia.org/wiki/Public_Storage",
        "desc": "Public Storage is an American international self storage company headquartered in Glendale, California, that is run as a real estate investment trust (REIT). It is the largest brand of self-storage services in the US.[4] In 2008, it was the largest of four publicly traded storage REITs.[5] There are more than 2,200 Public Storage self-storage locations in the US, Canada and Europe. It also owns 42 percent of an office parks subsidiary, sells packing supplies, and provides other services. As a REIT, it is owned by real estate investors, who receive more than 90 percent of the company's profits as a return-on-investment.[4]"
    },
    {
        "ticker": "PHM",
        "name": "PulteGroup",
        "url": "https://en.wikipedia.org/wiki/PulteGroup",
        "desc": "PulteGroup, Inc. is an American residential home-construction company based in Atlanta, Georgia, United States. The company is the third-largest home-construction company in the United States based on the number of homes closed.[3] In total, the company has built over 775,000 homes.[1]"
    },
    {
        "ticker": "QRVO",
        "name": "Qorvo",
        "url": "https://en.wikipedia.org/wiki/Qorvo",
        "desc": "Qorvo is an American multinational company specializing in products for wireless, wired, and power markets.[2] The company was created by the merger of TriQuint Semiconductor and RF Micro Devices, which was announced in 2014 and completed on January 1, 2015.[3] It trades on Nasdaq under the ticker symbol QRVO.[4] The headquarters for the company originally were in both Hillsboro, Oregon (home of TriQuint), and Greensboro, North Carolina (home of RFMD),[5] but in mid-2016 the company began referring to its North Carolina site as its exclusive headquarters.[6]"
    },
    {
        "ticker": "PWR",
        "name": "Quanta Services",
        "url": "https://en.wikipedia.org/wiki/Quanta_Services",
        "desc": "Quanta Services is an American corporation that provides infrastructure services for electric power, pipeline, industrial and communications industries. Capabilities include the planning, design, installation, program management, maintenance and repair of most types of network infrastructure. In June 2009, Quanta Services was added to the S&P 500 index, replacing Ingersoll-Rand.[3]"
    },
    {
        "ticker": "QCOM",
        "name": "Qualcomm",
        "url": "https://en.wikipedia.org/wiki/Qualcomm",
        "desc": "Qualcomm Incorporated (/ˈkwɒlkɒm/)[2] is an American multinational corporation headquartered in San Diego, California, and incorporated in Delaware.[3] It creates semiconductors, software, and services related to wireless technology. It owns patents critical to the 5G,[4] 4G,[4] CDMA2000, TD-SCDMA and WCDMA mobile communications standards."
    },
    {
        "ticker": "DGX",
        "name": "Quest Diagnostics",
        "url": "https://en.wikipedia.org/wiki/Quest_Diagnostics",
        "desc": "Quest Diagnostics is an American clinical laboratory. A Fortune 500 company, Quest operates in the United States, Puerto Rico, Mexico, and Brazil.[4] Quest also maintains collaborative agreements with various hospitals and clinics across the globe.[5]"
    },
    {
        "ticker": "RL",
        "name": "Ralph Lauren Corporation",
        "url": "https://en.wikipedia.org/wiki/Ralph_Lauren_Corporation",
        "desc": "Ralph Lauren Corporation is an American publicly traded fashion company that was founded in 1967 by American fashion designer Ralph Lauren. Headquartered in New York City, the company produces products ranging from the mid-range to the luxury segments. Ralph Lauren is known for marketing and distributing products in four categories: apparel, home, accessories, and fragrances. Known mostly for its flagship brand Polo Ralph Lauren, the company's brands include mid-range, sub-premium, and premium labels up to its highest priced luxury Purple label apparel. The company additionally owned Club Monaco from 1999 to 2021."
    },
    {
        "ticker": "RJF",
        "name": "Raymond James",
        "url": "https://en.wikipedia.org/wiki/Raymond_James",
        "desc": "Raymond James Financial, Inc. is an American multinational independent investment bank and financial services company providing financial services to individuals, corporations, and municipalities through its subsidiary companies that engage primarily in investment and financial planning, in addition to investment banking and asset management. Headquartered in St. Petersburg, Florida, Raymond James is one of the largest banking institutions in the United States.[2]"
    },
    {
        "ticker": "RTX",
        "name": "RTX Corporation",
        "url": "https://en.wikipedia.org/wiki/RTX_Corporation",
        "desc": "RTX Corporation (formerly Raytheon Technologies Corporation)[3][4] is an American multinational aerospace and defense conglomerate headquartered in Arlington, Virginia. It is one of the largest aerospace and defense manufacturers in the world by revenue and market capitalization, as well as one of the largest providers of intelligence services.[note 1][7] RTX manufactures aircraft engines, avionics, aerostructures, cybersecurity solutions, guided missiles, air defense systems, satellites, and drones. The company is also a large military contractor, getting a significant portion of its revenue from the U.S. government.[8][9]"
    },
    {
        "ticker": "O",
        "name": "Realty Income",
        "url": "https://en.wikipedia.org/wiki/Realty_Income",
        "desc": "Realty Income Corporation is a real estate investment trust that invests in free-standing, single-tenant commercial properties in the United States, Spain and the United Kingdom that are subject to NNN Leases. The company is organized in Maryland with its headquarters in San Diego, California."
    },
    {
        "ticker": "REG",
        "name": "Regency Centers",
        "url": "https://en.wikipedia.org/wiki/Regency_Centers",
        "desc": "Regency Centers Corporation is a real estate investment trust based in Jacksonville, Florida and is one of the largest operators of shopping centers with grocery stores as anchor tenants. As of October 21, 2020, the company owned 415 properties comprising 56 million square feet of space. Notable properties owned by the company include Serramonte Center and a 30% interest in Village District.[1]"
    },
    {
        "ticker": "REGN",
        "name": "Regeneron",
        "url": "https://en.wikipedia.org/wiki/Regeneron",
        "desc": "Regeneron Pharmaceuticals, Inc. is an American biotechnology company headquartered in Westchester County, New York. The company was founded in 1988.[2] Originally focused on neurotrophic factors and their regenerative capabilities, giving rise to its name, the company then branched out into the study of both cytokine and tyrosine kinase receptors, which gave rise to their first product, which is a VEGF-trap."
    },
    {
        "ticker": "RF",
        "name": "Regions Financial Corporation",
        "url": "https://en.wikipedia.org/wiki/Regions_Financial_Corporation",
        "desc": "Regions Financial Corporation is an American bank holding company headquartered in the Regions Center in Birmingham, Alabama.[1] The company provides retail banking and commercial banking, trust, stockbrokerage, and mortgage services. Its banking subsidiary, Regions Bank, operates 1,952 automated teller machines and 1,454 branches in 16 states in the Southern and Midwestern United States.[1]"
    },
    {
        "ticker": "RSG",
        "name": "Republic Services",
        "url": "https://en.wikipedia.org/wiki/Republic_Services",
        "desc": "Republic Services is a North American waste disposal company whose services include non-hazardous solid waste collection, waste transfer, waste disposal, recycling, and energy services. It is the second largest provider of waste disposal in the United States (as measured by revenue) after Waste Management Corporation."
    },
    {
        "ticker": "RMD",
        "name": "ResMed",
        "url": "https://en.wikipedia.org/wiki/ResMed",
        "desc": "ResMed Inc. is a San Diego, California-based medical equipment company. It primarily provides cloud-connectable medical devices for the treatment of sleep apnea (such as CPAP devices and masks), chronic obstructive pulmonary disease (COPD), and other respiratory conditions. ResMed produced hundreds of thousands of ventilators and bilevel devices to help treat the respiratory symptoms of patients with COVID-19. ResMed also provides software to out-of-hospital care agencies to streamline transitions of care into and between these care settings for seniors and their care providers (i.e. home health, hospice, skilled nursing facilities, life plan communities, senior living centers, and private duty)."
    },
    {
        "ticker": "RVTY",
        "name": "Revvity",
        "url": "https://en.wikipedia.org/wiki/Revvity",
        "desc": "Revvity, Inc. is an American company in the life sciences and diagnostics business that is focused on selling to the pharmaceutical and biotechnology industries,[1] especially in relation to approaches making use of new cell therapy or gene therapy developments.[2] Its origins lie with the long-existing company PerkinElmer, which has been in a variety of business lines.[3]"
    },
    {
        "ticker": "RHI",
        "name": "Robert Half",
        "url": "https://en.wikipedia.org/wiki/Robert_Half",
        "desc": "Robert Half International Inc., commonly known as Robert Half, is an international human resource consulting firm founded in 1948, based in Menlo Park and San Ramon, California.[4] It is a member of the S&P 500,[5] and is among the world's largest accounting and finance staffing firms, with over 345 locations worldwide.[6]"
    },
    {
        "ticker": "ROK",
        "name": "Rockwell Automation",
        "url": "https://en.wikipedia.org/wiki/Rockwell_Automation",
        "desc": "Rockwell Automation, Inc. is an American provider of industrial automation and digital transformation technologies. Brands include Allen-Bradley, FactoryTalk software and LifecycleIQ Services."
    },
    {
        "ticker": "ROL",
        "name": "Rollins, Inc.",
        "url": "https://en.wikipedia.org/wiki/Rollins,_Inc.",
        "desc": "Rollins, Inc. is a North American pest control company serving residential and commercial clients. Operating globally through its wholly owned subsidiaries, Orkin, Inc., PCO Services (now Orkin Canada),[3] HomeTeam Pest Defense, Western Pest Services, Industrial Fumigant Company, TruTech, Critter Control, Crane, Waltham, OPC Services, PermaTreat, Northwest Exterminating, McCall Service and Clark Pest Control,[4] as well UK subsidiaries Integrated Pest Management Limited, Safeguard Pest Control, NBC Environment, Europest Environmental Services, Guardian Pest Control, Ames, and Kestrel, with Australian subsidiaries Allpest, Scientific Pest Control, Murray Pest Control and Statewide Pest Control, and Singapore subsidiary Aardwolf Pestkare, the company provides pest control services and protection against termite damage, rodents and insects to over 2.8 million customers in the US, Canada, United Kingdom, Mexico, Central America, the Caribbean, the Middle East and Asia from over 800 locations."
    },
    {
        "ticker": "ROP",
        "name": "Roper Technologies",
        "url": "https://en.wikipedia.org/wiki/Roper_Technologies",
        "desc": "Roper Technologies, Inc. (formerly Roper Industries, Inc.)[2] is an American diversified industrial company that produces engineered products for global niche markets. The company is headquartered in Sarasota, Florida."
    },
    {
        "ticker": "ROST",
        "name": "Ross Stores",
        "url": "https://en.wikipedia.org/wiki/Ross_Stores",
        "desc": "Ross Stores, Inc., operating under the brand name Ross Dress for Less, is an American chain of discount department stores headquartered in Dublin, California.[6] It is the largest off-price retailer in the U.S.; as of 2018, Ross operates 1,483 stores in 37 U.S. states, the District of Columbia and Guam,[7] covering much of the country, but with no presence in New York, northern New Jersey, Alaska, Puerto Rico, and areas of the Midwest.[8] The company also operates DD's Discounts, a discount department store chain with over 300 locations across the United States, most of which are located in Sun Belt states.[9]"
    },
    {
        "ticker": "RCL",
        "name": "Royal Caribbean Group",
        "url": "https://en.wikipedia.org/wiki/Royal_Caribbean_Group",
        "desc": "Royal Caribbean Group, formerly known as Royal Caribbean Cruises Ltd., is a global cruise holding company incorporated in Liberia and based in Miami, Florida. It is the world's second-largest cruise line operator, after Carnival Corporation & plc. As of January 2021, Royal Caribbean Group fully owns three cruise lines: Royal Caribbean International, Celebrity Cruises, and Silversea Cruises.[8] They hold a 50% stake in TUI Cruises and Hapag-Lloyd Cruises, also the now-defunct Pullmantur Cruises and CDF Croisières de France.[9][10]"
    },
    {
        "ticker": "SPGI",
        "name": "S&P Global",
        "url": "https://en.wikipedia.org/wiki/S%26P_Global",
        "desc": "S&P Global Inc. (prior to April 2016 McGraw Hill Financial, Inc., and prior to 2013 The McGraw–Hill Companies, Inc.) is an American publicly traded corporation headquartered in Manhattan, New York City. Its primary areas of business are financial information and analytics. It is the parent company of S&P Global Ratings, S&P Global Market Intelligence, S&P Global Mobility, S&P Global Engineering Solutions, S&P Global Sustainable1, and S&P Global Commodity Insights, CRISIL, and is the majority owner of the S&P Dow Jones Indices joint venture. \"S&P\" is a shortening of \"Standard and Poor's\"."
    },
    {
        "ticker": "CRM",
        "name": "Salesforce",
        "url": "https://en.wikipedia.org/wiki/Salesforce",
        "desc": "Salesforce, Inc. is an American cloud-based software company headquartered in San Francisco, California. It provides customer relationship management (CRM) software and applications focused on sales, customer service, marketing automation, e-commerce, analytics, and application development."
    },
    {
        "ticker": "SBAC",
        "name": "SBA Communications",
        "url": "https://en.wikipedia.org/wiki/SBA_Communications",
        "desc": "SBA Communications Corporation is a real estate investment trust which owns and operates wireless infrastructure in the United States, Canada, Central America, South America, and South Africa.[1]"
    },
    {
        "ticker": "SLB",
        "name": "Schlumberger",
        "url": "https://en.wikipedia.org/wiki/Schlumberger",
        "desc": "Schlumberger NV (French: [ʃlumbɛʁʒe, ʃlœ̃b-]), doing business as SLB, also known as Schlumberger Limited,[2] is an oilfield services company.[3][4] As of 2022, it is both the world's largest offshore drilling company and the world's largest offshore drilling contractor by revenue.[5]"
    },
    {
        "ticker": "STX",
        "name": "Seagate Technology",
        "url": "https://en.wikipedia.org/wiki/Seagate_Technology",
        "desc": "Seagate Technology Holdings plc is an American data storage company. It was incorporated in 1978 as Shugart Technology and commenced business in 1979.[2] Since 2010, the company has been incorporated in Dublin, Ireland, with operational headquarters in Fremont, California, United States."
    },
    {
        "ticker": "SEE",
        "name": "Sealed Air",
        "url": "https://en.wikipedia.org/wiki/Sealed_Air",
        "desc": "SEE, legally the Sealed Air Corporation, is a packaging company known for its brands: Cryovac food packaging and Bubble Wrap cushioning packaging.[2][3][4] Headquartered in Charlotte, North Carolina, United States, its current CEO is Ted Doheny.[3][5]"
    },
    {
        "ticker": "SRE",
        "name": "Sempra Energy",
        "url": "https://en.wikipedia.org/wiki/Sempra_Energy",
        "desc": "Sempra is a North American public utility holding company based in San Diego, California. The company is one of the largest utility holding companies in the United States with nearly 40 million consumers. Sempra's focus is on electric and natural gas infrastructure and its operating companies include: Southern California Gas Company (SoCalGas) and San Diego Gas & Electric (SDG&E) in Southern California; Oncor Electric Delivery Company in Texas; and Sempra Infrastructure, with offices in California."
    },
    {
        "ticker": "NOW",
        "name": "ServiceNow",
        "url": "https://en.wikipedia.org/wiki/ServiceNow",
        "desc": "ServiceNow, Inc. is an American software company based in Santa Clara, California that develops a cloud computing platform to help companies manage digital workflows for enterprise operations. Founded in 2003 by Fred Luddy, ServiceNow is listed on the New York Stock Exchange and is a constituent of the Russell 1000 Index and S&P 500 Index.[2] In 2018, Forbes magazine named it number one on its list of the world's most innovative companies.[3]"
    },
    {
        "ticker": "SHW",
        "name": "Sherwin-Williams",
        "url": "https://en.wikipedia.org/wiki/Sherwin-Williams",
        "desc": "Sherwin-Williams Company is an American company based in Cleveland, Ohio. It is primarily engaged in the manufacture, distribution, and sale of paints, coatings, floorcoverings, and related products to professional, industrial, commercial, and retail customers, primarily in North and South America and Europe. At the end of 2020, Sherwin-Willams had operations in over 120 countries.[2]"
    },
    {
        "ticker": "SPG",
        "name": "Simon Property Group",
        "url": "https://en.wikipedia.org/wiki/Simon_Property_Group",
        "desc": "Simon Property Group, Inc. is an American real estate investment trust that invests in shopping malls, outlet centers, and community/lifestyle centers. It is the largest owner of shopping malls in the United States and is headquartered in Indianapolis, Indiana. Worldwide, it owns interests in 232 properties[3] as of 2021."
    },
    {
        "ticker": "SWKS",
        "name": "Skyworks Solutions",
        "url": "https://en.wikipedia.org/wiki/Skyworks_Solutions",
        "desc": "Skyworks Solutions, Inc. is an American semiconductor company headquartered in Irvine, California, United States, and a constituent of the S&P 500."
    },
    {
        "ticker": "SJM",
        "name": "J.M. Smucker Company (The)",
        "url": "https://en.wikipedia.org/wiki/The_J.M._Smucker_Company",
        "desc": "The J.M. Smucker Company, also known as Smuckers, is an American manufacturer of food and beverage products. Headquartered in Orrville, Ohio,[2] the company was founded in 1897 as a maker of apple butter.[3] J.M. Smucker currently has three major business units: consumer foods, pet foods, and coffee.[4] Its flagship brand, Smucker's, produces fruit preserves, peanut butter, syrups, frozen crustless sandwiches, and ice cream toppings.[5]"
    },
    {
        "ticker": "SNA",
        "name": "Snap-on",
        "url": "https://en.wikipedia.org/wiki/Snap-on",
        "desc": "Snap-on Incorporated is an American designer, manufacturer and marketer of high-end tools and equipment for professional use in the transportation industry including the automotive, heavy duty, equipment, marine, aviation, and railroad industries. Headquartered in Kenosha, Wisconsin, Snap-on also distributes lower-end tools under the brand name Blue-Point. Their primary competitors include Matco, Mac Tools, and Cornwell Tools."
    },
    {
        "ticker": "SEDG",
        "name": "SolarEdge",
        "url": "https://en.wikipedia.org/wiki/SolarEdge",
        "desc": "Established in 2006, SolarEdge developed an DC optimized inverter system."
    },
    {
        "ticker": "SO",
        "name": "Southern Company",
        "url": "https://en.wikipedia.org/wiki/Southern_Company",
        "desc": "Southern Company is an American gas and electric utility holding company based in the southern United States. It is headquartered in Atlanta, Georgia, with executive offices also located in Birmingham, Alabama. The company is the second largest utility company in the U.S. in terms of customer base, as of 2021. Through its subsidiaries it serves 9 million gas and electric utility customers in 6 states. Southern Company's regulated regional electric utilities serve a 120,000-square-mile (310,000 km2) territory with 27,000 miles (43,000 km) of distribution lines.[3]"
    },
    {
        "ticker": "LUV",
        "name": "Southwest Airlines",
        "url": "https://en.wikipedia.org/wiki/Southwest_Airlines",
        "desc": "Southwest Airlines Co. is a major airline based in the United States and the world's largest low-cost carrier.[3] It is headquartered in Dallas, Texas, and has scheduled service to 121 destinations in the United States and 10 additional countries.[4] As of 2018, Southwest carried more domestic passengers than any other United States airline.[5] It is currently the third largest airline in North America based on passengers flown.[6]"
    },
    {
        "ticker": "SWK",
        "name": "Stanley Black & Decker",
        "url": "https://en.wikipedia.org/wiki/Stanley_Black_%26_Decker",
        "desc": "Stanley Black & Decker, Inc., formerly known as The Stanley Works, is a Fortune 500 American manufacturer of industrial tools and household hardware, and a provider of security products. Headquartered in the greater Hartford city of New Britain, Connecticut,[3] Stanley Black & Decker is the result of the merger of The Stanley Works and Black & Decker on March 12, 2010.[4]"
    },
    {
        "ticker": "SBUX",
        "name": "Starbucks",
        "url": "https://en.wikipedia.org/wiki/Starbucks",
        "desc": "Starbucks Corporation is an American multinational chain of coffeehouses and roastery reserves headquartered in Seattle, Washington. It is the world's largest coffeehouse chain."
    },
    {
        "ticker": "STT",
        "name": "State Street Corporation",
        "url": "https://en.wikipedia.org/wiki/State_Street_Corporation",
        "desc": "State Street Corporation (stylized in all caps), is an American[3] financial services and bank holding company headquartered at One Congress Street in Boston with operations worldwide. It is the second-oldest continually operating United States bank; its predecessor, Union Bank, was founded in 1792. State Street is ranked 15th on the list of largest banks in the United States by assets. It is one of the largest asset management companies in the world with US$3.9 trillion under management and US$43.3 trillion under custody and administration. It is the largest custodian bank in the world, providing securities services[4][5] and it is considered a systemically important bank by the Financial Stability Board.[6][7] Along with BlackRock and Vanguard, State Street is considered to be one of the Big Three index fund managers that dominate corporate America.[8][9]"
    },
    {
        "ticker": "STLD",
        "name": "Steel Dynamics",
        "url": "https://en.wikipedia.org/wiki/Steel_Dynamics",
        "desc": "Steel Dynamics, Inc., sometimes abbreviated as \"SDI\", is an American steel producer based in Fort Wayne, Indiana."
    },
    {
        "ticker": "STE",
        "name": "Steris",
        "url": "https://en.wikipedia.org/wiki/Steris",
        "desc": "Steris plc is an Irish-domiciled medical equipment company specializing in sterilization and surgical products for the US healthcare system.[4] Steris is operationally headquartered in Mentor, Ohio,[1] but has been legally registered since 2018 in Dublin, Ireland for tax purposes; it was previously registered in the United Kingdom from 2014 to 2018. Steris is quoted on the NYSE, and is a constituent of the S&P 500 Index.[5]"
    },
    {
        "ticker": "SYK",
        "name": "Stryker Corporation",
        "url": "https://en.wikipedia.org/wiki/Stryker_Corporation",
        "desc": "Stryker Corporation is an American multinational medical technologies corporation based in Kalamazoo, Michigan.[2] Stryker's products include implants used in joint replacement and trauma surgeries; surgical equipment and surgical navigation systems; endoscopic and communications systems; patient handling and emergency medical equipment; neurosurgical, neurovascular and spinal devices; as well as other medical device products used in a variety of medical specialties."
    },
    {
        "ticker": "SYF",
        "name": "Synchrony Financial",
        "url": "https://en.wikipedia.org/wiki/Synchrony_Financial",
        "desc": "Synchrony Financial is a consumer financial services company headquartered in Stamford, Connecticut, United States.[2] The company offers consumer financing products, including credit, promotional financing and loyalty programs, installment lending to industries, and FDIC-insured consumer savings products, through Synchrony Bank, its wholly owned online bank subsidiary.[4][8]"
    },
    {
        "ticker": "SNPS",
        "name": "Synopsys",
        "url": "https://en.wikipedia.org/wiki/Synopsys",
        "desc": "Synopsys is an American electronic design automation (EDA) company headquartered in Sunnyvale, California, that focuses on silicon design and verification, silicon intellectual property and software security and quality. Synopsys supplies tools and services to the semiconductor design and manufacturing industry. Products include tools for logic synthesis and physical design of integrated circuits, simulators for development, and debugging environments that assist in the design of the logic for chips and computer systems. As of 2023, the company is a component of both the Nasdaq-100 and S&P 500 indices.[3]"
    },
    {
        "ticker": "SYY",
        "name": "Sysco",
        "url": "https://en.wikipedia.org/wiki/Sysco",
        "desc": "Sysco Corporation (short for Systems and Services Company) is an American multinational corporation involved in marketing and distributing food products, smallwares, kitchen equipment and tabletop items to restaurants, healthcare and educational facilities, hospitality businesses like hotels and inns, and wholesale to other companies that provide foodservice (like Aramark and Sodexo). The company is headquartered in the Energy Corridor district of Houston, Texas.[2] Sysco is the world's largest broadline food distributor; it has more than 600,000 clients in a wide array of fields. Management consulting is also an integral part of their services. The company operates approximately 330 distribution facilities worldwide; providing service to over 90 countries."
    },
    {
        "ticker": "TMUS",
        "name": "T-Mobile US",
        "url": "https://en.wikipedia.org/wiki/T-Mobile_US",
        "desc": "T-Mobile US, Inc. /ˈtiː ˈmoʊbəˈl juː ɛs/ is an American wireless network operator headquartered in Overland Park, Kansas, and Bellevue, Washington, U.S.[4] Its largest shareholder is multinational telecommunications company Deutsche Telekom AG, which as of April 2023, holds a 53.3% majority stake in the company.[5][6] T-Mobile US is the third-largest wireless carrier in the United States, with 116.7 million subscribers at the end of Q2 2023.[7]"
    },
    {
        "ticker": "TROW",
        "name": "T. Rowe Price",
        "url": "https://en.wikipedia.org/wiki/T._Rowe_Price",
        "desc": "T. Rowe Price Group, Inc. is an American publicly owned global investment management firm that offers funds, subadvisory services, separate account management, and retirement plans and services for individuals, institutions, and financial intermediaries.[3] The firm has assets under management of more than $1.6 trillion and annual revenues of $6.2 billion as of 2020, placing it 447 on the Fortune 500 list of the largest U.S. companies.[4] Headquartered at 100 East Pratt Street in Baltimore, Maryland, it has 5,000 employees in Baltimore and 16 international offices serving clients in 47 countries.[5]"
    },
    {
        "ticker": "TTWO",
        "name": "Take-Two Interactive",
        "url": "https://en.wikipedia.org/wiki/Take-Two_Interactive",
        "desc": "Take-Two Interactive Software, Inc. is an American video game holding company based in New York City founded by Ryan Brant in September 1993."
    },
    {
        "ticker": "TPR",
        "name": "Tapestry, Inc.",
        "url": "https://en.wikipedia.org/wiki/Tapestry,_Inc.",
        "desc": "Tapestry, Inc. is an American multinational luxury fashion holding company. It is based in New York City and is the parent company of three major brands: Coach New York, Kate Spade New York and Stuart Weitzman. Additionally through its purchase of Capri Holdings, it owns Versace, Jimmy Choo, and Michael Kors. Originally named Coach, Inc., the business changed its name to Tapestry on October 31, 2017.[4]"
    },
    {
        "ticker": "TRGP",
        "name": "Targa Resources",
        "url": "https://en.wikipedia.org/wiki/Targa_Resources",
        "desc": "Targa Resources Corp. is a Fortune 500[1] company based in Houston, Texas. Targa, a midstream energy infrastructure corporation, is one of the largest infrastructure companies delivering natural gas and natural gas liquids in the United States. Their operations are based largely, though not entirely, on the Gulf Coast, particularly in Texas and Louisiana.[2] Matthew J. Meloy has been Chief Executive Officer since 2020.[3]"
    },
    {
        "ticker": "TGT",
        "name": "Target Corporation",
        "url": "https://en.wikipedia.org/wiki/Target_Corporation",
        "desc": "Target is an American retail corporation that operates a chain of discount department stores and hypermarkets, headquartered in Minneapolis, Minnesota. It is the seventh-largest retailer in the United States, and a component of the S&P 500 Index.[3] The company is one of the largest American-owned private employers in the United States."
    },
    {
        "ticker": "TEL",
        "name": "TE Connectivity",
        "url": "https://en.wikipedia.org/wiki/TE_Connectivity",
        "desc": "TE Connectivity[3] is an American Swiss-domiciled technology company that designs and manufactures connectors and sensors for several industries, such as automotive, industrial equipment, data communication systems, aerospace, defense, medical, oil and gas, consumer electronics and energy."
    },
    {
        "ticker": "TDY",
        "name": "Teledyne Technologies",
        "url": "https://en.wikipedia.org/wiki/Teledyne_Technologies",
        "desc": "Teledyne Technologies Incorporated is an American industrial conglomerate. It was founded in 1960, as Teledyne, Inc., by Henry Singleton and George Kozmetsky."
    },
    {
        "ticker": "TFX",
        "name": "Teleflex",
        "url": "https://en.wikipedia.org/wiki/Teleflex",
        "desc": "Teleflex Incorporated, headquartered in Wayne, Pennsylvania, is an American provider of specialty medical devices for a range of procedures in critical care and surgery. Teleflex has annual revenues of $2.4 billion, operations in 40 countries, and more than 15,000 employees. By 2011, the company had substantially realigned to focus on its current business as a medical-device manufacturer, having undergone several years of active acquisitions and divestitures.[4] Teleflex has been associated with Irish corporate tax avoidance tools.[5] Teleflex's chief executive officer (CEO) is Liam J. Kelly; Kelly is also the company's president and former chief operating officer.[6]"
    },
    {
        "ticker": "TER",
        "name": "Teradyne",
        "url": "https://en.wikipedia.org/wiki/Teradyne",
        "desc": "Teradyne, Inc. is an American automatic test equipment (ATE) designer and manufacturer based in North Reading, Massachusetts. Teradyne's high-profile customers include Samsung, Qualcomm, Intel, Analog Devices, Texas Instruments and IBM.[2]"
    },
    {
        "ticker": "TSLA",
        "name": "Tesla, Inc.",
        "url": "https://en.wikipedia.org/wiki/Tesla,_Inc.",
        "desc": "Tesla, Inc. (/ˈtɛslə/ TESS-lə or /ˈtɛzlə/ TEZ-lə[a]) is an American multinational automotive and clean energy company headquartered in Austin, Texas, which designs and manufactures electric vehicles (cars and trucks), stationary battery energy storage devices from home to grid-scale, solar panels and solar shingles, and related products and services. Its subsidiary Tesla Energy develops and is a major installer of photovoltaic systems in the United States and is one of the largest global suppliers of battery energy storage systems with 6.5 gigawatt-hours (GWh) installed in 2022."
    },
    {
        "ticker": "TXN",
        "name": "Texas Instruments",
        "url": "https://en.wikipedia.org/wiki/Texas_Instruments",
        "desc": "Texas Instruments Incorporated (TI) is an American technology company headquartered in Dallas, Texas, that designs and manufactures semiconductors and various integrated circuits, which it sells to electronics designers and manufacturers globally.[5] It is one of the top 10 semiconductor companies worldwide based on sales volume.[6] The company's focus is on developing analog chips and embedded processors, which account for more than 80% of its revenue.[7] TI also produces TI digital light processing technology and education technology[7] products including calculators, microcontrollers, and multi-core processors. The company holds 45,000 patents worldwide as of 2016.[8]"
    },
    {
        "ticker": "TXT",
        "name": "Textron",
        "url": "https://en.wikipedia.org/wiki/Textron",
        "desc": "Textron Inc. is an American industrial conglomerate based in Providence, Rhode Island. Textron's subsidiaries include Arctic Cat, Bell Textron, Textron Aviation (which itself includes the Beechcraft and Cessna brands), and Lycoming Engines. It was founded by Royal Little in 1923 as the Special Yarns Company. In 2020, Textron employed over 33,000 people in 25 different countries.[2] The company ranked 265th on the 2021 Fortune 500 of the largest United States corporations by revenue.[3]"
    },
    {
        "ticker": "TMO",
        "name": "Thermo Fisher Scientific",
        "url": "https://en.wikipedia.org/wiki/Thermo_Fisher_Scientific",
        "desc": "Thermo Fisher Scientific Inc. is an American supplier of analytical instruments, life sciences solutions, specialty diagnostics, laboratory, pharmaceutical and biotechnology services. Based in Waltham, Massachusetts, Thermo Fisher was formed through the merger of Thermo Electron and Fisher Scientific in 2006. Thermo Fisher Scientific has acquired other reagent, consumable, instrumentation, and service providers, including Life Technologies Corporation (2013),[2] Alfa Aesar (2015),[3] Affymetrix (2016),[4] FEI Company (2016),[5] BD Advanced Bioprocessing (2018),[6] and PPD (2021).[7]"
    },
    {
        "ticker": "TJX",
        "name": "TJX Companies",
        "url": "https://en.wikipedia.org/wiki/TJX_Companies",
        "desc": "The TJX Companies, Inc. (abbreviated TJX) is an American multinational off-price department store corporation, headquartered in Framingham, Massachusetts.[6] It was formed as a subsidiary of Zayre Corp. in 1987, and became the legal successor to Zayre Corp. following a company reorganization in 1989."
    },
    {
        "ticker": "TSCO",
        "name": "Tractor Supply",
        "url": "https://en.wikipedia.org/wiki/Tractor_Supply",
        "desc": "Tractor Supply Company (also known as TSCO or TSC), founded in 1938, is an American retail chain of stores that sells products for home improvement, agriculture, lawn and garden maintenance, livestock, equine and pet care for recreational farmers and ranchers, pet owners, and landowners. The company has 2,000 stores and is headquartered in Brentwood, Tennessee. It is publicly traded on the NASDAQ under the ticker symbol TSCO and is a Fortune 500 company."
    },
    {
        "ticker": "TT",
        "name": "Trane Technologies",
        "url": "https://en.wikipedia.org/wiki/Trane_Technologies",
        "desc": "Trane Technologies plc is a manufacturing company focused on heating, ventilation, and air conditioning (HVAC) and refrigeration systems. The company traces its corporate history back more than 150 years and was created after a series of mergers and spin-offs. In 2008, HVAC manufacturer Trane was acquired by Ingersoll Rand, a US industrial tools manufacturer. In 2020, the tools business was spun off as Ingersoll Rand and the remaining company was renamed Trane Technologies."
    },
    {
        "ticker": "TDG",
        "name": "TransDigm Group",
        "url": "https://en.wikipedia.org/wiki/TransDigm_Group",
        "desc": "TransDigm Group is a publicly traded aerospace manufacturing company headquartered in Cleveland, Ohio. TransDigm develops and manufactures engineered aerospace components. It was founded in 1993, when four industrial aerospace companies were combined by a private equity firm in a leveraged buyout. TransDigm expanded the range of aerospace components it manufactures through acquisitions over the years. It filed an initial public offering on the New York Stock Exchange in 2006."
    },
    {
        "ticker": "TRV",
        "name": "Travelers Companies (The)",
        "url": "https://en.wikipedia.org/wiki/The_Travelers_Companies",
        "desc": "The Travelers Companies, Inc., commonly known as Travelers, is an American insurance company. It is the second-largest writer of U.S. commercial property casualty insurance, and the sixth-largest writer of U.S. personal insurance through independent agents.[3][4][citation needed] Travelers is incorporated in Minnesota, with headquarters in New York City, and its largest office in Hartford, Connecticut.[2] It has been a component of the Dow Jones Industrial Average since June 8, 2009.[5]"
    },
    {
        "ticker": "TRMB",
        "name": "Trimble Inc.",
        "url": "https://en.wikipedia.org/wiki/Trimble_Inc.",
        "desc": "Trimble Inc. is an American software, hardware, and services technology company. Trimble supports global industries in building & construction, agriculture, geospatial, natural resources and utilities, governments, transportation and others.[2] Trimble also does hardware development of global navigation satellite system (GNSS) receivers, scanners, laser rangefinders, unmanned aerial vehicles (UAVs), inertial navigation systems and software processing tools."
    },
    {
        "ticker": "TFC",
        "name": "Truist",
        "url": "https://en.wikipedia.org/wiki/Truist_Financial",
        "desc": "Truist Financial Corporation is an American bank holding company headquartered in Charlotte, North Carolina.[8] The company was formed in December 2019 as the result of the merger of BB&T (Branch Banking and Trust Company) and SunTrust Banks.[1][9][10] Its bank operates 2,781 branches in 15 states and Washington, D.C., and offers consumer and commercial banking, securities brokerage, asset management, mortgage, and insurance products and services.[3] It is on the list of largest banks in the United States by assets; as of August 2023, it is the 9th largest bank with $514 billion in assets.[5][11] As of January 2021, Truist Insurance Holdings is the seventh largest insurance broker in the world, with $2.27 billion in annual revenue.[12][7]"
    },
    {
        "ticker": "TYL",
        "name": "Tyler Technologies",
        "url": "https://en.wikipedia.org/wiki/Tyler_Technologies",
        "desc": "Tyler Technologies, Inc., based in Plano, Texas, is a provider of software to the United States public sector. Tyler Technologies has offices in 17 states and one in Toronto, Ontario, Canada.[2]"
    },
    {
        "ticker": "TSN",
        "name": "Tyson Foods",
        "url": "https://en.wikipedia.org/wiki/Tyson_Foods",
        "desc": "Tyson Foods, Inc. is an American multinational corporation based in Springdale, Arkansas that operates in the food industry. The company is the world's second-largest processor and marketer of chicken, beef, and pork after JBS S.A. It annually exports the largest percentage of beef out of the United States. Together with its subsidiaries, it operates major food brands, including Jimmy Dean, Hillshire Farm, Ball Park, Wright Brand, Aidells, and State Fair.[2] Tyson Foods ranked No. 79 in the 2020 Fortune 500 list of the largest United States corporations by total revenue.[3]"
    },
    {
        "ticker": "USB",
        "name": "U.S. Bank",
        "url": "https://en.wikipedia.org/wiki/U.S._Bank",
        "desc": "U.S. Bancorp (stylized as us bancorp) is an American bank holding company based in Minneapolis, Minnesota, and incorporated in Delaware.[4] It is the parent company of U.S. Bank National Association, and is the fifth largest banking institution in the United States.[5] The company provides banking, investment, mortgage, trust, and payment services products to individuals, businesses, governmental entities, and other financial institutions. It has 3,106 branches and 4,842 automated teller machines, primarily in the Western and Midwestern United States.[2] It is ranked 117th on the Fortune 500,[6] and it is considered a systemically important bank by the Financial Stability Board. The company also owns Elavon, a processor of credit card transactions for merchants, and Elan Financial Services, a credit card issuer that issues credit card products on behalf of small credit unions and banks across the U.S.[7]"
    },
    {
        "ticker": "UDR",
        "name": "UDR, Inc.",
        "url": "https://en.wikipedia.org/wiki/UDR,_Inc.",
        "desc": "UDR Inc. (formerly United Dominion Realty) is a publicly traded real estate investment trust that invests in apartments. The company is organized in Maryland with its headquarters in Highlands Ranch, Colorado. As of December 31, 2020, the company owned interests in 149 apartment communities containing 48,283 apartment units.[1]"
    },
    {
        "ticker": "ULTA",
        "name": "Ulta Beauty",
        "url": "https://en.wikipedia.org/wiki/Ulta_Beauty",
        "desc": "Ulta Beauty, Inc., formerly known as Ulta Salon, Cosmetics & Fragrance Inc. and before 2000 as Ulta3, is an American chain of beauty stores headquartered in Bolingbrook, Illinois.[3] Ulta Beauty carries both high-end and low-end cosmetics, fragrances, nail products, bath and body products, beauty tools and haircare products. Each store also has a beauty salon."
    },
    {
        "ticker": "UNP",
        "name": "Union Pacific Corporation",
        "url": "https://en.wikipedia.org/wiki/Union_Pacific_Corporation",
        "desc": "Union Pacific Corporation is a publicly traded railroad holding company. It was incorporated in Utah in 1969 and is headquartered in Omaha, Nebraska. It is the parent company of the current, Delaware-registered, form of the Union Pacific Railroad, and the company, along with Berkshire Hathaway-owned rival BNSF, has a near-duopoly on freight railroad transportation west of the Mississippi River.[2]"
    },
    {
        "ticker": "UAL",
        "name": "United Airlines Holdings",
        "url": "https://en.wikipedia.org/wiki/United_Airlines_Holdings",
        "desc": "United Airlines Holdings, Inc. (formerly known as United Continental Holdings, Inc., UAL Corporation, Allegis Corporation and founded originally as UAL, Inc.[4]) is a publicly traded airline holding company headquartered in the Willis Tower in Chicago.[5] UAH owns and operates United Airlines, Inc."
    },
    {
        "ticker": "UPS",
        "name": "United Parcel Service",
        "url": "https://en.wikipedia.org/wiki/United_Parcel_Service",
        "desc": "United Parcel Service (UPS, stylized as ups) is an American multinational shipping & receiving and supply chain management company founded in 1907.[1] Originally known as the American Messenger Company specializing in telegraphs, UPS has grown to become a Fortune 500 company[6] and one of the world's largest shipping couriers. UPS today is primarily known for its ground shipping services as well as the UPS Store, a retail chain which assists UPS shipments and provides tools for small businesses. UPS offers air shipping on an overnight or two-day basis and delivers to post office boxes through UPS Mail Innovations and UPS SurePost, two services that pass on packages to the United States Postal Service for last-mile delivery.[7][8]"
    },
    {
        "ticker": "URI",
        "name": "United Rentals",
        "url": "https://en.wikipedia.org/wiki/United_Rentals",
        "desc": "United Rentals, Inc (NYSE: URI) is an American publicly traded company; it is the world's largest equipment rental company, with about 16 percent of the North American market share as of 2022.[5] It owns the largest rental fleet in the world with approximately 4,700 classes of equipment totaling about $19.3 billion in original equipment cost (OEC) as of 2022.[3] The company has a combined total of 1,449 locations, including an integrated network of 1,390 rental locations in North America, 13 in Europe, 27 in Australia and 19 in New Zealand. In North America, the company operates in 49 U.S. states and Puerto Rico and in every Canadian province.[3] In 2017, United Rentals' revenue totaled more than $6.64 billion, with over $1.35 billion in profit.[6] It is ranked #424 on the Fortune 500,[7] and #1183 on the Forbes Global 2000 list of the world's largest public companies.[8]"
    },
    {
        "ticker": "UNH",
        "name": "UnitedHealth Group",
        "url": "https://en.wikipedia.org/wiki/UnitedHealth_Group",
        "desc": "UnitedHealth Group Incorporated is an American multinational managed healthcare and insurance company based in Minnetonka, Minnesota. Offering insurance services under UnitedHealthcare and healthcare products under Optum, it is the world's eleventh-largest company by revenue and the largest healthcare company by revenue, and the largest insurance company by net premiums. Optum and UnitedHealthcare had roughly equal earnings from operations in 2022."
    },
    {
        "ticker": "UHS",
        "name": "Universal Health Services",
        "url": "https://en.wikipedia.org/wiki/Universal_Health_Services",
        "desc": "Universal Health Services, Inc. (UHS) is an American Fortune 500 company[1] that provides hospital and healthcare services, based in King of Prussia, Pennsylvania. In 2022, its annual revenues were $13.4 billion.[2]"
    },
    {
        "ticker": "VLO",
        "name": "Valero Energy",
        "url": "https://en.wikipedia.org/wiki/Valero_Energy",
        "desc": "Valero Energy Corporation is an American-based downstream petroleum company mostly involved in manufacturing and marketing transportation fuels, other petrochemical products, and power. It is headquartered in San Antonio, Texas, United States.[2] Throughout the United States and Canada, the company owns and operates 15 refineries, and one in Wales, with a combined throughput capacity of approximately 3 million barrels (480,000 m3) per day, 11 ethanol plants with a combined production capacity of 1.2 billion US gallons (4,500,000 m3) per year, and a 50-megawatt wind farm. A Fortune 500 company, before the 2013 spinoff of CST Brands, Valero was one of the United States' largest retail operators with approximately 6,800 retail and branded wholesale outlets in the United States, Canada, United Kingdom, Mexico and Peru under the Valero, Diamond Shamrock, Shamrock, Beacon, and Texaco brands.[3]"
    },
    {
        "ticker": "VTR",
        "name": "Ventas",
        "url": "https://en.wikipedia.org/wiki/Ventas_(company)",
        "desc": "Ventas, Inc. is a real estate investment trust specializing in the ownership and management of health care facilities in the United States, Canada and the United Kingdom."
    },
    {
        "ticker": "VLTO",
        "name": "Veralto",
        "url": "https://en.wikipedia.org/wiki/Veralto",
        "desc": "Danaher Corporation is an American globally diversified conglomerate founded by brothers Steven and Mitchell Rales in 1984. Headquartered in Washington, D.C., the company designs, manufactures, and markets medical, industrial, and commercial products and services.[1] It has primarily grown by acquisitions, and historically has tried to maintain a very low public profile.[2][3] Danaher was one of the first companies in North America to adopt the Kaizen principles to manufacturing,[4] which is a lean manufacturing Japanese philosophy of continuous improvement and elimination of waste.[5]"
    },
    {
        "ticker": "VRSN",
        "name": "Verisign",
        "url": "https://en.wikipedia.org/wiki/Verisign",
        "desc": "Verisign Inc. is an American company based in Reston, Virginia, United States, that operates a diverse array of network infrastructure, including two of the Internet's thirteen root nameservers, the authoritative registry for the .com, .net, and .name generic top-level domains and the .cc country-code top-level domains, and the back-end systems for the .jobs and .edu sponsored top-level domains."
    },
    {
        "ticker": "VRSK",
        "name": "Verisk",
        "url": "https://en.wikipedia.org/wiki/Verisk",
        "desc": "Verisk Analytics, Inc. is an American multinational data analytics and risk assessment firm based in Jersey City, New Jersey, with customers in insurance, natural resources, financial services, government, and risk management sectors. The company uses proprietary data sets and industry expertise to provide predictive analytics and decision support consultations in areas including fraud prevention, actuarial science, insurance coverage, fire protection, catastrophe and weather risk, and data management."
    },
    {
        "ticker": "VZ",
        "name": "Verizon",
        "url": "https://en.wikipedia.org/wiki/Verizon",
        "desc": "Verizon Communications Inc. (/vəˈraɪzən/) is an American multinational telecommunications conglomerate. The company is incorporated in Delaware, and headquartered at 1095 Avenue of the Americas in Midtown Manhattan, New York City.[3] Verizon's capital stock is a component of the Dow Jones Industrial Average.[10]"
    },
    {
        "ticker": "VRTX",
        "name": "Vertex Pharmaceuticals",
        "url": "https://en.wikipedia.org/wiki/Vertex_Pharmaceuticals",
        "desc": "Vertex Pharmaceuticals is an American biopharmaceutical company based in Boston, Massachusetts. It was one of the first biotech firms to use an explicit strategy of rational drug design rather than combinatorial chemistry. It maintains headquarters in South Boston, Massachusetts, and three research facilities, in San Diego, California, and Milton Park, Oxfordshire, England."
    },
    {
        "ticker": "VFC",
        "name": "VF Corporation",
        "url": "https://en.wikipedia.org/wiki/VF_Corporation",
        "desc": "VF Corporation (formerly Vanity Fair Mills until 1969) is an American global apparel and footwear company founded in 1899 by John Barbey and headquartered in Denver, Colorado.[4] The company's 13 brands are organized into three categories: Outdoor, Active and Work.[5] In 2015, the company controlled 55% of the U.S. backpack market with the JanSport, Eastpak, Timberland, and The North Face brands.[6]"
    },
    {
        "ticker": "VTRS",
        "name": "Viatris",
        "url": "https://en.wikipedia.org/wiki/Viatris",
        "desc": "Viatris Inc. is an American global pharmaceutical and healthcare corporation headquartered in Canonsburg, Pennsylvania. The corporation was formed through the merger of Mylan and Upjohn, a legacy division of Pfizer, on November 16, 2020.[8]"
    },
    {
        "ticker": "VICI",
        "name": "Vici Properties",
        "url": "https://en.wikipedia.org/wiki/Vici_Properties",
        "desc": "Vici Properties Inc. is a real estate investment trust (REIT) specializing in casino properties, based in New York City. It was formed in 2017 as a spin-off from Caesars Entertainment Corporation as part of its bankruptcy reorganization. It owns 53 casinos, hotels, and racetracks and 4 golf courses around the United States and Canada."
    },
    {
        "ticker": "V",
        "name": "Visa Inc.",
        "url": "https://en.wikipedia.org/wiki/Visa_Inc.",
        "desc": "Visa Inc. (/ˈviːzə, ˈviːsə/; stylized as VISA) is an American multinational payment card services corporation headquartered in San Francisco, California.[1][4] It facilitates electronic funds transfers throughout the world, most commonly through Visa-branded credit cards, debit cards and prepaid cards.[5] Visa is one of the world's most valuable companies."
    },
    {
        "ticker": "VMC",
        "name": "Vulcan Materials Company",
        "url": "https://en.wikipedia.org/wiki/Vulcan_Materials_Company",
        "desc": "Vulcan Materials Company (NYSE: VMC) is an American company based in Birmingham, Alabama. It is principally engaged in the production, distribution and sale of construction materials. Vulcan is the largest producer of construction materials, primarily gravel, crushed stone, and sand, and employs approximately 12,000 people at over 400 facilities. Vulcan serves 22 states, the District of Columbia, Mexico, Canada, Bahamas and the U.S. Virgin Islands. Vulcan's innovative Crescent Market project led to construction of a large quarry and deep water seaport on the Yucatán Peninsula of Mexico, just south of Cancun. This quarry supplies Tampa, New Orleans, Houston, and Brownsville, Texas, as well as other Gulf coast seaports, with crushed limestone via large 62,000-ton self-discharging ships."
    },
    {
        "ticker": "WAB",
        "name": "Wabtec",
        "url": "https://en.wikipedia.org/wiki/Wabtec",
        "desc": "Westinghouse Air Brake Technologies Corporation, commonly known as Wabtec, is an American company formed by the merger of the Westinghouse Air Brake Company (WABCO) and MotivePower Industries Corporation in 1999.[6][7] It is headquartered in Pittsburgh, Pennsylvania."
    },
    {
        "ticker": "WBA",
        "name": "Walgreens Boots Alliance",
        "url": "https://en.wikipedia.org/wiki/Walgreens_Boots_Alliance",
        "desc": "Walgreens Boots Alliance, Inc. (WBA) is an American multinational holding company headquartered in Deerfield, Illinois,[2] which owns the retail pharmacy chains Walgreens in the US and Boots in the UK, as well as several pharmaceutical manufacturing and distribution companies. The company was formed on December 31, 2014, after Walgreens purchased the 55% stake in Alliance Boots that it did not already own. The total price of the acquisition was $4.9 billion in cash and 144.3 million common shares with fair value of $10.7 billion.[3] Walgreens had previously purchased 45% of the company for $4.0 billion and 83.4 million common shares in August 2012 with an option to purchase the remaining shares within three years.[4] Walgreens became a subsidiary of the newly created company after the transactions were completed.[5] As of 2022, Walgreens Boots Alliance is ranked #18 on the Fortune 500 rankings of the largest United States corporations by total revenue.[6]"
    },
    {
        "ticker": "WMT",
        "name": "Walmart",
        "url": "https://en.wikipedia.org/wiki/Walmart",
        "desc": "Walmart Inc. ( /ˈwɔːlmɑːrt/ ⓘ; formerly Wal-Mart Stores, Inc.) is an American multinational retail corporation that operates a chain of hypermarkets (also called supercenters), discount department stores, and grocery stores in the United States, headquartered in Bentonville, Arkansas.[10] The company was founded by brothers Sam and James \"Bud\" Walton in nearby Rogers, Arkansas in 1962 and incorporated under Delaware General Corporation Law on October 31, 1969. It also owns and operates Sam's Club retail warehouses.[11][12]"
    },
    {
        "ticker": "WBD",
        "name": "Warner Bros. Discovery",
        "url": "https://en.wikipedia.org/wiki/Warner_Bros._Discovery",
        "desc": "Warner Bros. Discovery, Inc. (WBD) is an American multinational mass media and entertainment conglomerate headquartered in New York City. It was formed from WarnerMedia's spin-off by AT&T and merger with Discovery, Inc. on April 8, 2022."
    },
    {
        "ticker": "WM",
        "name": "Waste Management",
        "url": "https://en.wikipedia.org/wiki/Waste_Management_(corporation)",
        "desc": "Waste Management, Inc., doing business as “WM”,[3][4] is a waste management, comprehensive waste, and environmental services company operating in North America. Founded in 1968, the company is headquartered in the Bank of America Tower in Houston, Texas."
    },
    {
        "ticker": "WAT",
        "name": "Waters Corporation",
        "url": "https://en.wikipedia.org/wiki/Waters_Corporation",
        "desc": "Waters Corporation is a publicly traded analytical laboratory instrument and software company headquartered in Milford, Massachusetts. The company employs more than 7,800[2] people, with manufacturing facilities located in Milford, Taunton, Massachusetts; Wexford, Ireland and Wilmslow,[3] Cheshire. Waters has Sites in 35 countries globally including Frankfurt, Singapore, India, Germany and in Japan."
    },
    {
        "ticker": "WEC",
        "name": "WEC Energy Group",
        "url": "https://en.wikipedia.org/wiki/WEC_Energy_Group",
        "desc": "WEC Energy Group is an American company based in Milwaukee, Wisconsin that provides electricity and natural gas to 4.4 million customers across four states.[1]"
    },
    {
        "ticker": "WFC",
        "name": "Wells Fargo",
        "url": "https://en.wikipedia.org/wiki/Wells_Fargo",
        "desc": "Wells Fargo & Company is an American multinational financial services company with a significant global presence.[4][3] The company operates in 35 countries and serves over 70 million customers worldwide.[3] It is a systemically important financial institution according to the Financial Stability Board, and is considered one of the \"Big Four Banks\" in the United States, alongside JPMorgan Chase, Bank of America, and Citigroup.[5]"
    },
    {
        "ticker": "WELL",
        "name": "Welltower",
        "url": "https://en.wikipedia.org/wiki/Welltower",
        "desc": "Welltower Inc. is a real estate investment trust that invests in healthcare infrastructure. Based on its 2021 revenue, it ranked 630th on the 2021 Fortune 1000,[3] and is a component of the S&P 500. As of early 2021, the firm had an enterprise value of $50 billion and is the world's largest healthcare real estate investment trust.[4][5][6][7]"
    },
    {
        "ticker": "WST",
        "name": "West Pharmaceutical Services",
        "url": "https://en.wikipedia.org/wiki/West_Pharmaceutical_Services",
        "desc": "[1]"
    },
    {
        "ticker": "WDC",
        "name": "Western Digital",
        "url": "https://en.wikipedia.org/wiki/Western_Digital",
        "desc": "Western Digital Corporation (WDC, commonly known as Western Digital or WD) is an American computer drive manufacturer and data storage company, headquartered in San Jose, California. It designs, manufactures and sells data technology products, including data storage devices, data center systems and cloud storage services."
    },
    {
        "ticker": "WRK",
        "name": "WestRock",
        "url": "https://en.wikipedia.org/wiki/WestRock",
        "desc": "WestRock is an American corrugated packaging company. It was formed in July 2015 after the merger of MeadWestvaco and RockTenn.[2] WestRock is the 2nd largest American packaging company. It is one of the world's largest paper and packaging companies with US$21.3 billion in annual revenue and more than 50,000 team members in more than 300 locations in 30 countries around the world.[3][4][5] The company is headquartered in Sandy Springs, Georgia, consolidating offices from Norcross, Georgia and Richmond, Virginia.[6]"
    },
    {
        "ticker": "WY",
        "name": "Weyerhaeuser",
        "url": "https://en.wikipedia.org/wiki/Weyerhaeuser",
        "desc": "The Weyerhaeuser Company (/ˈwɛərhaʊzər/) is an American timberland company which owns nearly 12,400,000 acres (19,400 sq mi; 50,000 km2) of timberlands in the U.S., and manages an additional 14,000,000 acres (22,000 sq mi; 57,000 km2) of timberlands under long-term licenses in Canada.[5] The company has manufactured wood products for over a century.[6] It operates as a real estate investment trust (REIT).[5]"
    },
    {
        "ticker": "WHR",
        "name": "Whirlpool Corporation",
        "url": "https://en.wikipedia.org/wiki/Whirlpool_Corporation",
        "desc": "Whirlpool Corporation is an American multinational manufacturer and marketer of home appliances headquartered in Benton Charter Township, Michigan, United States.[2] The Fortune 500 company has annual revenue of approximately $21 billion, 78,000 employees, and more than 70 manufacturing and technology research centers globally.[3]"
    },
    {
        "ticker": "WMB",
        "name": "Williams Companies",
        "url": "https://en.wikipedia.org/wiki/Williams_Companies",
        "desc": "The Williams Companies, Inc., is an American energy company based in Tulsa, Oklahoma. Its core business is natural gas processing and transportation, with additional petroleum and electricity generation assets. A Fortune 500 company,[1] its common stock is a component of the S&P 500."
    },
    {
        "ticker": "WTW",
        "name": "Willis Towers Watson",
        "url": "https://en.wikipedia.org/wiki/Willis_Towers_Watson",
        "desc": "Willis Towers Watson Public Limited Company, branded as WTW and stylised in its logo as wtw, is a British-American multinational company providing insurance services. The company was founded in 2016, following a merger of the Willis Group and Towers Watson."
    },
    {
        "ticker": "GWW",
        "name": "W. W. Grainger",
        "url": "https://en.wikipedia.org/wiki/W._W._Grainger",
        "desc": "W. W. Grainger, Inc., is an American Fortune 500[5] industrial supply company founded in 1927 in Chicago by William W. (Bill) Grainger. He founded the company to provide consumers with access to a consistent supply of motors.[6] The company now serves more than three million customers worldwide[4] with offerings such as motors, lighting, material handling, fasteners, plumbing, tools, and safety supplies, along with inventory management services and technical support. Revenue is generally from business-to-business sales rather than retail sales. Grainger serves its customers through a network of approximately 598 branches, online channels (such as Grainger.com, KeepStock and eProcurement), and 33 distribution centers.[4]"
    },
    {
        "ticker": "WYNN",
        "name": "Wynn Resorts",
        "url": "https://en.wikipedia.org/wiki/Wynn_Resorts",
        "desc": "Wynn Resorts, Limited is an American publicly traded corporation based in Paradise, Nevada, that is a developer and operator of high-end hotels and casinos. It was founded in 2002 by former Mirage Resorts Chairman and CEO Steve Wynn, and is now run by CEO Craig Billings.[4] As of 2020, the company has developed six properties.[1]"
    },
    {
        "ticker": "XEL",
        "name": "Xcel Energy",
        "url": "https://en.wikipedia.org/wiki/Xcel_Energy",
        "desc": "Xcel Energy Inc. is a U.S. regulated electric utility and natural gas delivery company based in Minneapolis, Minnesota, serving more than 3.7 million electric customers and 2.1 million natural gas customers across parts of eight states (Colorado, Minnesota, Wisconsin, Michigan, North Dakota, South Dakota, Texas and New Mexico).[3] It consists of four operating subsidiaries: Northern States Power-Minnesota, Northern States Power-Wisconsin, Public Service Company of Colorado, and Southwestern Public Service Co.[4]"
    },
    {
        "ticker": "XYL",
        "name": "Xylem Inc.",
        "url": "https://en.wikipedia.org/wiki/Xylem_Inc.",
        "desc": "Xylem Inc. is a large American water technology provider, in public utility, residential, commercial, agricultural and industrial settings. The company does business in more than 150 countries. Launched in 2011 as the spinoff of the water-related businesses of ITT Corporation, Xylem is headquartered in Washington, DC, with 2018 revenues of $5.2 billion and 17,000 employees worldwide.[4][3]"
    },
    {
        "ticker": "YUM",
        "name": "Yum! Brands",
        "url": "https://en.wikipedia.org/wiki/Yum!_Brands",
        "desc": "Yum! Brands, Inc. (sometimes called simply Yum!), formerly Tricon Global Restaurants, Inc., is an American multinational fast food corporation listed on the Fortune 1000. Yum! operates the brands KFC, Pizza Hut, Taco Bell, and The Habit Burger Grill, except in China, where the brands are operated by a separate company, Yum China. Yum! previously also owned Long John Silver's and A&W Restaurants. The company was created as a spin-off of PepsiCo in 1997."
    },
    {
        "ticker": "ZBRA",
        "name": "Zebra Technologies",
        "url": "https://en.wikipedia.org/wiki/Zebra_Technologies",
        "desc": "Zebra Technologies Corporation is an American mobile computing company specializing in technology used to sense, analyze, and act in real time,[2] sometimes known as smart data capture. The company manufactures and sells marking, tracking, and computer printing technologies. Its products include mobile computers and tablets, software, thermal barcode label and receipt printers, RFID smart label printers/encoders/fixed & handheld readers/antennas, autonomous mobile robots (AMR’s) & machine vision (MV), and fixed industrial scanning hardware & software."
    },
    {
        "ticker": "ZBH",
        "name": "Zimmer Biomet",
        "url": "https://en.wikipedia.org/wiki/Zimmer_Biomet",
        "desc": "Zimmer Biomet Holdings, Inc. is a publicly traded medical device company. It was founded in 1927 to produce aluminum splints. The firm is headquartered in Warsaw, Indiana, where it is part of the medical devices business cluster."
    },
    {
        "ticker": "ZION",
        "name": "Zions Bancorporation",
        "url": "https://en.wikipedia.org/wiki/Zions_Bancorporation",
        "desc": "Zions Bancorporation is a national bank headquartered in Salt Lake City, Utah. It operates as a national bank rather than as a bank holding company and does business under the following seven brands: Zions Bank, Amegy Bank of Texas, California Bank and Trust, National Bank of Arizona, Nevada State Bank, Vectra Bank Colorado, and The Commerce Bank of Washington.[1] It has 416 branches and over 1 million customers.[1] It was founded by The Church of Jesus Christ of Latter-day Saints in 1873, although the church divested itself of its interest in the bank in 1960."
    },
    {
        "ticker": "ZTS",
        "name": "Zoetis",
        "url": "https://en.wikipedia.org/wiki/Zoetis",
        "desc": "Zoetis Inc. (/zō-EH-tis/[3]) is an American drug company, the world's largest producer of medicine and vaccinations for pets and livestock.[4][3][5] The company was a subsidiary of Pfizer, the world's largest drug maker, but with Pfizer's spinoff of its 83% interest in the firm it is now a completely independent company. The company directly markets its products in approximately 45 countries, and sells them in more than 100 countries. Operations outside the United States accounted for 50% of the total revenue.[4] Contemporaneous with the spinoff in June 2013 S&P Dow Jones Indices announced that Zoetis would replace First Horizon National Corporation in the S&P 500 stock market index.[6]"
    }
]